{
  "last_updated": "2025-09-23T00:49:09.582379",
  "papers": [
    {
      "title": "What is a good matching of probability measures? A counterfactual lens on transport maps",
      "authors": [
        "Lucas De Lara",
        "Luca Ganassali"
      ],
      "abstract": "Coupling probability measures lies at the core of many problems in statistics\nand machine learning, from domain adaptation to transfer learning and causal\ninference. Yet, even when restricted to deterministic transports, such\ncouplings are not identifiable: two atomless marginals admit infinitely many\ntransport maps. The common recourse to optimal transport, motivated by cost\nminimization and cyclical monotonicity, obscures the fact that several distinct\nnotions of multivariate monotone matchings coexist. In this work, we first\ncarry a comparative analysis of three constructions of transport maps:\ncyclically monotone, quantile-preserving and triangular monotone maps. We\nestablish necessary and sufficient conditions for their equivalence, thereby\nclarifying their respective structural properties. In parallel, we formulate\ncounterfactual reasoning within the framework of structural causal models as a\nproblem of selecting transport maps between fixed marginals, which makes\nexplicit the role of untestable assumptions in counterfactual reasoning. Then,\nwe are able to connect these two perspectives by identifying conditions on\ncausal graphs and structural equations under which counterfactual maps coincide\nwith classical statistical transports. In this way, we delineate the\ncircumstances in which causal assumptions support the use of a specific\nstructure of transport map. Taken together, our results aim to enrich the\ntheoretical understanding of families of transport maps and to clarify their\npossible causal interpretations. We hope this work contributes to establishing\nnew bridges between statistical transport and causal inference.",
      "pdf_url": "http://arxiv.org/pdf/2509.16027v1",
      "arxiv_url": "http://arxiv.org/abs/2509.16027v1",
      "published": "2025-09-19",
      "categories": [
        "stat.ML",
        "cs.LG",
        "math.ST",
        "stat.ME",
        "stat.TH"
      ]
    },
    {
      "title": "Generalized Deep Multi-view Clustering via Causal Learning with Partially Aligned Cross-view Correspondence",
      "authors": [
        "Xihong Yang",
        "Siwei Wang",
        "Jiaqi Jin",
        "Fangdi Wang",
        "Tianrui Liu",
        "Yueming Jin",
        "Xinwang Liu",
        "En Zhu",
        "Kunlun He"
      ],
      "abstract": "Multi-view clustering (MVC) aims to explore the common clustering structure\nacross multiple views. Many existing MVC methods heavily rely on the assumption\nof view consistency, where alignments for corresponding samples across\ndifferent views are ordered in advance. However, real-world scenarios often\npresent a challenge as only partial data is consistently aligned across\ndifferent views, restricting the overall clustering performance. In this work,\nwe consider the model performance decreasing phenomenon caused by data order\nshift (i.e., from fully to partially aligned) as a generalized multi-view\nclustering problem. To tackle this problem, we design a causal multi-view\nclustering network, termed CauMVC. We adopt a causal modeling approach to\nunderstand multi-view clustering procedure. To be specific, we formulate the\npartially aligned data as an intervention and multi-view clustering with\npartially aligned data as an post-intervention inference. However, obtaining\ninvariant features directly can be challenging. Thus, we design a Variational\nAuto-Encoder for causal learning by incorporating an encoder from existing\ninformation to estimate the invariant features. Moreover, a decoder is designed\nto perform the post-intervention inference. Lastly, we design a contrastive\nregularizer to capture sample correlations. To the best of our knowledge, this\npaper is the first work to deal generalized multi-view clustering via causal\nlearning. Empirical experiments on both fully and partially aligned data\nillustrate the strong generalization and effectiveness of CauMVC.",
      "pdf_url": "http://arxiv.org/pdf/2509.16022v1",
      "arxiv_url": "http://arxiv.org/abs/2509.16022v1",
      "published": "2025-09-19",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "CIDER: A Causal Cure for Brand-Obsessed Text-to-Image Models",
      "authors": [
        "Fangjian Shen",
        "Zifeng Liang",
        "Chao Wang",
        "Wushao Wen"
      ],
      "abstract": "Text-to-image (T2I) models exhibit a significant yet under-explored \"brand\nbias\", a tendency to generate contents featuring dominant commercial brands\nfrom generic prompts, posing ethical and legal risks. We propose CIDER, a\nnovel, model-agnostic framework to mitigate bias at inference-time through\nprompt refinement to avoid costly retraining. CIDER uses a lightweight detector\nto identify branded content and a Vision-Language Model (VLM) to generate\nstylistically divergent alternatives. We introduce the Brand Neutrality Score\n(BNS) to quantify this issue and perform extensive experiments on leading T2I\nmodels. Results show CIDER significantly reduces both explicit and implicit\nbiases while maintaining image quality and aesthetic appeal. Our work offers a\npractical solution for more original and equitable content, contributing to the\ndevelopment of trustworthy generative AI.",
      "pdf_url": "http://arxiv.org/pdf/2509.15803v1",
      "arxiv_url": "http://arxiv.org/abs/2509.15803v1",
      "published": "2025-09-19",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Deep learning based doubly robust test for Granger causality",
      "authors": [
        "Yongchang Hui",
        "Chijin Liu",
        "Xiaojun Song"
      ],
      "abstract": "Granger causality is popular for analyzing time series data in many\napplications from natural science to social science including genomics,\nneuroscience, economics, and finance. Consequently, the Granger causality test\nhas become one of the main concerns of the econometrician for decades. Taking\nadvantage of the theoretical breakthroughs in deep learning in recent years, we\npropose a doubly robust Granger causality test (DRGCT). Our method offers\nseveral key advantages. The first and most direct benefit is for the users,\nDRGCT allows them to handle large lag orders while alleviating the curse of\ndimensionality that traditional nonlinear Granger causality tests usually face.\nSecond, introducing a doubly robust test statistic for time series based on\nneural networks that achieves a parametric convergence rate not only suggests a\nnew paradigm for nonparametric inference in econometrics, but also broadens the\napplication scope of deep learning. Third, a multiplier bootstrap method,\ncombined with the doubly robust approach, provides an efficient way to obtain\ncritical values, effectively reducing computational time and avoiding redundant\ncalculations. We prove that the test asymptotically controls the type I error,\nwhile achieving power approaches one, and validate the effectiveness of our\ntest through numerical simulations. In real data analysis, we apply DRGCT to\nrevisit the price-volume relationship problem in the stock markets of America,\nChina, and Japan.",
      "pdf_url": "http://arxiv.org/pdf/2509.15798v1",
      "arxiv_url": "http://arxiv.org/abs/2509.15798v1",
      "published": "2025-09-19",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "RMT-KD: Random Matrix Theoretic Causal Knowledge Distillation",
      "authors": [
        "Davide Ettori",
        "Nastaran Darabi",
        "Sureshkumar Senthilkumar",
        "Amit Ranjan Trivedi"
      ],
      "abstract": "Large deep learning models such as BERT and ResNet achieve state-of-the-art\nperformance but are costly to deploy at the edge due to their size and compute\ndemands. We present RMT-KD, a compression method that leverages Random Matrix\nTheory (RMT) for knowledge distillation to iteratively reduce network size.\nInstead of pruning or heuristic rank selection, RMT-KD preserves only\ninformative directions identified via the spectral properties of hidden\nrepresentations. RMT-based causal reduction is applied layer by layer with\nself-distillation to maintain stability and accuracy. On GLUE, AG News, and\nCIFAR-10, RMT-KD achieves up to 80% parameter reduction with only 2% accuracy\nloss, delivering 2.8x faster inference and nearly halved power consumption.\nThese results establish RMT-KD as a mathematically grounded approach to network\ndistillation.",
      "pdf_url": "http://arxiv.org/pdf/2509.15724v1",
      "arxiv_url": "http://arxiv.org/abs/2509.15724v1",
      "published": "2025-09-19",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "Beyond the Average: Distributional Causal Inference under Imperfect Compliance",
      "authors": [
        "Undral Byambadalai",
        "Tomu Hirata",
        "Tatsushi Oka",
        "Shota Yasui"
      ],
      "abstract": "We study the estimation of distributional treatment effects in randomized\nexperiments with imperfect compliance. When participants do not adhere to their\nassigned treatments, we leverage treatment assignment as an instrumental\nvariable to identify the local distributional treatment effect-the difference\nin outcome distributions between treatment and control groups for the\nsubpopulation of compliers. We propose a regression-adjusted estimator based on\na distribution regression framework with Neyman-orthogonal moment conditions,\nenabling robustness and flexibility with high-dimensional covariates. Our\napproach accommodates continuous, discrete, and mixed discrete-continuous\noutcomes, and applies under a broad class of covariate-adaptive randomization\nschemes, including stratified block designs and simple random sampling. We\nderive the estimator's asymptotic distribution and show that it achieves the\nsemiparametric efficiency bound. Simulation results demonstrate favorable\nfinite-sample performance, and we demonstrate the method's practical relevance\nin an application to the Oregon Health Insurance Experiment.",
      "pdf_url": "http://arxiv.org/pdf/2509.15594v1",
      "arxiv_url": "http://arxiv.org/abs/2509.15594v1",
      "published": "2025-09-19",
      "categories": [
        "stat.ME",
        "econ.EM",
        "math.ST",
        "stat.AP",
        "stat.ML",
        "stat.TH"
      ]
    },
    {
      "title": "SAMPO:Scale-wise Autoregression with Motion PrOmpt for generative world models",
      "authors": [
        "Sen Wang",
        "Jingyi Tian",
        "Le Wang",
        "Zhimin Liao",
        "Jiayi Li",
        "Huaiyi Dong",
        "Kun Xia",
        "Sanping Zhou",
        "Wei Tang",
        "Hua Gang"
      ],
      "abstract": "World models allow agents to simulate the consequences of actions in imagined\nenvironments for planning, control, and long-horizon decision-making. However,\nexisting autoregressive world models struggle with visually coherent\npredictions due to disrupted spatial structure, inefficient decoding, and\ninadequate motion modeling. In response, we propose \\textbf{S}cale-wise\n\\textbf{A}utoregression with \\textbf{M}otion \\textbf{P}r\\textbf{O}mpt\n(\\textbf{SAMPO}), a hybrid framework that combines visual autoregressive\nmodeling for intra-frame generation with causal modeling for next-frame\ngeneration. Specifically, SAMPO integrates temporal causal decoding with\nbidirectional spatial attention, which preserves spatial locality and supports\nparallel decoding within each scale. This design significantly enhances both\ntemporal consistency and rollout efficiency. To further improve dynamic scene\nunderstanding, we devise an asymmetric multi-scale tokenizer that preserves\nspatial details in observed frames and extracts compact dynamic representations\nfor future frames, optimizing both memory usage and model performance.\nAdditionally, we introduce a trajectory-aware motion prompt module that injects\nspatiotemporal cues about object and robot trajectories, focusing attention on\ndynamic regions and improving temporal consistency and physical realism.\nExtensive experiments show that SAMPO achieves competitive performance in\naction-conditioned video prediction and model-based control, improving\ngeneration quality with 4.4$\\times$ faster inference. We also evaluate SAMPO's\nzero-shot generalization and scaling behavior, demonstrating its ability to\ngeneralize to unseen tasks and benefit from larger model sizes.",
      "pdf_url": "http://arxiv.org/pdf/2509.15536v1",
      "arxiv_url": "http://arxiv.org/abs/2509.15536v1",
      "published": "2025-09-19",
      "categories": [
        "cs.CV",
        "cs.RO"
      ]
    },
    {
      "title": "Beyond Spurious Signals: Debiasing Multimodal Large Language Models via Counterfactual Inference and Adaptive Expert Routing",
      "authors": [
        "Zichen Wu",
        "Hsiu-Yuan Huang",
        "Yunfang Wu"
      ],
      "abstract": "Multimodal Large Language Models (MLLMs) have shown substantial capabilities\nin integrating visual and textual information, yet frequently rely on spurious\ncorrelations, undermining their robustness and generalization in complex\nmultimodal reasoning tasks. This paper addresses the critical challenge of\nsuperficial correlation bias in MLLMs through a novel causal mediation-based\ndebiasing framework. Specially, we distinguishing core semantics from spurious\ntextual and visual contexts via counterfactual examples to activate\ntraining-stage debiasing and employ a Mixture-of-Experts (MoE) architecture\nwith dynamic routing to selectively engages modality-specific debiasing\nexperts. Empirical evaluation on multimodal sarcasm detection and sentiment\nanalysis tasks demonstrates that our framework significantly surpasses unimodal\ndebiasing strategies and existing state-of-the-art models.",
      "pdf_url": "http://arxiv.org/pdf/2509.15361v1",
      "arxiv_url": "http://arxiv.org/abs/2509.15361v1",
      "published": "2025-09-18",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.MM"
      ]
    },
    {
      "title": "Randomization inference for stepped-wedge designs with noncompliance with application to a palliative care pragmatic trial",
      "authors": [
        "Jeffrey Zhang",
        "Zhe Chen",
        "Katherine R. Courtright",
        "Scott D. Halpern",
        "Michael O. Harhay",
        "Dylan S. Small",
        "Fan Li"
      ],
      "abstract": "While palliative care is increasingly commonly delivered to hospitalized\npatients with serious illnesses, few studies have estimated its causal effects.\nCourtright et al. (2016) adopted a cluster-randomized stepped-wedge design to\nassess the effect of palliative care on a patient-centered outcome. The\nrandomized intervention was a nudge to administer palliative care but did not\nguarantee receipt of palliative care, resulting in noncompliance (compliance\nrate ~30%). A subsequent analysis using methods suited for standard trial\ndesigns produced statistically anomalous results, as an intention-to-treat\nanalysis found no effect while an instrumental variable analysis did\n(Courtright et al., 2024). This highlights the need for a more principled\napproach to address noncompliance in stepped-wedge designs. We provide a formal\ncausal inference framework for the stepped-wedge design with noncompliance by\nintroducing a relevant causal estimand and corresponding estimators and\ninferential procedures. Through simulation, we compare an array of estimators\nacross a range of stepped-wedge designs and provide practical guidance in\nchoosing an analysis method. Finally, we apply our recommended methods to\nreanalyze the trial of Courtright et al. (2016), producing point estimates\nsuggesting a larger effect than the original analysis of (Courtright et al.,\n2024), but intervals that did not reach statistical significance.",
      "pdf_url": "http://arxiv.org/pdf/2509.14598v1",
      "arxiv_url": "http://arxiv.org/abs/2509.14598v1",
      "published": "2025-09-18",
      "categories": [
        "stat.ME",
        "stat.AP"
      ]
    },
    {
      "title": "Modeling User Redemption Behavior in Complex Incentive Digital Environment: An Empirical Study Using Large-Scale Transactional Data",
      "authors": [
        "Akira Matsui",
        "Takashi Teramoto",
        "Eiji Motohashi",
        "Hiroyuki Tsurumi"
      ],
      "abstract": "The digital economy implements complex incentive systems to retain users\nthrough point redemption. Understanding user behavior in such complex incentive\nstructures presents a fundamental challenge, especially in estimating the value\nof these digital assets against traditional money. This study tackles this\nquestion by analyzing large-scale, real-world transaction data from a popular\npersonal finance application that captures both monetary spending and\npoint-based transactions across Japan's deeply integrated loyalty networks. We\nfind that point usage is not random but is systematically linked to\ndemographics, with older users tending to convert points into financial assets.\nFurthermore, our analysis using a natural experiment and a causal inference\ntechnique reveals that a large point grant stimulated an increase in point\nspending without affecting cash expenditure. We also find that consumers'\nshopping styles are associated with their point redemption patterns. This\nstudy, conducted within a massive real-world economic ecosystem, examines how\nconsumers navigate multi-currency environments, with direct implications for\nmodeling economic behavior and designing digital platforms.",
      "pdf_url": "http://arxiv.org/pdf/2509.14508v1",
      "arxiv_url": "http://arxiv.org/abs/2509.14508v1",
      "published": "2025-09-18",
      "categories": [
        "cs.CY"
      ]
    }
  ]
}