{
  "last_updated": "2025-03-13T00:48:45.224847",
  "papers": [
    {
      "title": "\"Principal Components\" Enable A New Language of Images",
      "authors": [
        "Xin Wen",
        "Bingchen Zhao",
        "Ismail Elezi",
        "Jiankang Deng",
        "Xiaojuan Qi"
      ],
      "abstract": "We introduce a novel visual tokenization framework that embeds a provable\nPCA-like structure into the latent token space. While existing visual\ntokenizers primarily optimize for reconstruction fidelity, they often neglect\nthe structural properties of the latent space -- a critical factor for both\ninterpretability and downstream tasks. Our method generates a 1D causal token\nsequence for images, where each successive token contributes non-overlapping\ninformation with mathematically guaranteed decreasing explained variance,\nanalogous to principal component analysis. This structural constraint ensures\nthe tokenizer extracts the most salient visual features first, with each\nsubsequent token adding diminishing yet complementary information.\nAdditionally, we identified and resolved a semantic-spectrum coupling effect\nthat causes the unwanted entanglement of high-level semantic content and\nlow-level spectral details in the tokens by leveraging a diffusion decoder.\nExperiments demonstrate that our approach achieves state-of-the-art\nreconstruction performance and enables better interpretability to align with\nthe human vision system. Moreover, auto-regressive models trained on our token\nsequences achieve performance comparable to current state-of-the-art methods\nwhile requiring fewer tokens for training and inference.",
      "pdf_url": "http://arxiv.org/pdf/2503.08685v1",
      "arxiv_url": "http://arxiv.org/abs/2503.08685v1",
      "published": "2025-03-11",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "Perplexity Trap: PLM-Based Retrievers Overrate Low Perplexity Documents",
      "authors": [
        "Haoyu Wang",
        "Sunhao Dai",
        "Haiyuan Zhao",
        "Liang Pang",
        "Xiao Zhang",
        "Gang Wang",
        "Zhenhua Dong",
        "Jun Xu",
        "Ji-Rong Wen"
      ],
      "abstract": "Previous studies have found that PLM-based retrieval models exhibit a\npreference for LLM-generated content, assigning higher relevance scores to\nthese documents even when their semantic quality is comparable to human-written\nones. This phenomenon, known as source bias, threatens the sustainable\ndevelopment of the information access ecosystem. However, the underlying causes\nof source bias remain unexplored. In this paper, we explain the process of\ninformation retrieval with a causal graph and discover that PLM-based\nretrievers learn perplexity features for relevance estimation, causing source\nbias by ranking the documents with low perplexity higher. Theoretical analysis\nfurther reveals that the phenomenon stems from the positive correlation between\nthe gradients of the loss functions in language modeling task and retrieval\ntask. Based on the analysis, a causal-inspired inference-time debiasing method\nis proposed, called Causal Diagnosis and Correction (CDC). CDC first diagnoses\nthe bias effect of the perplexity and then separates the bias effect from the\noverall estimated relevance score. Experimental results across three domains\ndemonstrate the superior debiasing effectiveness of CDC, emphasizing the\nvalidity of our proposed explanatory framework. Source codes are available at\nhttps://github.com/WhyDwelledOnAi/Perplexity-Trap.",
      "pdf_url": "http://arxiv.org/pdf/2503.08684v1",
      "arxiv_url": "http://arxiv.org/abs/2503.08684v1",
      "published": "2025-03-11",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.IR"
      ]
    },
    {
      "title": "Causal Networks of Infodemiological Data: Modelling Dermatitis",
      "authors": [
        "Marco Scutari",
        "Samir Salah",
        "Delphine Kerob",
        "Jean Krutmann"
      ],
      "abstract": "Environmental and mental conditions are known risk factors for dermatitis and\nsymptoms of skin inflammation, but their interplay is difficult to quantify;\nepidemiological studies rarely include both, along with possible confounding\nfactors. Infodemiology leverages large online data sets to address this issue,\nbut fusing them produces strong patterns of spatial and temporal correlation,\nmissingness, and heterogeneity.\n  In this paper, we design a causal network that correctly models these complex\nstructures in large-scale infodemiological data from Google, EPA, NOAA and US\nCensus (434 US counties, 134 weeks). Our model successfully captures known\ncausal relationships between weather patterns, pollutants, mental conditions,\nand dermatitis. Key findings reveal that anxiety accounts for 57.4% of\nexplained variance in dermatitis, followed by NO2 (33.9%), while environmental\nfactors show significant mediation effects through mental conditions. The model\npredicts that reducing PM2.5 emissions by 25% could decrease dermatitis\nprevalence by 18%. Through statistical validation and causal inference, we\nprovide unprecedented insights into the complex interplay between environmental\nand mental health factors affecting dermatitis, offering valuable guidance for\npublic health policies and environmental regulations.",
      "pdf_url": "http://arxiv.org/pdf/2503.08252v1",
      "arxiv_url": "http://arxiv.org/abs/2503.08252v1",
      "published": "2025-03-11",
      "categories": [
        "stat.ME",
        "stat.AP"
      ]
    },
    {
      "title": "A primer on optimal transport for causal inference with observational data",
      "authors": [
        "Florian F Gunsilius"
      ],
      "abstract": "The theory of optimal transportation has developed into a powerful and\nelegant framework for comparing probability distributions, with wide-ranging\napplications in all areas of science. The fundamental idea of analyzing\nprobabilities by comparing their underlying state space naturally aligns with\nthe core idea of causal inference, where understanding and quantifying\ncounterfactual states is paramount. Despite this intuitive connection, explicit\nresearch at the intersection of optimal transport and causal inference is only\nbeginning to develop. Yet, many foundational models in causal inference have\nimplicitly relied on optimal transport principles for decades, without\nrecognizing the underlying connection. Therefore, the goal of this review is to\noffer an introduction to the surprisingly deep existing connections between\noptimal transport and the identification of causal effects with observational\ndata -- where optimal transport is not just a set of potential tools, but\nactually builds the foundation of model assumptions. As a result, this review\nis intended to unify the language and notation between different areas of\nstatistics, mathematics, and econometrics, by pointing out these existing\nconnections, and to explore novel problems and directions for future work in\nboth areas derived from this realization.",
      "pdf_url": "http://arxiv.org/pdf/2503.07811v1",
      "arxiv_url": "http://arxiv.org/abs/2503.07811v1",
      "published": "2025-03-10",
      "categories": [
        "stat.ME",
        "cs.AI",
        "econ.EM"
      ]
    },
    {
      "title": "AR-Diffusion: Asynchronous Video Generation with Auto-Regressive Diffusion",
      "authors": [
        "Mingzhen Sun",
        "Weining Wang",
        "Gen Li",
        "Jiawei Liu",
        "Jiahui Sun",
        "Wanquan Feng",
        "Shanshan Lao",
        "SiYu Zhou",
        "Qian He",
        "Jing Liu"
      ],
      "abstract": "The task of video generation requires synthesizing visually realistic and\ntemporally coherent video frames. Existing methods primarily use asynchronous\nauto-regressive models or synchronous diffusion models to address this\nchallenge. However, asynchronous auto-regressive models often suffer from\ninconsistencies between training and inference, leading to issues such as error\naccumulation, while synchronous diffusion models are limited by their reliance\non rigid sequence length. To address these issues, we introduce Auto-Regressive\nDiffusion (AR-Diffusion), a novel model that combines the strengths of\nauto-regressive and diffusion models for flexible, asynchronous video\ngeneration. Specifically, our approach leverages diffusion to gradually corrupt\nvideo frames in both training and inference, reducing the discrepancy between\nthese phases. Inspired by auto-regressive generation, we incorporate a\nnon-decreasing constraint on the corruption timesteps of individual frames,\nensuring that earlier frames remain clearer than subsequent ones. This setup,\ntogether with temporal causal attention, enables flexible generation of videos\nwith varying lengths while preserving temporal coherence. In addition, we\ndesign two specialized timestep schedulers: the FoPP scheduler for balanced\ntimestep sampling during training, and the AD scheduler for flexible timestep\ndifferences during inference, supporting both synchronous and asynchronous\ngeneration. Extensive experiments demonstrate the superiority of our proposed\nmethod, which achieves competitive and state-of-the-art results across four\nchallenging benchmarks.",
      "pdf_url": "http://arxiv.org/pdf/2503.07418v1",
      "arxiv_url": "http://arxiv.org/abs/2503.07418v1",
      "published": "2025-03-10",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "NFIG: Autoregressive Image Generation with Next-Frequency Prediction",
      "authors": [
        "Zhihao Huang",
        "Xi Qiu",
        "Yukuo Ma",
        "Yifu Zhou",
        "Chi Zhang",
        "Xuelong Li"
      ],
      "abstract": "Autoregressive models have achieved promising results in natural language\nprocessing. However, for image generation tasks, they encounter substantial\nchallenges in effectively capturing long-range dependencies, managing\ncomputational costs, and most crucially, defining meaningful autoregressive\nsequences that reflect natural image hierarchies. To address these issues, we\npresent \\textbf{N}ext-\\textbf{F}requency \\textbf{I}mage \\textbf{G}eneration\n(\\textbf{NFIG}), a novel framework that decomposes the image generation process\ninto multiple frequency-guided stages. Our approach first generates\nlow-frequency components to establish global structure with fewer tokens, then\nprogressively adds higher-frequency details, following the natural spectral\nhierarchy of images. This principled autoregressive sequence not only improves\nthe quality of generated images by better capturing true causal relationships\nbetween image components, but also significantly reduces computational overhead\nduring inference. Extensive experiments demonstrate that NFIG achieves\nstate-of-the-art performance with fewer steps, offering a more efficient\nsolution for image generation, with 1.25$\\times$ speedup compared to VAR-d20\nwhile achieving better performance (FID: 2.81) on the ImageNet-256 benchmark.\nWe hope that our insight of incorporating frequency-domain knowledge to guide\nautoregressive sequence design will shed light on future research. We will make\nour code publicly available upon acceptance of the paper.",
      "pdf_url": "http://arxiv.org/pdf/2503.07076v1",
      "arxiv_url": "http://arxiv.org/abs/2503.07076v1",
      "published": "2025-03-10",
      "categories": [
        "cs.CV",
        "cs.AI",
        "68T07",
        "I.2.10; I.2.6"
      ]
    },
    {
      "title": "AXAI-CDSS : An Affective Explainable AI-Driven Clinical Decision Support System for Cannabis Use",
      "authors": [
        "Tongze Zhang",
        "Tammy Chung",
        "Anind Dey",
        "Sang Won Bae"
      ],
      "abstract": "As cannabis use has increased in recent years, researchers have come to rely\non sophisticated machine learning models to predict cannabis use behavior and\nits impact on health. However, many artificial intelligence (AI) models lack\ntransparency and interpretability due to their opaque nature, limiting their\ntrust and adoption in real-world medical applications, such as clinical\ndecision support systems (CDSS). To address this issue, this paper enhances\nalgorithm explainability underlying CDSS by integrating multiple Explainable\nArtificial Intelligence (XAI) methods and applying causal inference techniques\nto clarify the model' predictive decisions under various scenarios. By\nproviding deeper interpretability of the XAI outputs using Large Language\nModels (LLMs), we provide users with more personalized and accessible insights\nto overcome the challenges posed by AI's \"black box\" nature. Our system\ndynamically adjusts feedback based on user queries and emotional states,\ncombining text-based sentiment analysis with real-time facial emotion\nrecognition to ensure responses are empathetic, context-adaptive, and\nuser-centered. This approach bridges the gap between the learning demands of\ninterpretability and the need for intuitive understanding, enabling\nnon-technical users such as clinicians and clinical researchers to interact\neffectively with AI models.} Ultimately, this approach improves usability,\nenhances perceived trustworthiness, and increases the impact of CDSS in\nhealthcare applications.",
      "pdf_url": "http://arxiv.org/pdf/2503.06463v1",
      "arxiv_url": "http://arxiv.org/abs/2503.06463v1",
      "published": "2025-03-09",
      "categories": [
        "cs.HC"
      ]
    },
    {
      "title": "Causal Discovery and Inference towards Urban Elements and Associated Factors",
      "authors": [
        "Tao Feng",
        "Yunke Zhang",
        "Xiaochen Fan",
        "Huandong Wang",
        "Yong Li"
      ],
      "abstract": "To uncover the city's fundamental functioning mechanisms, it is important to\nacquire a deep understanding of complicated relationships among citizens,\nlocation, and mobility behaviors. Previous research studies have applied direct\ncorrelation analysis to investigate such relationships. Nevertheless, due to\nthe ubiquitous confounding effects, empirical correlation analysis may not\naccurately reflect underlying causal relationships among basic urban elements.\nIn this paper, we propose a novel urban causal computing framework to\ncomprehensively explore causalities and confounding effects among a variety of\nfactors across different types of urban elements. In particular, we design a\nreinforcement learning algorithm to discover the potential causal graph, which\ndepicts the causal relations between urban factors. The causal graph further\nserves as the guidance for estimating causal effects between pair-wise urban\nfactors by propensity score matching. After removing the confounding effects\nfrom correlations, we leverage significance levels of causal effects in\ndownstream urban mobility prediction tasks. Experimental studies on open-source\nurban datasets show that the discovered causal graph demonstrates a\nhierarchical structure, where citizens affect locations, and they both cause\nchanges in urban mobility behaviors. Experimental results in urban mobility\nprediction tasks further show that the proposed method can effectively reduce\nconfounding effects and enhance performance of urban computing tasks.",
      "pdf_url": "http://arxiv.org/pdf/2503.06395v1",
      "arxiv_url": "http://arxiv.org/abs/2503.06395v1",
      "published": "2025-03-09",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Antibiotic Resistance Microbiology Dataset (ARMD): A De-identified Resource for Studying Antimicrobial Resistance Using Electronic Health Records",
      "authors": [
        "Fateme Nateghi Haredasht",
        "Fatemeh Amrollahi",
        "Manoj Maddali",
        "Nicholas Marshall",
        "Stephen P. Ma",
        "Lauren N. Cooper",
        "Richard J. Medford",
        "Sanjat Kanjilal",
        "Niaz Banaei",
        "Stanley Deresinski",
        "Mary K. Goldstein",
        "Steven M. Asch",
        "Amy Chang",
        "Jonathan H. Chen"
      ],
      "abstract": "The Antibiotic Resistance Microbiology Dataset (ARMD) is a de-identified\nresource derived from electronic health records (EHR) that facilitates research\ninto antimicrobial resistance (AMR). ARMD encompasses data from adult patients,\nfocusing on microbiological cultures, antibiotic susceptibilities, and\nassociated clinical and demographic features. Key attributes include organism\nidentification, susceptibility patterns for 55 antibiotics, implied\nsusceptibility rules, and de-identified patient information. This dataset\nsupports studies on antimicrobial stewardship, causal inference, and clinical\ndecision-making. ARMD is designed to be reusable and interoperable, promoting\ncollaboration and innovation in combating AMR. This paper describes the\ndataset's acquisition, structure, and utility while detailing its\nde-identification process.",
      "pdf_url": "http://arxiv.org/pdf/2503.07664v1",
      "arxiv_url": "http://arxiv.org/abs/2503.07664v1",
      "published": "2025-03-08",
      "categories": [
        "q-bio.QM",
        "cs.IR",
        "cs.LG",
        "stat.AP"
      ]
    },
    {
      "title": "Integrating Chain-of-Thought for Multimodal Alignment: A Study on 3D Vision-Language Learning",
      "authors": [
        "Yanjun Chen",
        "Yirong Sun",
        "Xinghao Chen",
        "Jian Wang",
        "Xiaoyu Shen",
        "Wenjie Li",
        "Wei Zhang"
      ],
      "abstract": "Chain-of-Thought (CoT) reasoning has proven effective in natural language\ntasks but remains underexplored in multimodal alignment. This study\ninvestigates its integration into 3D vision-language learning by embedding\nstructured reasoning into alignment training. We introduce the 3D-CoT\nBenchmark, a dataset with hierarchical CoT annotations covering shape\nrecognition, functional inference, and causal reasoning. Through controlled\nexperiments, we compare CoT-structured and standard textual annotations across\nlarge reasoning models (LRMs) and large language models (LLMs). Our evaluation\nemploys a dual-layer framework assessing both intermediate reasoning and final\ninference quality. Extensive experiments demonstrate that CoT significantly\nimproves 3D semantic grounding, with LRMs leveraging CoT more effectively than\nLLMs. Furthermore, we highlight that annotation structure influences\nperformance-explicit reasoning markers aid LLMs, while unmarked CoT better\naligns with LRM inference patterns. Our analyses suggest that CoT is crucial\nfor enhancing multimodal reasoning, with implications beyond 3D tasks.",
      "pdf_url": "http://arxiv.org/pdf/2503.06232v1",
      "arxiv_url": "http://arxiv.org/abs/2503.06232v1",
      "published": "2025-03-08",
      "categories": [
        "cs.CL",
        "cs.CV"
      ]
    }
  ]
}