{
  "last_updated": "2025-03-18T00:48:32.955736",
  "papers": [
    {
      "title": "Vamba: Understanding Hour-Long Videos with Hybrid Mamba-Transformers",
      "authors": [
        "Weiming Ren",
        "Wentao Ma",
        "Huan Yang",
        "Cong Wei",
        "Ge Zhang",
        "Wenhu Chen"
      ],
      "abstract": "State-of-the-art transformer-based large multimodal models (LMMs) struggle to\nhandle hour-long video inputs due to the quadratic complexity of the causal\nself-attention operations, leading to high computational costs during training\nand inference. Existing token compression-based methods reduce the number of\nvideo tokens but often incur information loss and remain inefficient for\nextremely long sequences. In this paper, we explore an orthogonal direction to\nbuild a hybrid Mamba-Transformer model (VAMBA) that employs Mamba-2 blocks to\nencode video tokens with linear complexity. Without any token reduction, VAMBA\ncan encode more than 1024 frames (640$\\times$360) on a single GPU, while\ntransformer-based models can only encode 256 frames. On long video input, VAMBA\nachieves at least 50% reduction in GPU memory usage during training and\ninference, and nearly doubles the speed per training step compared to\ntransformer-based LMMs. Our experimental results demonstrate that VAMBA\nimproves accuracy by 4.3% on the challenging hour-long video understanding\nbenchmark LVBench over prior efficient video LMMs, and maintains strong\nperformance on a broad spectrum of long and short video understanding tasks.",
      "pdf_url": "http://arxiv.org/pdf/2503.11579v1",
      "arxiv_url": "http://arxiv.org/abs/2503.11579v1",
      "published": "2025-03-14",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "Difference-in-Differences Meets Synthetic Control: Doubly Robust Identification and Estimation",
      "authors": [
        "Yixiao Sun",
        "Haitian Xie",
        "Yuhang Zhang"
      ],
      "abstract": "Difference-in-Differences (DiD) and Synthetic Control (SC) are widely used\nmethods for causal inference in panel data, each with its own strengths and\nlimitations. In this paper, we propose a novel methodology that integrates the\nadvantages of both DiD and SC approaches. Our integrated approach provides a\ndoubly robust identification strategy for causal effects in panel data with a\ngroup structure, identifying the average treatment effect on the treated (ATT)\nunder either the parallel trends assumption or the group-level SC assumption.\nBuilding on this identification result, we develop a unified semiparametric\nframework for estimating the ATT. Notably, while the identification-robust\nmoment function satisfies Neyman orthogonality under the parallel trends\nassumption, it does not under the SC assumption, leading to different\nasymptotic variances under these two identification strategies. To address this\nchallenge, we propose a multiplier bootstrap method that consistently\napproximates the asymptotic distribution, regardless of which identification\nassumption holds. Furthermore, we extend our methodology to accommodate\nrepeated cross-sectional data and staggered treatment designs. As an empirical\napplication, we apply our method to evaluate the impact of the 2003 minimum\nwage increase in Alaska on family income.",
      "pdf_url": "http://arxiv.org/pdf/2503.11375v1",
      "arxiv_url": "http://arxiv.org/abs/2503.11375v1",
      "published": "2025-03-14",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "Autoregressive Image Generation with Randomized Parallel Decoding",
      "authors": [
        "Haopeng Li",
        "Jinyue Yang",
        "Guoqi Li",
        "Huan Wang"
      ],
      "abstract": "We introduce ARPG, a novel visual autoregressive model that enables\nrandomized parallel generation, addressing the inherent limitations of\nconventional raster-order approaches, which hinder inference efficiency and\nzero-shot generalization due to their sequential, predefined token generation\norder. Our key insight is that effective random-order modeling necessitates\nexplicit guidance for determining the position of the next predicted token. To\nthis end, we propose a novel guided decoding framework that decouples\npositional guidance from content representation, encoding them separately as\nqueries and key-value pairs. By directly incorporating this guidance into the\ncausal attention mechanism, our approach enables fully random-order training\nand generation, eliminating the need for bidirectional attention. Consequently,\nARPG readily generalizes to zero-shot tasks such as image inpainting,\noutpainting, and resolution expansion. Furthermore, it supports parallel\ninference by concurrently processing multiple queries using a shared KV cache.\nOn the ImageNet-1K 256 benchmark, our approach attains an FID of 1.94 with only\n64 sampling steps, achieving over a 20-fold increase in throughput while\nreducing memory consumption by over 75% compared to representative recent\nautoregressive models at a similar scale.",
      "pdf_url": "http://arxiv.org/pdf/2503.10568v1",
      "arxiv_url": "http://arxiv.org/abs/2503.10568v1",
      "published": "2025-03-13",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "SCOOP: A Framework for Proactive Collaboration and Social Continual Learning through Natural Language Interaction andCausal Reasoning",
      "authors": [
        "Dimitri Ognibene",
        "Sabrina Patania",
        "Luca Annese",
        "Cansu Koyuturk",
        "Franca Garzotto",
        "Giuseppe Vizzari",
        "Azzurra Ruggeri",
        "Simone Colombani"
      ],
      "abstract": "Multimodal information-gathering settings, where users collaborate with AI in\ndynamic environments, are increasingly common. These involve complex processes\nwith textual and multimodal interactions, often requiring additional structural\ninformation via cost-incurring requests. AI helpers lack access to users' true\ngoals, beliefs, and preferences and struggle to integrate diverse information\neffectively.\n  We propose a social continual learning framework for causal knowledge\nacquisition and collaborative decision-making. It focuses on autonomous agents\nlearning through dialogues, question-asking, and interaction in open, partially\nobservable environments. A key component is a natural language oracle that\nanswers the agent's queries about environmental mechanisms and states, refining\ncausal understanding while balancing exploration or learning, and exploitation\nor knowledge use.\n  Evaluation tasks inspired by developmental psychology emphasize causal\nreasoning and question-asking skills. They complement benchmarks by assessing\nthe agent's ability to identify knowledge gaps, generate meaningful queries,\nand incrementally update reasoning. The framework also evaluates how knowledge\nacquisition costs are amortized across tasks within the same environment.\n  We propose two architectures: 1) a system combining Large Language Models\n(LLMs) with the ReAct framework and question-generation, and 2) an advanced\nsystem with a causal world model, symbolic, graph-based, or subsymbolic, for\nreasoning and decision-making. The latter builds a causal knowledge graph for\nefficient inference and adaptability under constraints. Challenges include\nintegrating causal reasoning into ReAct and optimizing exploration and\nquestion-asking in error-prone scenarios. Beyond applications, this framework\nmodels developmental processes combining causal reasoning, question generation,\nand social learning.",
      "pdf_url": "http://arxiv.org/pdf/2503.10241v1",
      "arxiv_url": "http://arxiv.org/abs/2503.10241v1",
      "published": "2025-03-13",
      "categories": [
        "cs.MA",
        "cs.HC",
        "cs.RO"
      ]
    },
    {
      "title": "Using Causal Inference to Explore Government Policy Impact on Computer Usage",
      "authors": [
        "Mingjia Zhu",
        "Lechuan Wang",
        "Julien Sebot",
        "Bijan Arbab",
        "Babak Salimi",
        "Alexander Cloninger"
      ],
      "abstract": "We explore the causal relationship between COVID-19 lockdown policies and\nchanges in personal computer usage. In particular, we examine how lockdown\npolicies affected average daily computer usage, as well as how it affected\nusage patterns of different groups of users. This is done through a merging of\nthe Oxford Policy public data set, which describes the timeline of\nimplementation of COVID policies across the world, and a collection of Intel's\nData Collection and Analytics (DCA) telemetry data, which includes millions of\ncomputer usage records and updates daily. Through difference-in-difference,\nsynthetic control, and change-point detection algorithms, we identify causal\nlinks between the increase in intensity (watts) and time (hours) of computer\nusage and the implementation of work from home policy. We also show an\ninteresting trend in the individual's computer usage affected by the policy. We\nalso conclude that computer usage behaviors are much less predictable during\nreduction in COVID lockdown policies than during increases in COVID lockdown\npolicies.",
      "pdf_url": "http://arxiv.org/pdf/2503.09957v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09957v1",
      "published": "2025-03-13",
      "categories": [
        "stat.AP",
        "cs.CY"
      ]
    },
    {
      "title": "Towards Causal Model-Based Policy Optimization",
      "authors": [
        "Alberto Caron",
        "Vasilios Mavroudis",
        "Chris Hicks"
      ],
      "abstract": "Real-world decision-making problems are often marked by complex, uncertain\ndynamics that can shift or break under changing conditions. Traditional\nModel-Based Reinforcement Learning (MBRL) approaches learn predictive models of\nenvironment dynamics from queried trajectories and then use these models to\nsimulate rollouts for policy optimization. However, such methods do not account\nfor the underlying causal mechanisms that govern the environment, and thus\ninadvertently capture spurious correlations, making them sensitive to\ndistributional shifts and limiting their ability to generalize. The same\nnaturally holds for model-free approaches. In this work, we introduce Causal\nModel-Based Policy Optimization (C-MBPO), a novel framework that integrates\ncausal learning into the MBRL pipeline to achieve more robust, explainable, and\ngeneralizable policy learning algorithms.\n  Our approach centers on first inferring a Causal Markov Decision Process\n(C-MDP) by learning a local Structural Causal Model (SCM) of both the state and\nreward transition dynamics from trajectories gathered online. C-MDPs differ\nfrom classic MDPs in that we can decompose causal dependencies in the\nenvironment dynamics via specifying an associated Causal Bayesian Network.\nC-MDPs allow for targeted interventions and counterfactual reasoning, enabling\nthe agent to distinguish between mere statistical correlations and causal\nrelationships. The learned SCM is then used to simulate counterfactual\non-policy transitions and rewards under hypothetical actions (or\n``interventions\"), thereby guiding policy optimization more effectively. The\nresulting policy learned by C-MBPO can be shown to be robust to a class of\ndistributional shifts that affect spurious, non-causal relationships in the\ndynamics. We demonstrate this through some simple experiments involving near\nand far OOD dynamics drifts.",
      "pdf_url": "http://arxiv.org/pdf/2503.09719v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09719v1",
      "published": "2025-03-12",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "Addressing pitfalls in implicit unobserved confounding synthesis using explicit block hierarchical ancestral sampling",
      "authors": [
        "Xudong Sun",
        "Alex Markham",
        "Pratik Misra",
        "Carsten Marr"
      ],
      "abstract": "Unbiased data synthesis is crucial for evaluating causal discovery algorithms\nin the presence of unobserved confounding, given the scarcity of real-world\ndatasets. A common approach, implicit parameterization, encodes unobserved\nconfounding by modifying the off-diagonal entries of the idiosyncratic\ncovariance matrix while preserving positive definiteness. Within this approach,\nstate-of-the-art protocols have two distinct issues that hinder unbiased\nsampling from the complete space of causal models: first, the use of diagonally\ndominant constructions, which restrict the spectrum of partial correlation\nmatrices; and second, the restriction of possible graphical structures when\nsampling bidirected edges, unnecessarily ruling out valid causal models. To\naddress these limitations, we propose an improved explicit modeling approach\nfor unobserved confounding, leveraging block-hierarchical ancestral generation\nof ground truth causal graphs. Algorithms for converting the ground truth DAG\ninto ancestral graph is provided so that the output of causal discovery\nalgorithms could be compared with. We prove that our approach fully covers the\nspace of causal models, including those generated by the implicit\nparameterization, thus enabling more robust evaluation of methods for causal\ndiscovery and inference.",
      "pdf_url": "http://arxiv.org/pdf/2503.09194v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09194v1",
      "published": "2025-03-12",
      "categories": [
        "stat.ML",
        "cs.LG",
        "math.ST",
        "stat.TH"
      ]
    },
    {
      "title": "Drift-Aware Federated Learning: A Causal Perspective",
      "authors": [
        "Yunjie Fang",
        "Sheng Wu",
        "Tao Yang",
        "Xiaofeng Wu",
        "Bo Hu"
      ],
      "abstract": "Federated learning (FL) facilitates collaborative model training among\nmultiple clients while preserving data privacy, often resulting in enhanced\nperformance compared to models trained by individual clients. However, factors\nsuch as communication frequency and data distribution can contribute to feature\ndrift, hindering the attainment of optimal training performance. This paper\nexamine the relationship between model update drift and global as well as local\noptimizer from causal perspective. The influence of the global optimizer on\nfeature drift primarily arises from the participation frequency of certain\nclients in server updates, whereas the effect of the local optimizer is\ntypically associated with imbalanced data distributions.To mitigate this drift,\nwe propose a novel framework termed Causal drift-Aware Federated lEarning\n(CAFE). CAFE exploits the causal relationship between feature-invariant\ncomponents and classification outcomes to independently calibrate local client\nsample features and classifiers during the training phase. In the inference\nphase, it eliminated the drifts in the global model that favor frequently\ncommunicating clients.Experimental results demonstrate that CAFE's integration\nof feature calibration, parameter calibration, and historical information\neffectively reduces both drift towards majority classes and tendencies toward\nfrequently communicating nodes.",
      "pdf_url": "http://arxiv.org/pdf/2503.09116v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09116v1",
      "published": "2025-03-12",
      "categories": [
        "cs.LG",
        "cs.DC"
      ]
    },
    {
      "title": "Causal-Ex: Causal Graph-based Micro and Macro Expression Spotting",
      "authors": [
        "Pei-Sze Tan",
        "Sailaja Rajanala",
        "Arghya Pal",
        "Raphaël C. -W. Phan",
        "Huey-Fang Ong"
      ],
      "abstract": "Detecting concealed emotions within apparently normal expressions is crucial\nfor identifying potential mental health issues and facilitating timely support\nand intervention. The task of spotting macro and micro-expressions involves\npredicting the emotional timeline within a video, accomplished by identifying\nthe onset, apex, and offset frames of the displayed emotions. Utilizing\nfoundational facial muscle movement cues, known as facial action units, boosts\nthe accuracy. However, an overlooked challenge from previous research lies in\nthe inadvertent integration of biases into the training model. These biases\narising from datasets can spuriously link certain action unit movements to\nparticular emotion classes. We tackle this issue by novel replacement of action\nunit adjacency information with the action unit causal graphs. This approach\naims to identify and eliminate undesired spurious connections, retaining only\nunbiased information for classification. Our model, named Causal-Ex\n(Causal-based Expression spotting), employs a rapid causal inference algorithm\nto construct a causal graph of facial action units. This enables us to select\ncausally relevant facial action units. Our work demonstrates improvement in\noverall F1-scores compared to state-of-the-art approaches with 0.388 on\nCAS(ME)^2 and 0.3701 on SAMM-Long Video datasets.",
      "pdf_url": "http://arxiv.org/pdf/2503.09098v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09098v1",
      "published": "2025-03-12",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "StratIncon Detector: Analyzing Strategy Inconsistencies Between Real-Time Strategy and Preferred Professional Strategy in MOBA Esports",
      "authors": [
        "Ruofei Ma",
        "Yu Zhao",
        "Yuheng Shao",
        "Yunjie Yao",
        "Quan Li"
      ],
      "abstract": "MOBA (Multiplayer Online Battle Arena) games require a delicate interplay of\nstrategic planning and real-time decision-making, particularly in professional\nesports, where players exhibit varying levels of skill and strategic insight.\nWhile team strategies have been widely studied, analyzing inconsistencies in\nprofessional matches remains a significant challenge. The complexity lies in\ndefining and quantifying the difference between real-time and preferred\nprofessional strategies, as well as understanding the disparities between them.\nEstablishing direct causal links between specific strategic decisions and game\noutcomes also demands a comprehensive analysis of the entire match progression.\nTo tackle these challenges, we present the StratIncon Detector, a visual\nanalytics system designed to assist professional players and coaches in\nefficiently identifying strategic inconsistencies. The system detects real-time\nstrategies, predicts preferred professional strategies, extracts relevant human\nfactors, and uncovers their impact on subsequent game phases. Findings from a\ncase study, a user study with 24 participants, and expert interviews suggest\nthat, compared to traditional methods, the StratIncon Detector enables users to\nmore comprehensively and efficiently identify inconsistencies, infer their\ncauses, evaluate their effects on subsequent game outcomes, and gain deeper\ninsights into team collaboration-ultimately enhancing future teamwork.",
      "pdf_url": "http://arxiv.org/pdf/2503.09060v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09060v1",
      "published": "2025-03-12",
      "categories": [
        "cs.HC"
      ]
    }
  ]
}