{
  "last_updated": "2026-01-09T00:59:31.906375",
  "papers": [
    {
      "title": "Personalization of Large Foundation Models for Health Interventions",
      "authors": [
        "Stefan Konigorski",
        "Johannes E. Vedder",
        "Babajide Alamu Owoyele",
        "İbrahim Özkan"
      ],
      "abstract": "Large foundation models (LFMs) transform healthcare AI in prevention, diagnostics, and treatment. However, whether LFMs can provide truly personalized treatment recommendations remains an open question. Recent research has revealed multiple challenges for personalization, including the fundamental generalizability paradox: models achieving high accuracy in one clinical study perform at chance level in others, demonstrating that personalization and external validity exist in tension. This exemplifies broader contradictions in AI-driven healthcare: the privacy-performance paradox, scale-specificity paradox, and the automation-empathy paradox. As another challenge, the degree of causal understanding required for personalized recommendations, as opposed to mere predictive capacities of LFMs, remains an open question. N-of-1 trials -- crossover self-experiments and the gold standard for individual causal inference in personalized medicine -- resolve these tensions by providing within-person causal evidence while preserving privacy through local experimentation. Despite their impressive capabilities, this paper argues that LFMs cannot replace N-of-1 trials. We argue that LFMs and N-of-1 trials are complementary: LFMs excel at rapid hypothesis generation from population patterns using multimodal data, while N-of-1 trials excel at causal validation for a given individual. We propose a hybrid framework that combines the strengths of both to enable personalization and navigate the identified paradoxes: LFMs generate ranked intervention candidates with uncertainty estimates, which trigger subsequent N-of-1 trials. Clarifying the boundary between prediction and causation and explicitly addressing the paradoxical tensions are essential for responsible AI integration in personalized medicine.",
      "pdf_url": "https://arxiv.org/pdf/2601.03482v1",
      "arxiv_url": "http://arxiv.org/abs/2601.03482v1",
      "published": "2026-01-07",
      "categories": [
        "cs.AI",
        "cs.LG",
        "stat.AP"
      ]
    },
    {
      "title": "Improving operating characteristics of clinical trials by augmenting control arm using propensity score-weighted borrowing-by-parts power prior",
      "authors": [
        "Apu Chandra Das",
        "Sakib Salam",
        "Aninda Roy",
        "Rakhi Chowdhury",
        "Antar Chandra Das",
        "Ashim Chandra Das"
      ],
      "abstract": "Borrowing external data can improve estimation efficiency but may introduce bias when populations differ in covariate distributions or outcome variability. A proper balance needs to be maintained between the two datasets to justify the borrowing. We propose a propensity score weighting borrowing-by-parts power prior (PSW-BPP) that integrates causal covariate adjustment through propensity score weighting with a flexible Bayesian borrowing approach to address these challenges in a unified framework. The proposed approach first applies propensity score weighting to align the covariate distribution of the external data with that of the current study, thereby targeting a common estimand and reducing confounding due to population heterogeneity. The weighted external likelihood is then incorporated into a Bayesian model through a borrowing-by-parts power prior, which allows distinct power parameters for the mean and variance components of the likelihood, enabling differential and calibrated information borrowing. Additionally, we adopt the idea of the minimal plausibility index (mPI) to calculate the power parameters. This separate borrowing provides greater robustness to prior-data conflict compared with traditional power prior methods that impose a single borrowing parameter. We study the operating characteristics of PSW-BPP through extensive simulation and a real data example. Simulation studies demonstrate that PSW-BPP yields more efficient and stable estimation than no borrowing and fixed borrowing, particularly under moderate covariate imbalance and outcome heterogeneity. The proposed framework offers a principled and extensible methodological contribution for Bayesian inference with external data in observational and hybrid study designs.",
      "pdf_url": "https://arxiv.org/pdf/2601.03480v1",
      "arxiv_url": "http://arxiv.org/abs/2601.03480v1",
      "published": "2026-01-07",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "On estimands in target trial emulation",
      "authors": [
        "Edoardo Efrem Gervasoni",
        "Liesbet De Bus",
        "Stijn Vansteelandt",
        "Oliver Dukes"
      ],
      "abstract": "The target trial framework enables causal inference from longitudinal observational data by emulating randomized trials initiated at multiple time points. Precision is often improved by pooling information across trials, with standard models typically assuming - among other things - a time-constant treatment effect. However, this obscures interpretation when the true treatment effect varies, which we argue to be likely as a result of relying on noncollapsible estimands. To address these challenges, this paper introduces a model-free strategy for target trial analysis, centered around the choice of the estimand, rather than model specification. This ensures that treatment effects remain clearly interpretable for well-defined populations even under model misspecification. We propose estimands suitable for different study designs, and develop accompanying G-computation and inverse probability weighted estimators. Applications on simulations and real data on antimicrobial de-escalation in an intensive care unit setting demonstrate the greater clarity and reliability of the proposed methodology over traditional techniques.",
      "pdf_url": "https://arxiv.org/pdf/2601.03377v1",
      "arxiv_url": "http://arxiv.org/abs/2601.03377v1",
      "published": "2026-01-06",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Discovering and Causally Validating Emotion-Sensitive Neurons in Large Audio-Language Models",
      "authors": [
        "Xiutian Zhao",
        "Björn Schuller",
        "Berrak Sisman"
      ],
      "abstract": "Emotion is a central dimension of spoken communication, yet, we still lack a mechanistic account of how modern large audio-language models (LALMs) encode it internally. We present the first neuron-level interpretability study of emotion-sensitive neurons (ESNs) in LALMs and provide causal evidence that such units exist in Qwen2.5-Omni, Kimi-Audio, and Audio Flamingo 3. Across these three widely used open-source models, we compare frequency-, entropy-, magnitude-, and contrast-based neuron selectors on multiple emotion recognition benchmarks. Using inference-time interventions, we reveal a consistent emotion-specific signature: ablating neurons selected for a given emotion disproportionately degrades recognition of that emotion while largely preserving other classes, whereas gain-based amplification steers predictions toward the target emotion. These effects arise with modest identification data and scale systematically with intervention strength. We further observe that ESNs exhibit non-uniform layer-wise clustering with partial cross-dataset transfer. Taken together, our results offer a causal, neuron-level account of emotion decisions in LALMs and highlight targeted neuron interventions as an actionable handle for controllable affective behaviors.",
      "pdf_url": "https://arxiv.org/pdf/2601.03115v1",
      "arxiv_url": "http://arxiv.org/abs/2601.03115v1",
      "published": "2026-01-06",
      "categories": [
        "cs.CL",
        "eess.AS"
      ]
    },
    {
      "title": "Time-Aware Synthetic Control",
      "authors": [
        "Saeyoung Rho",
        "Cyrus Illick",
        "Samhitha Narasipura",
        "Alberto Abadie",
        "Daniel Hsu",
        "Vishal Misra"
      ],
      "abstract": "The synthetic control (SC) framework is widely used for observational causal inference with time-series panel data. SC has been successful in diverse applications, but existing methods typically treat the ordering of pre-intervention time indices interchangeable. This invariance means they may not fully take advantage of temporal structure when strong trends are present. We propose Time-Aware Synthetic Control (TASC), which employs a state-space model with a constant trend while preserving a low-rank structure of the signal. TASC uses the Kalman filter and Rauch-Tung-Striebel smoother: it first fits a generative time-series model with expectation-maximization and then performs counterfactual inference. We evaluate TASC on both simulated and real-world datasets, including policy evaluation and sports prediction. Our results suggest that TASC offers advantages in settings with strong temporal trends and high levels of observation noise.",
      "pdf_url": "https://arxiv.org/pdf/2601.03099v1",
      "arxiv_url": "http://arxiv.org/abs/2601.03099v1",
      "published": "2026-01-06",
      "categories": [
        "cs.LG",
        "econ.EM",
        "stat.ML"
      ]
    },
    {
      "title": "Causal Manifold Fairness: Enforcing Geometric Invariance in Representation Learning",
      "authors": [
        "Vidhi Rathore"
      ],
      "abstract": "Fairness in machine learning is increasingly critical, yet standard approaches often treat data as static points in a high-dimensional space, ignoring the underlying generative structure. We posit that sensitive attributes (e.g., race, gender) do not merely shift data distributions but causally warp the geometry of the data manifold itself. To address this, we introduce Causal Manifold Fairness (CMF), a novel framework that bridges causal inference and geometric deep learning. CMF learns a latent representation where the local Riemannian geometry, defined by the metric tensor and curvature, remains invariant under counterfactual interventions on sensitive attributes. By enforcing constraints on the Jacobian and Hessian of the decoder, CMF ensures that the rules of the latent space (distances and shapes) are preserved across demographic groups. We validate CMF on synthetic Structural Causal Models (SCMs), demonstrating that it effectively disentangles sensitive geometric warping while preserving task utility, offering a rigorous quantification of the fairness-utility trade-off via geometric metrics.",
      "pdf_url": "https://arxiv.org/pdf/2601.03032v1",
      "arxiv_url": "http://arxiv.org/abs/2601.03032v1",
      "published": "2026-01-06",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CY"
      ]
    },
    {
      "title": "AbductiveMLLM: Boosting Visual Abductive Reasoning Within MLLMs",
      "authors": [
        "Boyu Chang",
        "Qi Wang",
        "Xi Guo",
        "Zhixiong Nan",
        "Yazhou Yao",
        "Tianfei Zhou"
      ],
      "abstract": "Visual abductive reasoning (VAR) is a challenging task that requires AI systems to infer the most likely explanation for incomplete visual observations. While recent MLLMs develop strong general-purpose multimodal reasoning capabilities, they fall short in abductive inference, as compared to human beings. To bridge this gap, we draw inspiration from the interplay between verbal and pictorial abduction in human cognition, and propose to strengthen abduction of MLLMs by mimicking such dual-mode behavior. Concretely, we introduce AbductiveMLLM comprising of two synergistic components: REASONER and IMAGINER. The REASONER operates in the verbal domain. It first explores a broad space of possible explanations using a blind LLM and then prunes visually incongruent hypotheses based on cross-modal causal alignment. The remaining hypotheses are introduced into the MLLM as targeted priors, steering its reasoning toward causally coherent explanations. The IMAGINER, on the other hand, further guides MLLMs by emulating human-like pictorial thinking. It conditions a text-to-image diffusion model on both the input video and the REASONER's output embeddings to \"imagine\" plausible visual scenes that correspond to verbal explanation, thereby enriching MLLMs' contextual grounding. The two components are trained jointly in an end-to-end manner. Experiments on standard VAR benchmarks show that AbductiveMLLM achieves state-of-the-art performance, consistently outperforming traditional solutions and advanced MLLMs.",
      "pdf_url": "https://arxiv.org/pdf/2601.02771v1",
      "arxiv_url": "http://arxiv.org/abs/2601.02771v1",
      "published": "2026-01-06",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "Inferring Causal Graph Temporal Logic Formulas to Expedite Reinforcement Learning in Temporally Extended Tasks",
      "authors": [
        "Hadi Partovi Aria",
        "Zhe Xu"
      ],
      "abstract": "Decision-making tasks often unfold on graphs with spatial-temporal dynamics. Black-box reinforcement learning often overlooks how local changes spread through network structure, limiting sample efficiency and interpretability. We present GTL-CIRL, a closed-loop framework that simultaneously learns policies and mines Causal Graph Temporal Logic (Causal GTL) specifications. The method shapes rewards with robustness, collects counterexamples when effects fail, and uses Gaussian Process (GP) driven Bayesian optimization to refine parameterized cause templates. The GP models capture spatial and temporal correlations in the system dynamics, enabling efficient exploration of complex parameter spaces. Case studies in gene and power networks show faster learning and clearer, verifiable behavior compared to standard RL baselines.",
      "pdf_url": "https://arxiv.org/pdf/2601.02666v1",
      "arxiv_url": "http://arxiv.org/abs/2601.02666v1",
      "published": "2026-01-06",
      "categories": [
        "cs.AI",
        "cs.LO"
      ]
    },
    {
      "title": "Causal inference for censored data with continuous marks",
      "authors": [
        "Lianqiang Qu",
        "Long Lv",
        "Liuquan Sun"
      ],
      "abstract": "This paper presents a framework for causal inference in the presence of censored data, where the failure time is marked by a continuous variable known as a mark. The mark can be viewed as an extension of the failure cause in the classical competing risks model where the cause of failure is replaced by a continuous mark only observed at uncensored failure times. Due to the continuous nature of the marks, observations at each specific mark are sparse, making the identification and estimation of causality a challenging task. To address this issue, we define a new mark-specific treatment effect within the potential outcomes framework and characterize its identifying conditions. We then propose a local smoothing causal estimand and establish its asymptotic properties. We evaluate our method using simulation studies as well as a real dataset from the Antibody Mediated Prevention trials.",
      "pdf_url": "https://arxiv.org/pdf/2601.01854v1",
      "arxiv_url": "http://arxiv.org/abs/2601.01854v1",
      "published": "2026-01-05",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Causal Network Recovery in Perturb-seq Experiments Using Proxy and Instrumental Variables",
      "authors": [
        "Kwangmoon Park",
        "Hongzhe Li"
      ],
      "abstract": "Emerging single-cell technologies that integrate CRISPR-based genetic perturbations with single-cell RNA sequencing, such as Perturb-seq, have substantially advanced our understanding of gene regulation and causal influence of genes. While Perturb-seq data provide valuable causal insights into gene-gene interactions, statistical concerns remain regarding unobserved confounders that may bias inference. These latent factors may arise not only from intrinsic molecular features of regulatory elements encoded in Perturb-seq experiments, but also from unobserved genes arising from cost-constrained experimental designs. Although methods for analyzing largescale Perturb-seq data are rapidly maturing, approaches that explicitly account for such unobserved confounders in learning the causal gene networks are still lacking. Here, we propose a novel method to recover causal gene networks from Perturb-seq experiments with robustness to arbitrarily omitted confounders. Our framework leverages proxy and instrumental variable strategies to exploit the rich information embedded in perturbations, enabling unbiased estimation of the underlying directed acyclic graph (DAG) of gene expressions. Simulation studies and analyses of CRISPR interference experiments of K562 cells demonstrate that our method outperforms baseline approaches that ignore unmeasured confounding, yielding more accurate and biologically relevant recovery of the true gene causal DAGs.",
      "pdf_url": "https://arxiv.org/pdf/2601.01830v1",
      "arxiv_url": "http://arxiv.org/abs/2601.01830v1",
      "published": "2026-01-05",
      "categories": [
        "stat.ME",
        "stat.AP"
      ]
    }
  ]
}