{
  "last_updated": "2025-04-10T00:50:27.025531",
  "papers": [
    {
      "title": "Characterizing direct and indirect causal effects when outcomes are dependent due to treatment spillover and outcome spillover",
      "authors": [
        "Subhankar Bhadra",
        "Michael Schweinberger"
      ],
      "abstract": "We provide novel insight into causal inference when both treatment spillover\nand outcome spillover occur in connected populations, by taking advantage of\nrecent advances in statistical network analysis. Scenarios with treatment\nspillover and outcome spillover are challenging, because both forms of\nspillover affect outcomes and therefore treatment spillover and outcome\nspillover are intertwined, and outcomes are dependent conditional on treatments\nby virtue of outcome spillover. As a result, the direct and indirect causal\neffects arising from spillover have remained black boxes: While the direct and\nindirect causal effects can be identified, it is unknown how these causal\neffects explicitly depend on the effects of treatment, treatment spillover, and\noutcome spillover. We make three contributions, facilitated by low-rank random\ninterference graphs. First, we provide novel insight into direct and indirect\ncausal effects by disentangling the contributions of treatment, treatment\nspillover, and outcome spillover. Second, we provide scalable estimators of\ndirect and indirect causal effects. Third, we establish rates of convergence\nfor estimators of direct and indirect causal effects. These are the first\nconvergence rates in scenarios in which treatment spillover and outcome\nspillover are intertwined and outcomes are dependent conditional on treatments,\nand the interference graph is sparse or dense.",
      "pdf_url": "http://arxiv.org/pdf/2504.06108v1",
      "arxiv_url": "http://arxiv.org/abs/2504.06108v1",
      "published": "2025-04-08",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Identification and estimation of causal peer effects using instrumental variables",
      "authors": [
        "Shanshan Luo",
        "Kang Shuai",
        "Yechi Zhang",
        "Wei Li",
        "Yangbo He"
      ],
      "abstract": "In social science researches, causal inference regarding peer effects often\nfaces significant challenges due to homophily bias and contextual confounding.\nFor example, unmeasured health conditions (e.g., influenza) and psychological\nstates (e.g., happiness, loneliness) can spread among closely connected\nindividuals, such as couples or siblings. To address these issues, we define\nfour effect estimands for dyadic data to characterize direct effects and\nspillover effects. We employ dual instrumental variables to achieve\nnonparametric identification of these causal estimands in the presence of\nunobserved confounding. We then derive the efficient influence functions for\nthese estimands under the nonparametric model. Additionally, we develop a\ntriply robust and locally efficient estimator that remains consistent even\nunder partial misspecification of the observed data model. The proposed robust\nestimators can be easily adapted to flexible approaches such as machine\nlearning estimation methods, provided that certain rate conditions are\nsatisfied. Finally, we illustrate our approach through simulations and an\nempirical application evaluating the peer effects of retirement on fluid\ncognitive perception among couples.",
      "pdf_url": "http://arxiv.org/pdf/2504.05658v1",
      "arxiv_url": "http://arxiv.org/abs/2504.05658v1",
      "published": "2025-04-08",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "REWIND: Real-Time Egocentric Whole-Body Motion Diffusion with Exemplar-Based Identity Conditioning",
      "authors": [
        "Jihyun Lee",
        "Weipeng Xu",
        "Alexander Richard",
        "Shih-En Wei",
        "Shunsuke Saito",
        "Shaojie Bai",
        "Te-Li Wang",
        "Minhyuk Sung",
        "Tae-Kyun Kim",
        "Jason Saragih"
      ],
      "abstract": "We present REWIND (Real-Time Egocentric Whole-Body Motion Diffusion), a\none-step diffusion model for real-time, high-fidelity human motion estimation\nfrom egocentric image inputs. While an existing method for egocentric\nwhole-body (i.e., body and hands) motion estimation is non-real-time and\nacausal due to diffusion-based iterative motion refinement to capture\ncorrelations between body and hand poses, REWIND operates in a fully causal and\nreal-time manner. To enable real-time inference, we introduce (1) cascaded\nbody-hand denoising diffusion, which effectively models the correlation between\negocentric body and hand motions in a fast, feed-forward manner, and (2)\ndiffusion distillation, which enables high-quality motion estimation with a\nsingle denoising step. Our denoising diffusion model is based on a modified\nTransformer architecture, designed to causally model output motions while\nenhancing generalizability to unseen motion lengths. Additionally, REWIND\noptionally supports identity-conditioned motion estimation when identity prior\nis available. To this end, we propose a novel identity conditioning method\nbased on a small set of pose exemplars of the target identity, which further\nenhances motion estimation quality. Through extensive experiments, we\ndemonstrate that REWIND significantly outperforms the existing baselines both\nwith and without exemplar-based identity conditioning.",
      "pdf_url": "http://arxiv.org/pdf/2504.04956v2",
      "arxiv_url": "http://arxiv.org/abs/2504.04956v2",
      "published": "2025-04-07",
      "categories": [
        "cs.GR",
        "cs.CV"
      ]
    },
    {
      "title": "Causal Inference Isn't Special: Why It's Just Another Prediction Problem",
      "authors": [
        "Carlos Fernández-Loría"
      ],
      "abstract": "Causal inference is often portrayed as fundamentally distinct from predictive\nmodeling, with its own terminology, goals, and intellectual challenges. But at\nits core, causal inference is simply a structured instance of prediction under\ndistribution shift. In both cases, we begin with labeled data from a source\ndomain and seek to generalize to a target domain where outcomes are not\nobserved. The key difference is that in causal inference, the labels --\npotential outcomes -- are selectively observed based on treatment assignment,\nintroducing bias that must be addressed through assumptions. This perspective\nreframes causal estimation as a familiar generalization problem and highlights\nhow techniques from predictive modeling, such as reweighting and domain\nadaptation, apply directly to causal tasks. It also clarifies that causal\nassumptions are not uniquely strong -- they are simply more explicit. By\nviewing causal inference through the lens of prediction, we demystify its\nlogic, connect it to familiar tools, and make it more accessible to\npractitioners and educators alike.",
      "pdf_url": "http://arxiv.org/pdf/2504.04320v1",
      "arxiv_url": "http://arxiv.org/abs/2504.04320v1",
      "published": "2025-04-06",
      "categories": [
        "cs.LG",
        "stat.ME",
        "stat.ML"
      ]
    },
    {
      "title": "Multi-resolution Score-Based Variational Graphical Diffusion for Causal Disaster System Modeling and Inference",
      "authors": [
        "Xuechun Li",
        "Shan Gao",
        "Susu Xu"
      ],
      "abstract": "Complex systems with intricate causal dependencies challenge accurate\nprediction. Effective modeling requires precise physical process\nrepresentation, integration of interdependent factors, and incorporation of\nmulti-resolution observational data. These systems manifest in both static\nscenarios with instantaneous causal chains and temporal scenarios with evolving\ndynamics, complicating modeling efforts. Current methods struggle to\nsimultaneously handle varying resolutions, capture physical relationships,\nmodel causal dependencies, and incorporate temporal dynamics, especially with\ninconsistently sampled data from diverse sources. We introduce Temporal-SVGDM:\nScore-based Variational Graphical Diffusion Model for Multi-resolution\nobservations. Our framework constructs individual SDEs for each variable at its\nnative resolution, then couples these SDEs through a causal score mechanism\nwhere parent nodes inform child nodes' evolution. This enables unified modeling\nof both immediate causal effects in static scenarios and evolving dependencies\nin temporal scenarios. In temporal models, state representations are processed\nthrough a sequence prediction model to predict future states based on\nhistorical patterns and causal relationships. Experiments on real-world\ndatasets demonstrate improved prediction accuracy and causal understanding\ncompared to existing methods, with robust performance under varying levels of\nbackground knowledge. Our model exhibits graceful degradation across different\ndisaster types, successfully handling both static earthquake scenarios and\ntemporal hurricane and wildfire scenarios, while maintaining superior\nperformance even with limited data.",
      "pdf_url": "http://arxiv.org/pdf/2504.04015v1",
      "arxiv_url": "http://arxiv.org/abs/2504.04015v1",
      "published": "2025-04-05",
      "categories": [
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "Multivariate Causal Effects: a Bayesian Causal Regression Factor Model",
      "authors": [
        "Dafne Zorzetto",
        "Jenna Landy",
        "Corwin Zigler",
        "Giovanni Parmigiani",
        "Roberta De Vito"
      ],
      "abstract": "The impact of wildfire smoke on air quality is a growing concern,\ncontributing to air pollution through a complex mixture of chemical species\nwith important implications for public health. While previous studies have\nprimarily focused on its association with total particulate matter (PM2.5), the\ncausal relationship between wildfire smoke and the chemical composition of\nPM2.5 remains largely unexplored. Exposure to these chemical mixtures plays a\ncritical role in shaping public health, yet capturing their relationships\nrequires advanced statistical methods capable of modeling the complex\ndependencies among chemical species. To fill this gap, we propose a Bayesian\ncausal regression factor model that estimates the multivariate causal effects\nof wildfire smoke on the concentration of 27 chemical species in PM2.5 across\nthe United States. Our approach introduces two key innovations: (i) a causal\ninference framework for multivariate potential outcomes, and (ii) a novel\nBayesian factor model that employs a probit stick-breaking process as prior for\ntreatment-specific factor scores. By focusing on factor scores, our method\naddresses the missing data challenge common in causal inference and enables a\nflexible, data-driven characterization of the latent factor structure, which is\ncrucial to capture the complex correlation among multivariate outcomes. Through\nMonte Carlo simulations, we show the model's accuracy in estimating the causal\neffects in multivariate outcomes and characterizing the treatment-specific\nlatent structure. Finally, we apply our method to US air quality data,\nestimating the causal effect of wildfire smoke on 27 chemical species in PM2.5,\nproviding a deeper understanding of their interdependencies.",
      "pdf_url": "http://arxiv.org/pdf/2504.03480v1",
      "arxiv_url": "http://arxiv.org/abs/2504.03480v1",
      "published": "2025-04-04",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Spatiotemporal causal inference with arbitrary spillover and carryover effects",
      "authors": [
        "Mitsuru Mukaigawara",
        "Kosuke Imai",
        "Jason Lyall",
        "Georgia Papadogeorgou"
      ],
      "abstract": "Micro-level data with granular spatial and temporal information are becoming\nincreasingly available to social scientists. Most researchers aggregate such\ndata into a convenient panel data format and apply standard causal inference\nmethods. This approach, however, has two limitations. First, data aggregation\nresults in the loss of detailed geo-location and temporal information, leading\nto potential biases. Second, most panel data methods either ignore spatial\nspillover and temporal carryover effects or impose restrictive assumptions on\ntheir structure. We introduce a general methodological framework for\nspatiotemporal causal inference with arbitrary spillover and carryover effects.\nUnder this general framework, we demonstrate how to define and estimate causal\nquantities of interest, explore heterogeneous treatment effects, investigate\ncausal mechanisms, and visualize the results to facilitate their\ninterpretation. We illustrate the proposed methodology through an analysis of\nairstrikes and insurgent attacks in Iraq. The open-source software package\ngeocausal implements all of our methods.",
      "pdf_url": "http://arxiv.org/pdf/2504.03464v1",
      "arxiv_url": "http://arxiv.org/abs/2504.03464v1",
      "published": "2025-04-04",
      "categories": [
        "stat.ME",
        "stat.AP"
      ]
    },
    {
      "title": "The Amenability Framework: Rethinking Causal Ordering Without Estimating Causal Effects",
      "authors": [
        "Carlos Fernández-Loría",
        "Jorge Loría"
      ],
      "abstract": "Who should we prioritize for intervention when we cannot estimate\nintervention effects? In many applied domains (e.g., advertising, customer\nretention, and behavioral nudging) prioritization is guided by predictive\nmodels that estimate outcome probabilities rather than causal effects. This\npaper investigates when these predictions (scores) can effectively rank\nindividuals by their intervention effects, particularly when direct effect\nestimation is infeasible or unreliable. We propose a conceptual framework based\non amenability: an individual's latent proclivity to be influenced by an\nintervention. We then formalize conditions under which predictive scores serve\nas effective proxies for amenability. These conditions justify using non-causal\nscores for intervention prioritization, even when the scores do not directly\nestimate effects. We further show that, under plausible assumptions, predictive\nmodels can outperform causal effect estimators in ranking individuals by\nintervention effects. Empirical evidence from an advertising context supports\nour theoretical findings, demonstrating that predictive modeling can offer a\nmore robust approach to targeting than effect estimation. Our framework\nsuggests a shift in focus, from estimating effects to inferring who is\namenable, as a practical and theoretically grounded strategy for prioritizing\ninterventions in resource-constrained environments.",
      "pdf_url": "http://arxiv.org/pdf/2504.02456v2",
      "arxiv_url": "http://arxiv.org/abs/2504.02456v2",
      "published": "2025-04-03",
      "categories": [
        "cs.LG",
        "stat.ME"
      ]
    },
    {
      "title": "Causal Self-supervised Pretrained Frontend with Predictive Code for Speech Separation",
      "authors": [
        "Wupeng Wang",
        "Zexu Pan",
        "Xinke Li",
        "Shuai Wang",
        "Haizhou Li"
      ],
      "abstract": "Speech separation (SS) seeks to disentangle a multi-talker speech mixture\ninto single-talker speech streams. Although SS can be generally achieved using\noffline methods, such a processing paradigm is not suitable for real-time\nstreaming applications. Causal separation models, which rely only on past and\npresent information, offer a promising solution for real-time streaming.\nHowever, these models typically suffer from notable performance degradation due\nto the absence of future context. In this paper, we introduce a novel frontend\nthat is designed to mitigate the mismatch between training and run-time\ninference by implicitly incorporating future information into causal models\nthrough predictive patterns. The pretrained frontend employs a transformer\ndecoder network with a causal convolutional encoder as the backbone and is\npretrained in a self-supervised manner with two innovative pretext tasks:\nautoregressive hybrid prediction and contextual knowledge distillation. These\ntasks enable the model to capture predictive patterns directly from mixtures in\na self-supervised manner. The pretrained frontend subsequently serves as a\nfeature extractor to generate high-quality predictive patterns. Comprehensive\nevaluations on synthetic and real-world datasets validated the effectiveness of\nthe proposed pretrained frontend.",
      "pdf_url": "http://arxiv.org/pdf/2504.02302v1",
      "arxiv_url": "http://arxiv.org/abs/2504.02302v1",
      "published": "2025-04-03",
      "categories": [
        "cs.SD",
        "cs.LG",
        "eess.AS"
      ]
    },
    {
      "title": "A Causal Inference Framework for Data Rich Environments",
      "authors": [
        "Alberto Abadie",
        "Anish Agarwal",
        "Devavrat Shah"
      ],
      "abstract": "We propose a formal model for counterfactual estimation with unobserved\nconfounding in \"data-rich\" settings, i.e., where there are a large number of\nunits and a large number of measurements per unit. Our model provides a bridge\nbetween the structural causal model view of causal inference common in the\ngraphical models literature with that of the latent factor model view common in\nthe potential outcomes literature. We show how classic models for potential\noutcomes and treatment assignments fit within our framework. We provide an\nidentification argument for the average treatment effect, the average treatment\neffect on the treated, and the average treatment effect on the untreated. For\nany estimator that has a fast enough estimation error rate for a certain\nnuisance parameter, we establish it is consistent for these various causal\nparameters. We then show principal component regression is one such estimator\nthat leads to consistent estimation, and we analyze the minimal smoothness\nrequired of the potential outcomes function for consistency.",
      "pdf_url": "http://arxiv.org/pdf/2504.01702v1",
      "arxiv_url": "http://arxiv.org/abs/2504.01702v1",
      "published": "2025-04-02",
      "categories": [
        "econ.EM",
        "cs.LG",
        "stat.ME"
      ]
    }
  ]
}