{
  "last_updated": "2025-03-19T00:49:13.151026",
  "papers": [
    {
      "title": "Causes of evolutionary divergence in prostate cancer",
      "authors": [
        "Emre Esenturk",
        "Atef Sahli",
        "Valeriia Haberland",
        "Aleksandra Ziuboniewicz",
        "Christopher Wirth",
        "G. Steven Bova",
        "Robert G Bristow",
        "Mark N Brook",
        "Benedikt Brors",
        "Adam Butler",
        "Géraldine Cancel-Tassin",
        "Kevin CL Cheng",
        "Colin S Cooper",
        "Niall M Corcoran",
        "Olivier Cussenot",
        "Ros A Eeles",
        "Francesco Favero",
        "Clarissa Gerhauser",
        "Abraham Gihawi",
        "Etsehiwot G Girma",
        "Vincent J Gnanapragasam",
        "Andreas J Gruber",
        "Anis Hamid",
        "Vanessa M Hayes",
        "Housheng Hansen He",
        "Christopher M Hovens",
        "Eddie Luidy Imada",
        "G. Maria Jakobsdottir",
        "Chol-hee Jung",
        "Francesca Khani",
        "Zsofia Kote-Jarai",
        "Philippe Lamy",
        "Gregory Leeman",
        "Massimo Loda",
        "Pavlo Lutsik",
        "Luigi Marchionni",
        "Ramyar Molania",
        "Anthony T Papenfuss",
        "Diogo Pellegrina",
        "Bernard Pope",
        "Lucio R Queiroz",
        "Tobias Rausch",
        "Jüri Reimand",
        "Brian Robinson",
        "Thorsten Schlomm",
        "Karina D Sørensen",
        "Sebastian Uhrig",
        "Joachim Weischenfeldt",
        "Yaobo Xu",
        "Takafumi N Yamaguchi",
        "Claudio Zanettini",
        "Andy G Lynch",
        "David C Wedge",
        "Daniel S Brewer",
        "Dan J Woodcock"
      ],
      "abstract": "Cancer progression involves the sequential accumulation of genetic\nalterations that cumulatively shape the tumour phenotype. In prostate cancer,\ntumours can follow divergent evolutionary trajectories that lead to distinct\nsubtypes, but the causes of this divergence remain unclear. While causal\ninference could elucidate the factors involved, conventional methods are\nunsuitable due to the possibility of unobserved confounders and ambiguity in\nthe direction of causality. Here, we propose a method that circumvents these\nissues and apply it to genomic data from 829 prostate cancer patients. We\nidentify several genetic alterations that drive divergence as well as others\nthat prevent this transition, locking tumours into one trajectory. Further\nanalysis reveals that these genetic alterations may cause each other, implying\na positive-feedback loop that accelerates divergence. Our findings provide\ninsights into how cancer subtypes emerge and offer a foundation for genomic\nsurveillance strategies aimed at monitoring the progression of prostate cancer.",
      "pdf_url": "http://arxiv.org/pdf/2503.13189v1",
      "arxiv_url": "http://arxiv.org/abs/2503.13189v1",
      "published": "2025-03-17",
      "categories": [
        "q-bio.GN"
      ]
    },
    {
      "title": "Causal Feature Learning in the Social Sciences",
      "authors": [
        "Jingzhou Huang",
        "Jiuyao Lu",
        "Alexander Williams Tolbert"
      ],
      "abstract": "Variable selection poses a significant challenge in causal modeling,\nparticularly within the social sciences, where constructs often rely on\ninter-related factors such as age, socioeconomic status, gender, and race.\nIndeed, it has been argued that such attributes must be modeled as macro-level\nabstractions of lower-level manipulable features, in order to preserve the\nmodularity assumption essential to causal inference. This paper accordingly\nextends the theoretical framework of Causal Feature Learning (CFL).\nEmpirically, we apply the CFL algorithm to diverse social science datasets,\nevaluating how CFL-derived macrostates compare with traditional microstates in\ndownstream modeling tasks.",
      "pdf_url": "http://arxiv.org/pdf/2503.12784v1",
      "arxiv_url": "http://arxiv.org/abs/2503.12784v1",
      "published": "2025-03-17",
      "categories": [
        "stat.ME",
        "cs.LG",
        "stat.AP"
      ]
    },
    {
      "title": "Computational identification of ketone metabolism as a key regulator of sleep stability and circadian dynamics via real-time metabolic profiling",
      "authors": [
        "Hao Huang",
        "Kaijing Xu",
        "Michael Lardelli"
      ],
      "abstract": "Metabolism plays a crucial role in sleep regulation, yet its effects are\nchallenging to track in real time. This study introduces a machine\nlearning-based framework to analyze sleep patterns and identify how metabolic\nchanges influence sleep at specific time points. We first established that\nsleep periods in Drosophila melanogaster function independently, with no causal\nrelationship between different sleep episodes. Using gradient boosting models\nand explainable artificial intelligence techniques, we quantified the influence\nof time-dependent sleep features. Causal inference and autocorrelation analyses\nfurther confirmed that sleep states at different times are statistically\nindependent, providing a robust foundation for exploring metabolic effects on\nsleep. Applying this framework to flies with altered monocarboxylate\ntransporter 2 expression, we found that changes in ketone transport modified\nsleep stability and disrupted transitions between day and night sleep. In an\nAlzheimers disease model, metabolic interventions such as beta hydroxybutyrate\nsupplementation and intermittent fasting selectively influenced the timing of\nday to night transitions rather than uniformly altering sleep duration.\nAutoencoder based similarity scoring and wavelet analysis reinforced that\nmetabolic effects on sleep were highly time dependent. This study presents a\nnovel approach to studying sleep-metabolism interactions, revealing that\nmetabolic states exert their strongest influence at distinct time points,\nshaping sleep stability and circadian transitions.",
      "pdf_url": "http://arxiv.org/pdf/2503.12330v1",
      "arxiv_url": "http://arxiv.org/abs/2503.12330v1",
      "published": "2025-03-16",
      "categories": [
        "q-bio.QM",
        "q-bio.GN",
        "q-bio.NC"
      ]
    },
    {
      "title": "Vamba: Understanding Hour-Long Videos with Hybrid Mamba-Transformers",
      "authors": [
        "Weiming Ren",
        "Wentao Ma",
        "Huan Yang",
        "Cong Wei",
        "Ge Zhang",
        "Wenhu Chen"
      ],
      "abstract": "State-of-the-art transformer-based large multimodal models (LMMs) struggle to\nhandle hour-long video inputs due to the quadratic complexity of the causal\nself-attention operations, leading to high computational costs during training\nand inference. Existing token compression-based methods reduce the number of\nvideo tokens but often incur information loss and remain inefficient for\nextremely long sequences. In this paper, we explore an orthogonal direction to\nbuild a hybrid Mamba-Transformer model (VAMBA) that employs Mamba-2 blocks to\nencode video tokens with linear complexity. Without any token reduction, VAMBA\ncan encode more than 1024 frames (640$\\times$360) on a single GPU, while\ntransformer-based models can only encode 256 frames. On long video input, VAMBA\nachieves at least 50% reduction in GPU memory usage during training and\ninference, and nearly doubles the speed per training step compared to\ntransformer-based LMMs. Our experimental results demonstrate that VAMBA\nimproves accuracy by 4.3% on the challenging hour-long video understanding\nbenchmark LVBench over prior efficient video LMMs, and maintains strong\nperformance on a broad spectrum of long and short video understanding tasks.",
      "pdf_url": "http://arxiv.org/pdf/2503.11579v1",
      "arxiv_url": "http://arxiv.org/abs/2503.11579v1",
      "published": "2025-03-14",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "Difference-in-Differences Meets Synthetic Control: Doubly Robust Identification and Estimation",
      "authors": [
        "Yixiao Sun",
        "Haitian Xie",
        "Yuhang Zhang"
      ],
      "abstract": "Difference-in-Differences (DiD) and Synthetic Control (SC) are widely used\nmethods for causal inference in panel data, each with its own strengths and\nlimitations. In this paper, we propose a novel methodology that integrates the\nadvantages of both DiD and SC approaches. Our integrated approach provides a\ndoubly robust identification strategy for causal effects in panel data with a\ngroup structure, identifying the average treatment effect on the treated (ATT)\nunder either the parallel trends assumption or the group-level SC assumption.\nBuilding on this identification result, we develop a unified semiparametric\nframework for estimating the ATT. Notably, while the identification-robust\nmoment function satisfies Neyman orthogonality under the parallel trends\nassumption, it does not under the SC assumption, leading to different\nasymptotic variances under these two identification strategies. To address this\nchallenge, we propose a multiplier bootstrap method that consistently\napproximates the asymptotic distribution, regardless of which identification\nassumption holds. Furthermore, we extend our methodology to accommodate\nrepeated cross-sectional data and staggered treatment designs. As an empirical\napplication, we apply our method to evaluate the impact of the 2003 minimum\nwage increase in Alaska on family income.",
      "pdf_url": "http://arxiv.org/pdf/2503.11375v1",
      "arxiv_url": "http://arxiv.org/abs/2503.11375v1",
      "published": "2025-03-14",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "Autoregressive Image Generation with Randomized Parallel Decoding",
      "authors": [
        "Haopeng Li",
        "Jinyue Yang",
        "Guoqi Li",
        "Huan Wang"
      ],
      "abstract": "We introduce ARPG, a novel visual autoregressive model that enables\nrandomized parallel generation, addressing the inherent limitations of\nconventional raster-order approaches, which hinder inference efficiency and\nzero-shot generalization due to their sequential, predefined token generation\norder. Our key insight is that effective random-order modeling necessitates\nexplicit guidance for determining the position of the next predicted token. To\nthis end, we propose a novel guided decoding framework that decouples\npositional guidance from content representation, encoding them separately as\nqueries and key-value pairs. By directly incorporating this guidance into the\ncausal attention mechanism, our approach enables fully random-order training\nand generation, eliminating the need for bidirectional attention. Consequently,\nARPG readily generalizes to zero-shot tasks such as image inpainting,\noutpainting, and resolution expansion. Furthermore, it supports parallel\ninference by concurrently processing multiple queries using a shared KV cache.\nOn the ImageNet-1K 256 benchmark, our approach attains an FID of 1.94 with only\n64 sampling steps, achieving over a 20-fold increase in throughput while\nreducing memory consumption by over 75% compared to representative recent\nautoregressive models at a similar scale.",
      "pdf_url": "http://arxiv.org/pdf/2503.10568v1",
      "arxiv_url": "http://arxiv.org/abs/2503.10568v1",
      "published": "2025-03-13",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "SCOOP: A Framework for Proactive Collaboration and Social Continual Learning through Natural Language Interaction andCausal Reasoning",
      "authors": [
        "Dimitri Ognibene",
        "Sabrina Patania",
        "Luca Annese",
        "Cansu Koyuturk",
        "Franca Garzotto",
        "Giuseppe Vizzari",
        "Azzurra Ruggeri",
        "Simone Colombani"
      ],
      "abstract": "Multimodal information-gathering settings, where users collaborate with AI in\ndynamic environments, are increasingly common. These involve complex processes\nwith textual and multimodal interactions, often requiring additional structural\ninformation via cost-incurring requests. AI helpers lack access to users' true\ngoals, beliefs, and preferences and struggle to integrate diverse information\neffectively.\n  We propose a social continual learning framework for causal knowledge\nacquisition and collaborative decision-making. It focuses on autonomous agents\nlearning through dialogues, question-asking, and interaction in open, partially\nobservable environments. A key component is a natural language oracle that\nanswers the agent's queries about environmental mechanisms and states, refining\ncausal understanding while balancing exploration or learning, and exploitation\nor knowledge use.\n  Evaluation tasks inspired by developmental psychology emphasize causal\nreasoning and question-asking skills. They complement benchmarks by assessing\nthe agent's ability to identify knowledge gaps, generate meaningful queries,\nand incrementally update reasoning. The framework also evaluates how knowledge\nacquisition costs are amortized across tasks within the same environment.\n  We propose two architectures: 1) a system combining Large Language Models\n(LLMs) with the ReAct framework and question-generation, and 2) an advanced\nsystem with a causal world model, symbolic, graph-based, or subsymbolic, for\nreasoning and decision-making. The latter builds a causal knowledge graph for\nefficient inference and adaptability under constraints. Challenges include\nintegrating causal reasoning into ReAct and optimizing exploration and\nquestion-asking in error-prone scenarios. Beyond applications, this framework\nmodels developmental processes combining causal reasoning, question generation,\nand social learning.",
      "pdf_url": "http://arxiv.org/pdf/2503.10241v1",
      "arxiv_url": "http://arxiv.org/abs/2503.10241v1",
      "published": "2025-03-13",
      "categories": [
        "cs.MA",
        "cs.HC",
        "cs.RO"
      ]
    },
    {
      "title": "Using Causal Inference to Explore Government Policy Impact on Computer Usage",
      "authors": [
        "Mingjia Zhu",
        "Lechuan Wang",
        "Julien Sebot",
        "Bijan Arbab",
        "Babak Salimi",
        "Alexander Cloninger"
      ],
      "abstract": "We explore the causal relationship between COVID-19 lockdown policies and\nchanges in personal computer usage. In particular, we examine how lockdown\npolicies affected average daily computer usage, as well as how it affected\nusage patterns of different groups of users. This is done through a merging of\nthe Oxford Policy public data set, which describes the timeline of\nimplementation of COVID policies across the world, and a collection of Intel's\nData Collection and Analytics (DCA) telemetry data, which includes millions of\ncomputer usage records and updates daily. Through difference-in-difference,\nsynthetic control, and change-point detection algorithms, we identify causal\nlinks between the increase in intensity (watts) and time (hours) of computer\nusage and the implementation of work from home policy. We also show an\ninteresting trend in the individual's computer usage affected by the policy. We\nalso conclude that computer usage behaviors are much less predictable during\nreduction in COVID lockdown policies than during increases in COVID lockdown\npolicies.",
      "pdf_url": "http://arxiv.org/pdf/2503.09957v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09957v1",
      "published": "2025-03-13",
      "categories": [
        "stat.AP",
        "cs.CY"
      ]
    },
    {
      "title": "Towards Causal Model-Based Policy Optimization",
      "authors": [
        "Alberto Caron",
        "Vasilios Mavroudis",
        "Chris Hicks"
      ],
      "abstract": "Real-world decision-making problems are often marked by complex, uncertain\ndynamics that can shift or break under changing conditions. Traditional\nModel-Based Reinforcement Learning (MBRL) approaches learn predictive models of\nenvironment dynamics from queried trajectories and then use these models to\nsimulate rollouts for policy optimization. However, such methods do not account\nfor the underlying causal mechanisms that govern the environment, and thus\ninadvertently capture spurious correlations, making them sensitive to\ndistributional shifts and limiting their ability to generalize. The same\nnaturally holds for model-free approaches. In this work, we introduce Causal\nModel-Based Policy Optimization (C-MBPO), a novel framework that integrates\ncausal learning into the MBRL pipeline to achieve more robust, explainable, and\ngeneralizable policy learning algorithms.\n  Our approach centers on first inferring a Causal Markov Decision Process\n(C-MDP) by learning a local Structural Causal Model (SCM) of both the state and\nreward transition dynamics from trajectories gathered online. C-MDPs differ\nfrom classic MDPs in that we can decompose causal dependencies in the\nenvironment dynamics via specifying an associated Causal Bayesian Network.\nC-MDPs allow for targeted interventions and counterfactual reasoning, enabling\nthe agent to distinguish between mere statistical correlations and causal\nrelationships. The learned SCM is then used to simulate counterfactual\non-policy transitions and rewards under hypothetical actions (or\n``interventions\"), thereby guiding policy optimization more effectively. The\nresulting policy learned by C-MBPO can be shown to be robust to a class of\ndistributional shifts that affect spurious, non-causal relationships in the\ndynamics. We demonstrate this through some simple experiments involving near\nand far OOD dynamics drifts.",
      "pdf_url": "http://arxiv.org/pdf/2503.09719v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09719v1",
      "published": "2025-03-12",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "Addressing pitfalls in implicit unobserved confounding synthesis using explicit block hierarchical ancestral sampling",
      "authors": [
        "Xudong Sun",
        "Alex Markham",
        "Pratik Misra",
        "Carsten Marr"
      ],
      "abstract": "Unbiased data synthesis is crucial for evaluating causal discovery algorithms\nin the presence of unobserved confounding, given the scarcity of real-world\ndatasets. A common approach, implicit parameterization, encodes unobserved\nconfounding by modifying the off-diagonal entries of the idiosyncratic\ncovariance matrix while preserving positive definiteness. Within this approach,\nstate-of-the-art protocols have two distinct issues that hinder unbiased\nsampling from the complete space of causal models: first, the use of diagonally\ndominant constructions, which restrict the spectrum of partial correlation\nmatrices; and second, the restriction of possible graphical structures when\nsampling bidirected edges, unnecessarily ruling out valid causal models. To\naddress these limitations, we propose an improved explicit modeling approach\nfor unobserved confounding, leveraging block-hierarchical ancestral generation\nof ground truth causal graphs. Algorithms for converting the ground truth DAG\ninto ancestral graph is provided so that the output of causal discovery\nalgorithms could be compared with. We prove that our approach fully covers the\nspace of causal models, including those generated by the implicit\nparameterization, thus enabling more robust evaluation of methods for causal\ndiscovery and inference.",
      "pdf_url": "http://arxiv.org/pdf/2503.09194v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09194v1",
      "published": "2025-03-12",
      "categories": [
        "stat.ML",
        "cs.LG",
        "math.ST",
        "stat.TH"
      ]
    }
  ]
}