{
  "last_updated": "2025-03-20T00:47:53.608693",
  "papers": [
    {
      "title": "Doubly robust identification of treatment effects from multiple environments",
      "authors": [
        "Piersilvio De Bartolomeis",
        "Julia Kostin",
        "Javier Abad",
        "Yixin Wang",
        "Fanny Yang"
      ],
      "abstract": "Practical and ethical constraints often require the use of observational data\nfor causal inference, particularly in medicine and social sciences. Yet,\nobservational datasets are prone to confounding, potentially compromising the\nvalidity of causal conclusions. While it is possible to correct for biases if\nthe underlying causal graph is known, this is rarely a feasible ask in\npractical scenarios. A common strategy is to adjust for all available\ncovariates, yet this approach can yield biased treatment effect estimates,\nespecially when post-treatment or unobserved variables are present. We propose\nRAMEN, an algorithm that produces unbiased treatment effect estimates by\nleveraging the heterogeneity of multiple data sources without the need to know\nor learn the underlying causal graph. Notably, RAMEN achieves doubly robust\nidentification: it can identify the treatment effect whenever the causal\nparents of the treatment or those of the outcome are observed, and the node\nwhose parents are observed satisfies an invariance assumption. Empirical\nevaluations on synthetic and real-world datasets show that our approach\noutperforms existing methods.",
      "pdf_url": "http://arxiv.org/pdf/2503.14459v1",
      "arxiv_url": "http://arxiv.org/abs/2503.14459v1",
      "published": "2025-03-18",
      "categories": [
        "stat.ML",
        "cs.LG",
        "stat.ME"
      ]
    },
    {
      "title": "The covariance of causal effect estimators for binary v-structures",
      "authors": [
        "Jack Kuipers",
        "Giusi Moffa"
      ],
      "abstract": "Previously [Journal of Causal Inference, 10, 90-105 (2022)], we computed the\nvariance of two estimators of causal effects for a v-structure of binary\nvariables. Here we show that a linear combination of these estimators has lower\nvariance than either. Furthermore, we show that this holds also when the\ntreatment variable is block randomised with a predefined number receiving\ntreatment, with analogous results to when it is sampled randomly.",
      "pdf_url": "http://arxiv.org/pdf/2503.14242v1",
      "arxiv_url": "http://arxiv.org/abs/2503.14242v1",
      "published": "2025-03-18",
      "categories": [
        "math.ST",
        "stat.TH"
      ]
    },
    {
      "title": "KANITE: Kolmogorov-Arnold Networks for ITE estimation",
      "authors": [
        "Eshan Mehendale",
        "Abhinav Thorat",
        "Ravi Kolla",
        "Niranjan Pedanekar"
      ],
      "abstract": "We introduce KANITE, a framework leveraging Kolmogorov-Arnold Networks (KANs)\nfor Individual Treatment Effect (ITE) estimation under multiple treatments\nsetting in causal inference. By utilizing KAN's unique abilities to learn\nunivariate activation functions as opposed to learning linear weights by\nMulti-Layer Perceptrons (MLPs), we improve the estimates of ITEs. The KANITE\nframework comprises two key architectures: 1.Integral Probability Metric (IPM)\narchitecture: This employs an IPM loss in a specialized manner to effectively\nalign towards ITE estimation across multiple treatments. 2. Entropy Balancing\n(EB) architecture: This uses weights for samples that are learned by optimizing\nentropy subject to balancing the covariates across treatment groups. Extensive\nevaluations on benchmark datasets demonstrate that KANITE outperforms\nstate-of-the-art algorithms in both $\\epsilon_{\\text{PEHE}}$ and\n$\\epsilon_{\\text{ATE}}$ metrics. Our experiments highlight the advantages of\nKANITE in achieving improved causal estimates, emphasizing the potential of\nKANs to advance causal inference methodologies across diverse application\nareas.",
      "pdf_url": "http://arxiv.org/pdf/2503.13912v1",
      "arxiv_url": "http://arxiv.org/abs/2503.13912v1",
      "published": "2025-03-18",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ME"
      ]
    },
    {
      "title": "Bayesian high-dimensional biological pathway-guided mediation analysis with application to metabolomics",
      "authors": [
        "Yuzi Zhang",
        "Donghai Liang",
        "Youran Tan",
        "Anne L. Dunlop",
        "Howard H. Chang"
      ],
      "abstract": "With advances in high-resolution mass spectrometry technologies, metabolomics\ndata are increasingly used to investigate biological mechanisms underlying\nassociations between exposures and health outcomes in clinical and\nepidemiological studies. Mediation analysis is a powerful framework for\ninvestigating a hypothesized causal chain and when applied to metabolomics\ndata, a large number of correlated metabolites belonging to interconnected\nmetabolic pathways need to be considered as mediators. To identify metabolic\npathways as active mediators, existing approaches typically focus on first\nidentifying individual metabolites as active mediators, followed by post-hoc\nmetabolic pathway determination. These multi-stage procedures make statistical\ninference challenging. We propose a Bayesian biological pathway-guided\nmediation analysis that aims to jointly analyze all metabolites together,\nidentify metabolic pathways directly, and estimate metabolic pathway-specific\nindirect effects. This is accomplished by incorporating existing biological\nknowledge of metabolic pathways to account for correlations among mediators,\nalong with variable selection and dimension reduction techniques. Advantages of\nthe proposed method is demonstrated in extensive simulation studies with\nreal-word metabolic pathway structure. We apply the proposed method to two\nstudies examining the role of metabolism in mediating (1) the effect of\nRoux-en-Y gastric bypass on glycemic control, and (2) the effect of prenatal\nexposure to per- and polyfluoroalkyl substances (PFAS) on gestational age at\nbirth. Our analyses confirm metabolic pathways previously identified and\nprovide additional uncertainty quantification for the mediation effects.",
      "pdf_url": "http://arxiv.org/pdf/2503.13894v1",
      "arxiv_url": "http://arxiv.org/abs/2503.13894v1",
      "published": "2025-03-18",
      "categories": [
        "stat.AP"
      ]
    },
    {
      "title": "Heterogeneous Treatment Effects in Regression Discontinuity Designs",
      "authors": [
        "Sebastian Calonico",
        "Matias D. Cattaneo",
        "Max H. Farrell",
        "Filippo Palomba",
        "Rocio Titiunik"
      ],
      "abstract": "Empirical studies using Regression Discontinuity (RD) designs often explore\nheterogeneous treatment effects based on pretreatment covariates. However, the\nlack of formal statistical methods has led to the widespread use of ad hoc\napproaches in applications. Motivated by common empirical practice, we develop\na unified, theoretically grounded framework for RD heterogeneity analysis. We\nshow that a fully interacted local linear (in functional parameters) model\neffectively captures heterogeneity while still being tractable and\ninterpretable in applications. The model structure holds without loss of\ngenerality for discrete covariates, while for continuous covariates our\nproposed (local functional linear-in-parameters) model can be potentially\nrestrictive, but it nonetheless naturally matches standard empirical practice\nand offers a causal interpretation for RD applications. We establish principled\nbandwidth selection and robust bias-corrected inference methods to analyze\nheterogeneous treatment effects and test group differences. We provide\ncompanion software to facilitate implementation of our results. An empirical\napplication illustrates the practical relevance of our methods.",
      "pdf_url": "http://arxiv.org/pdf/2503.13696v1",
      "arxiv_url": "http://arxiv.org/abs/2503.13696v1",
      "published": "2025-03-17",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "Causes of evolutionary divergence in prostate cancer",
      "authors": [
        "Emre Esenturk",
        "Atef Sahli",
        "Valeriia Haberland",
        "Aleksandra Ziuboniewicz",
        "Christopher Wirth",
        "G. Steven Bova",
        "Robert G Bristow",
        "Mark N Brook",
        "Benedikt Brors",
        "Adam Butler",
        "Géraldine Cancel-Tassin",
        "Kevin CL Cheng",
        "Colin S Cooper",
        "Niall M Corcoran",
        "Olivier Cussenot",
        "Ros A Eeles",
        "Francesco Favero",
        "Clarissa Gerhauser",
        "Abraham Gihawi",
        "Etsehiwot G Girma",
        "Vincent J Gnanapragasam",
        "Andreas J Gruber",
        "Anis Hamid",
        "Vanessa M Hayes",
        "Housheng Hansen He",
        "Christopher M Hovens",
        "Eddie Luidy Imada",
        "G. Maria Jakobsdottir",
        "Chol-hee Jung",
        "Francesca Khani",
        "Zsofia Kote-Jarai",
        "Philippe Lamy",
        "Gregory Leeman",
        "Massimo Loda",
        "Pavlo Lutsik",
        "Luigi Marchionni",
        "Ramyar Molania",
        "Anthony T Papenfuss",
        "Diogo Pellegrina",
        "Bernard Pope",
        "Lucio R Queiroz",
        "Tobias Rausch",
        "Jüri Reimand",
        "Brian Robinson",
        "Thorsten Schlomm",
        "Karina D Sørensen",
        "Sebastian Uhrig",
        "Joachim Weischenfeldt",
        "Yaobo Xu",
        "Takafumi N Yamaguchi",
        "Claudio Zanettini",
        "Andy G Lynch",
        "David C Wedge",
        "Daniel S Brewer",
        "Dan J Woodcock"
      ],
      "abstract": "Cancer progression involves the sequential accumulation of genetic\nalterations that cumulatively shape the tumour phenotype. In prostate cancer,\ntumours can follow divergent evolutionary trajectories that lead to distinct\nsubtypes, but the causes of this divergence remain unclear. While causal\ninference could elucidate the factors involved, conventional methods are\nunsuitable due to the possibility of unobserved confounders and ambiguity in\nthe direction of causality. Here, we propose a method that circumvents these\nissues and apply it to genomic data from 829 prostate cancer patients. We\nidentify several genetic alterations that drive divergence as well as others\nthat prevent this transition, locking tumours into one trajectory. Further\nanalysis reveals that these genetic alterations may cause each other, implying\na positive-feedback loop that accelerates divergence. Our findings provide\ninsights into how cancer subtypes emerge and offer a foundation for genomic\nsurveillance strategies aimed at monitoring the progression of prostate cancer.",
      "pdf_url": "http://arxiv.org/pdf/2503.13189v1",
      "arxiv_url": "http://arxiv.org/abs/2503.13189v1",
      "published": "2025-03-17",
      "categories": [
        "q-bio.GN"
      ]
    },
    {
      "title": "Causal Feature Learning in the Social Sciences",
      "authors": [
        "Jingzhou Huang",
        "Jiuyao Lu",
        "Alexander Williams Tolbert"
      ],
      "abstract": "Variable selection poses a significant challenge in causal modeling,\nparticularly within the social sciences, where constructs often rely on\ninter-related factors such as age, socioeconomic status, gender, and race.\nIndeed, it has been argued that such attributes must be modeled as macro-level\nabstractions of lower-level manipulable features, in order to preserve the\nmodularity assumption essential to causal inference. This paper accordingly\nextends the theoretical framework of Causal Feature Learning (CFL).\nEmpirically, we apply the CFL algorithm to diverse social science datasets,\nevaluating how CFL-derived macrostates compare with traditional microstates in\ndownstream modeling tasks.",
      "pdf_url": "http://arxiv.org/pdf/2503.12784v1",
      "arxiv_url": "http://arxiv.org/abs/2503.12784v1",
      "published": "2025-03-17",
      "categories": [
        "stat.ME",
        "cs.LG",
        "stat.AP"
      ]
    },
    {
      "title": "Computational identification of ketone metabolism as a key regulator of sleep stability and circadian dynamics via real-time metabolic profiling",
      "authors": [
        "Hao Huang",
        "Kaijing Xu",
        "Michael Lardelli"
      ],
      "abstract": "Metabolism plays a crucial role in sleep regulation, yet its effects are\nchallenging to track in real time. This study introduces a machine\nlearning-based framework to analyze sleep patterns and identify how metabolic\nchanges influence sleep at specific time points. We first established that\nsleep periods in Drosophila melanogaster function independently, with no causal\nrelationship between different sleep episodes. Using gradient boosting models\nand explainable artificial intelligence techniques, we quantified the influence\nof time-dependent sleep features. Causal inference and autocorrelation analyses\nfurther confirmed that sleep states at different times are statistically\nindependent, providing a robust foundation for exploring metabolic effects on\nsleep. Applying this framework to flies with altered monocarboxylate\ntransporter 2 expression, we found that changes in ketone transport modified\nsleep stability and disrupted transitions between day and night sleep. In an\nAlzheimers disease model, metabolic interventions such as beta hydroxybutyrate\nsupplementation and intermittent fasting selectively influenced the timing of\nday to night transitions rather than uniformly altering sleep duration.\nAutoencoder based similarity scoring and wavelet analysis reinforced that\nmetabolic effects on sleep were highly time dependent. This study presents a\nnovel approach to studying sleep-metabolism interactions, revealing that\nmetabolic states exert their strongest influence at distinct time points,\nshaping sleep stability and circadian transitions.",
      "pdf_url": "http://arxiv.org/pdf/2503.12330v1",
      "arxiv_url": "http://arxiv.org/abs/2503.12330v1",
      "published": "2025-03-16",
      "categories": [
        "q-bio.QM",
        "q-bio.GN",
        "q-bio.NC"
      ]
    },
    {
      "title": "Vamba: Understanding Hour-Long Videos with Hybrid Mamba-Transformers",
      "authors": [
        "Weiming Ren",
        "Wentao Ma",
        "Huan Yang",
        "Cong Wei",
        "Ge Zhang",
        "Wenhu Chen"
      ],
      "abstract": "State-of-the-art transformer-based large multimodal models (LMMs) struggle to\nhandle hour-long video inputs due to the quadratic complexity of the causal\nself-attention operations, leading to high computational costs during training\nand inference. Existing token compression-based methods reduce the number of\nvideo tokens but often incur information loss and remain inefficient for\nextremely long sequences. In this paper, we explore an orthogonal direction to\nbuild a hybrid Mamba-Transformer model (VAMBA) that employs Mamba-2 blocks to\nencode video tokens with linear complexity. Without any token reduction, VAMBA\ncan encode more than 1024 frames (640$\\times$360) on a single GPU, while\ntransformer-based models can only encode 256 frames. On long video input, VAMBA\nachieves at least 50% reduction in GPU memory usage during training and\ninference, and nearly doubles the speed per training step compared to\ntransformer-based LMMs. Our experimental results demonstrate that VAMBA\nimproves accuracy by 4.3% on the challenging hour-long video understanding\nbenchmark LVBench over prior efficient video LMMs, and maintains strong\nperformance on a broad spectrum of long and short video understanding tasks.",
      "pdf_url": "http://arxiv.org/pdf/2503.11579v1",
      "arxiv_url": "http://arxiv.org/abs/2503.11579v1",
      "published": "2025-03-14",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "Difference-in-Differences Meets Synthetic Control: Doubly Robust Identification and Estimation",
      "authors": [
        "Yixiao Sun",
        "Haitian Xie",
        "Yuhang Zhang"
      ],
      "abstract": "Difference-in-Differences (DiD) and Synthetic Control (SC) are widely used\nmethods for causal inference in panel data, each with its own strengths and\nlimitations. In this paper, we propose a novel methodology that integrates the\nadvantages of both DiD and SC approaches. Our integrated approach provides a\ndoubly robust identification strategy for causal effects in panel data with a\ngroup structure, identifying the average treatment effect on the treated (ATT)\nunder either the parallel trends assumption or the group-level SC assumption.\nBuilding on this identification result, we develop a unified semiparametric\nframework for estimating the ATT. Notably, while the identification-robust\nmoment function satisfies Neyman orthogonality under the parallel trends\nassumption, it does not under the SC assumption, leading to different\nasymptotic variances under these two identification strategies. To address this\nchallenge, we propose a multiplier bootstrap method that consistently\napproximates the asymptotic distribution, regardless of which identification\nassumption holds. Furthermore, we extend our methodology to accommodate\nrepeated cross-sectional data and staggered treatment designs. As an empirical\napplication, we apply our method to evaluate the impact of the 2003 minimum\nwage increase in Alaska on family income.",
      "pdf_url": "http://arxiv.org/pdf/2503.11375v1",
      "arxiv_url": "http://arxiv.org/abs/2503.11375v1",
      "published": "2025-03-14",
      "categories": [
        "econ.EM"
      ]
    }
  ]
}