{
  "last_updated": "2025-10-31T00:52:59.410326",
  "papers": [
    {
      "title": "GReF: A Unified Generative Framework for Efficient Reranking via Ordered Multi-token Prediction",
      "authors": [
        "Zhijie Lin",
        "Zhuofeng Li",
        "Chenglei Dai",
        "Wentian Bao",
        "Shuai Lin",
        "Enyun Yu",
        "Haoxiang Zhang",
        "Liang Zhao"
      ],
      "abstract": "In a multi-stage recommendation system, reranking plays a crucial role in\nmodeling intra-list correlations among items. A key challenge lies in exploring\noptimal sequences within the combinatorial space of permutations. Recent\nresearch follows a two-stage (generator-evaluator) paradigm, where a generator\nproduces multiple feasible sequences, and an evaluator selects the best one. In\npractice, the generator is typically implemented as an autoregressive model.\nHowever, these two-stage methods face two main challenges. First, the\nseparation of the generator and evaluator hinders end-to-end training. Second,\nautoregressive generators suffer from inference efficiency. In this work, we\npropose a Unified Generative Efficient Reranking Framework (GReF) to address\nthe two primary challenges. Specifically, we introduce Gen-Reranker, an\nautoregressive generator featuring a bidirectional encoder and a dynamic\nautoregressive decoder to generate causal reranking sequences. Subsequently, we\npre-train Gen-Reranker on the item exposure order for high-quality parameter\ninitialization. To eliminate the need for the evaluator while integrating\nsequence-level evaluation during training for end-to-end optimization, we\npropose post-training the model through Rerank-DPO. Moreover, for efficient\nautoregressive inference, we introduce ordered multi-token prediction (OMTP),\nwhich trains Gen-Reranker to simultaneously generate multiple future items\nwhile preserving their order, ensuring practical deployment in real-time\nrecommender systems. Extensive offline experiments demonstrate that GReF\noutperforms state-of-the-art reranking methods while achieving latency that is\nnearly comparable to non-autoregressive models. Additionally, GReF has also\nbeen deployed in a real-world video app Kuaishou with over 300 million daily\nactive users, significantly improving online recommendation quality.",
      "pdf_url": "http://arxiv.org/pdf/2510.25220v1",
      "arxiv_url": "http://arxiv.org/abs/2510.25220v1",
      "published": "2025-10-29",
      "categories": [
        "cs.IR",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Bidirectional yet asymmetric causality between urban systems and traffic dynamics in 30 cities worldwide",
      "authors": [
        "Yatao Zhang",
        "Ye Hong",
        "Song Gao",
        "Martin Raubal"
      ],
      "abstract": "Understanding how urban systems and traffic dynamics co-evolve is crucial for\nadvancing sustainable and resilient cities. However, their bidirectional causal\nrelationships remain underexplored due to challenges of simultaneously\ninferring spatial heterogeneity, temporal variation, and feedback mechanisms.\nTo address this gap, we propose a novel spatio-temporal causality framework\nthat bridges correlation and causation by integrating spatio-temporal weighted\nregression with a newly developed spatio-temporal convergent cross-mapping\napproach. Characterizing cities through urban structure, form, and function,\nthe framework uncovers bidirectional causal patterns between urban systems and\ntraffic dynamics across 30 cities on six continents. Our findings reveal\nasymmetric bidirectional causality, with urban systems exerting stronger\ninfluences on traffic dynamics than the reverse in most cities. Urban form and\nfunction shape mobility more profoundly than structure, even though structure\noften exhibits higher correlations, as observed in cities such as Singapore,\nNew Delhi, London, Chicago, and Moscow. This does not preclude the reversed\ncausal direction, whereby long-established mobility patterns can also reshape\nthe built environment over time. Finally, we identify three distinct causal\narchetypes: tightly coupled, pattern-heterogeneous, and workday-attenuated,\nwhich map pathways from causal diagnosis to intervention. This typology\nsupports city-to-city learning and lays a foundation for context-sensitive\nstrategies in sustainable urban and transport planning.",
      "pdf_url": "http://arxiv.org/pdf/2510.25155v1",
      "arxiv_url": "http://arxiv.org/abs/2510.25155v1",
      "published": "2025-10-29",
      "categories": [
        "physics.soc-ph"
      ]
    },
    {
      "title": "An Analysis of Causal Effect Estimation using Outcome Invariant Data Augmentation",
      "authors": [
        "Uzair Akbar",
        "Niki Kilbertus",
        "Hao Shen",
        "Krikamol Muandet",
        "Bo Dai"
      ],
      "abstract": "The technique of data augmentation (DA) is often used in machine learning for\nregularization purposes to better generalize under i.i.d. settings. In this\nwork, we present a unifying framework with topics in causal inference to make a\ncase for the use of DA beyond just the i.i.d. setting, but for generalization\nacross interventions as well. Specifically, we argue that when the outcome\ngenerating mechanism is invariant to our choice of DA, then such augmentations\ncan effectively be thought of as interventions on the treatment generating\nmechanism itself. This can potentially help to reduce bias in causal effect\nestimation arising from hidden confounders. In the presence of such unobserved\nconfounding we typically make use of instrumental variables (IVs) -- sources of\ntreatment randomization that are conditionally independent of the outcome.\nHowever, IVs may not be as readily available as DA for many applications, which\nis the main motivation behind this work. By appropriately regularizing IV based\nestimators, we introduce the concept of IV-like (IVL) regression for mitigating\nconfounding bias and improving predictive performance across interventions even\nwhen certain IV properties are relaxed. Finally, we cast parameterized DA as an\nIVL regression problem and show that when used in composition can simulate a\nworst-case application of such DA, further improving performance on causal\nestimation and generalization tasks beyond what simple DA may offer. This is\nshown both theoretically for the population case and via simulation experiments\nfor the finite sample case using a simple linear example. We also present real\ndata experiments to support our case.",
      "pdf_url": "http://arxiv.org/pdf/2510.25128v1",
      "arxiv_url": "http://arxiv.org/abs/2510.25128v1",
      "published": "2025-10-29",
      "categories": [
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "Cyclic Counterfactuals under Shift-Scale Interventions",
      "authors": [
        "Saptarshi Saha",
        "Dhruv Vansraj Rathore",
        "Utpal Garain"
      ],
      "abstract": "Most counterfactual inference frameworks traditionally assume acyclic\nstructural causal models (SCMs), i.e. directed acyclic graphs (DAGs). However,\nmany real-world systems (e.g. biological systems) contain feedback loops or\ncyclic dependencies that violate acyclicity. In this work, we study\ncounterfactual inference in cyclic SCMs under shift-scale interventions, i.e.,\nsoft, policy-style changes that rescale and/or shift a variable's mechanism.",
      "pdf_url": "http://arxiv.org/pdf/2510.25005v1",
      "arxiv_url": "http://arxiv.org/abs/2510.25005v1",
      "published": "2025-10-28",
      "categories": [
        "cs.AI",
        "cs.LG",
        "math.ST",
        "stat.ML",
        "stat.TH"
      ]
    },
    {
      "title": "Machine-Learning-Assisted Comparison of Regression Functions",
      "authors": [
        "Jian Yan",
        "Zhuoxi Li",
        "Yang Ning",
        "Yong Chen"
      ],
      "abstract": "We revisit the classical problem of comparing regression functions, a\nfundamental question in statistical inference with broad relevance to modern\napplications such as data integration, transfer learning, and causal inference.\nExisting approaches typically rely on smoothing techniques and are thus\nhindered by the curse of dimensionality. We propose a generalized notion of\nkernel-based conditional mean dependence that provides a new characterization\nof the null hypothesis of equal regression functions. Building on this\nreformulation, we develop two novel tests that leverage modern machine learning\nmethods for flexible estimation. We establish the asymptotic properties of the\ntest statistics, which hold under both fixed- and high-dimensional regimes.\nUnlike existing methods that often require restrictive distributional\nassumptions, our framework only imposes mild moment conditions. The efficacy of\nthe proposed tests is demonstrated through extensive numerical studies.",
      "pdf_url": "http://arxiv.org/pdf/2510.24714v1",
      "arxiv_url": "http://arxiv.org/abs/2510.24714v1",
      "published": "2025-10-28",
      "categories": [
        "stat.ME",
        "econ.EM",
        "stat.ML"
      ]
    },
    {
      "title": "Decentralized Causal Discovery using Judo Calculus",
      "authors": [
        "Sridhar Mahadevan"
      ],
      "abstract": "We describe a theory and implementation of an intuitionistic decentralized\nframework for causal discovery using judo calculus, which is formally defined\nas j-stable causal inference using j-do-calculus in a topos of sheaves. In\nreal-world applications -- from biology to medicine and social science --\ncausal effects depend on regime (age, country, dose, genotype, or lab\nprotocol). Our proposed judo calculus formalizes this context dependence\nformally as local truth: a causal claim is proven true on a cover of regimes,\nnot everywhere at once. The Lawvere-Tierney modal operator j chooses which\nregimes are relevant; j-stability means the claim holds constructively and\nconsistently across that family. We describe an algorithmic and implementation\nframework for judo calculus, combining it with standard score-based,\nconstraint-based, and gradient-based causal discovery methods. We describe\nexperimental results on a range of domains, from synthetic to real-world\ndatasets from biology and economics. Our experimental results show the\ncomputational efficiency gained by the decentralized nature of sheaf-theoretic\ncausal discovery, as well as improved performance over classical causal\ndiscovery methods.",
      "pdf_url": "http://arxiv.org/pdf/2510.23942v1",
      "arxiv_url": "http://arxiv.org/abs/2510.23942v1",
      "published": "2025-10-27",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Group Interventions on Deep Networks for Causal Discovery in Subsystems",
      "authors": [
        "Wasim Ahmad",
        "Joachim Denzler",
        "Maha Shadaydeh"
      ],
      "abstract": "Causal discovery uncovers complex relationships between variables, enhancing\npredictions, decision-making, and insights into real-world systems, especially\nin nonlinear multivariate time series. However, most existing methods primarily\nfocus on pairwise cause-effect relationships, overlooking interactions among\ngroups of variables, i.e., subsystems and their collective causal influence. In\nthis study, we introduce gCDMI, a novel multi-group causal discovery method\nthat leverages group-level interventions on trained deep neural networks and\nemploys model invariance testing to infer causal relationships. Our approach\ninvolves three key steps. First, we use deep learning to jointly model the\nstructural relationships among groups of all time series. Second, we apply\ngroup-wise interventions to the trained model. Finally, we conduct model\ninvariance testing to determine the presence of causal links among variable\ngroups. We evaluate our method on simulated datasets, demonstrating its\nsuperior performance in identifying group-level causal relationships compared\nto existing methods. Additionally, we validate our approach on real-world\ndatasets, including brain networks and climate ecosystems. Our results\nhighlight that applying group-level interventions to deep learning models,\ncombined with invariance testing, can effectively reveal complex causal\nstructures, offering valuable insights for domains such as neuroscience and\nclimate science.",
      "pdf_url": "http://arxiv.org/pdf/2510.23906v2",
      "arxiv_url": "http://arxiv.org/abs/2510.23906v2",
      "published": "2025-10-27",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Control VAR: a counterfactual based approach to inference in macroeconomics",
      "authors": [
        "Raimondo Pala"
      ],
      "abstract": "This paper addresses the challenges of giving a causal interpretation to\nvector autoregressions (VARs). I show that under independence assumptions VARs\ncan identify average treatment effects, average causal responses, or a mix of\nthe two, depending on the distribution of the policy. But what about situations\nin which the economist cannot rely on independence assumptions? I propose an\nalternative method, defined as control-VAR, which uses control variables to\nestimate causal effects. Control-VAR can estimate average treatment effects on\nthe treated for dummy policies or average causal responses over time for\ncontinuous policies.\n  The advantages of control-based approaches are demonstrated by examining the\nimpact of natural disasters on the US economy, using Germany as a control.\nContrary to previous literature, the results indicate that natural disasters\nhave a negative economic impact without any cyclical positive effect. These\nfindings suggest that control-VARs provide a viable alternative to strict\nindependence assumptions, offering more credible causal estimates and\nsignificant implications for policy design in response to natural disasters.",
      "pdf_url": "http://arxiv.org/pdf/2510.23762v1",
      "arxiv_url": "http://arxiv.org/abs/2510.23762v1",
      "published": "2025-10-27",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "Game-TARS: Pretrained Foundation Models for Scalable Generalist Multimodal Game Agents",
      "authors": [
        "Zihao Wang",
        "Xujing Li",
        "Yining Ye",
        "Junjie Fang",
        "Haoming Wang",
        "Longxiang Liu",
        "Shihao Liang",
        "Junting Lu",
        "Zhiyong Wu",
        "Jiazhan Feng",
        "Wanjun Zhong",
        "Zili Li",
        "Yu Wang",
        "Yu Miao",
        "Bo Zhou",
        "Yuanfan Li",
        "Hao Wang",
        "Zhongkai Zhao",
        "Faming Wu",
        "Zhengxuan Jiang",
        "Weihao Tan",
        "Heyuan Yao",
        "Shi Yan",
        "Xiangyang Li",
        "Yitao Liang",
        "Yujia Qin",
        "Guang Shi"
      ],
      "abstract": "We present Game-TARS, a generalist game agent trained with a unified,\nscalable action space anchored to human-aligned native keyboard-mouse inputs.\nUnlike API- or GUI-based approaches, this paradigm enables large-scale\ncontinual pre-training across heterogeneous domains, including OS, web, and\nsimulation games. Game-TARS is pre-trained on over 500B tokens with diverse\ntrajectories and multimodal data. Key techniques include a decaying continual\nloss to reduce causal confusion and an efficient Sparse-Thinking strategy that\nbalances reasoning depth and inference cost. Experiments show that Game-TARS\nachieves about 2 times the success rate over the previous sota model on\nopen-world Minecraft tasks, is close to the generality of fresh humans in\nunseen web 3d games, and outperforms GPT-5, Gemini-2.5-Pro, and Claude-4-Sonnet\nin FPS benchmarks. Scaling results on training-time and test-time confirm that\nthe unified action space sustains improvements when scaled to cross-game and\nmultimodal data. Our results demonstrate that simple, scalable action\nrepresentations combined with large-scale pre-training provide a promising path\ntoward generalist agents with broad computer-use abilities.",
      "pdf_url": "http://arxiv.org/pdf/2510.23691v1",
      "arxiv_url": "http://arxiv.org/abs/2510.23691v1",
      "published": "2025-10-27",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Causal Deep Q Network",
      "authors": [
        "Elouanes Khelifi",
        "Amir Saki",
        "Usef Faghihi"
      ],
      "abstract": "Deep Q Networks (DQN) have shown remarkable success in various reinforcement\nlearning tasks. However, their reliance on associative learning often leads to\nthe acquisition of spurious correlations, hindering their problem-solving\ncapabilities. In this paper, we introduce a novel approach to integrate causal\nprinciples into DQNs, leveraging the PEACE (Probabilistic Easy vAriational\nCausal Effect) formula for estimating causal effects. By incorporating causal\nreasoning during training, our proposed framework enhances the DQN's\nunderstanding of the underlying causal structure of the environment, thereby\nmitigating the influence of confounding factors and spurious correlations. We\ndemonstrate that integrating DQNs with causal capabilities significantly\nenhances their problem-solving capabilities without compromising performance.\nExperimental results on standard benchmark environments showcase that our\napproach outperforms conventional DQNs, highlighting the effectiveness of\ncausal reasoning in reinforcement learning. Overall, our work presents a\npromising avenue for advancing the capabilities of deep reinforcement learning\nagents through principled causal inference.",
      "pdf_url": "http://arxiv.org/pdf/2510.23424v1",
      "arxiv_url": "http://arxiv.org/abs/2510.23424v1",
      "published": "2025-10-27",
      "categories": [
        "cs.AI"
      ]
    }
  ]
}