{
  "last_updated": "2025-12-16T00:57:49.471056",
  "papers": [
    {
      "title": "Forest Kernel Balancing Weights: Outcome-Guided Features for Causal Inference",
      "authors": [
        "Andy A. Shen",
        "Eli Ben-Michael",
        "Avi Feller",
        "Luke Keele",
        "Jared Murray"
      ],
      "abstract": "While balancing covariates between groups is central for observational causal inference, selecting which features to balance remains a challenging problem. Kernel balancing is a promising approach that first estimates a kernel that captures similarity across units and then balances a (possibly low-dimensional) summary of that kernel, indirectly learning important features to balance. In this paper, we propose forest kernel balancing, which leverages the underappreciated fact that tree-based machine learning models, namely random forests and Bayesian additive regression trees (BART), implicitly estimate a kernel based on the co-occurrence of observations in the same terminal leaf node. Thus, even though the resulting kernel is solely a function of baseline features, the selected nonlinearities and other interactions are important for predicting the outcome -- and therefore are important for addressing confounding. Through simulations and applied illustrations, we show that forest kernel balancing leads to meaningful computational and statistical improvement relative to standard kernel methods, which do not incorporate outcome information when learning features.",
      "pdf_url": "https://arxiv.org/pdf/2512.11751v1",
      "arxiv_url": "http://arxiv.org/abs/2512.11751v1",
      "published": "2025-12-12",
      "categories": [
        "stat.ME",
        "stat.AP"
      ]
    },
    {
      "title": "Causal Inference in Energy Demand Prediction",
      "authors": [
        "Chutian Ma",
        "Grigorii Pomazkin",
        "Giacinto Paolo Saggese",
        "Paul Smith"
      ],
      "abstract": "Energy demand prediction is critical for grid operators, industrial energy\n  consumers, and service providers. Energy demand is influenced by multiple\n  factors, including weather conditions (e.g. temperature, humidity, wind\n  speed, solar radiation), and calendar information (e.g. hour of day and\n  month of year), which further affect daily work and life schedules. These\n  factors are causally interdependent, making the problem more complex than\n  simple correlation-based learning techniques satisfactorily allow for. We\n  propose a structural causal model that explains the causal relationship\n  between these variables. A full analysis is performed to validate our causal\n  beliefs, also revealing important insights consistent with prior studies.\n  For example, our causal model reveals that energy demand responds to\n  temperature fluctuations with season-dependent sensitivity. Additionally, we\n  find that energy demand exhibits lower variance in winter due to the\n  decoupling effect between temperature changes and daily activity patterns.\n  We then build a Bayesian model, which takes advantage of the causal insights\n  we learned as prior knowledge. The model is trained and tested on unseen\n  data and yields state-of-the-art performance in the form of a 3.84 percent MAPE on\n  the test set. The model also demonstrates strong robustness, as the\n  cross-validation across two years of data yields an average MAPE of 3.88 percent.",
      "pdf_url": "https://arxiv.org/pdf/2512.11653v1",
      "arxiv_url": "http://arxiv.org/abs/2512.11653v1",
      "published": "2025-12-12",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "JoyAvatar: Real-time and Infinite Audio-Driven Avatar Generation with Autoregressive Diffusion",
      "authors": [
        "Chaochao Li",
        "Ruikui Wang",
        "Liangbo Zhou",
        "Jinheng Feng",
        "Huaishao Luo",
        "Huan Zhang",
        "Youzheng Wu",
        "Xiaodong He"
      ],
      "abstract": "Existing DiT-based audio-driven avatar generation methods have achieved considerable progress, yet their broader application is constrained by limitations such as high computational overhead and the inability to synthesize long-duration videos. Autoregressive methods address this problem by applying block-wise autoregressive diffusion methods. However, these methods suffer from the problem of error accumulation and quality degradation. To address this, we propose JoyAvatar, an audio-driven autoregressive model capable of real-time inference and infinite-length video generation with the following contributions: (1) Progressive Step Bootstrapping (PSB), which allocates more denoising steps to initial frames to stabilize generation and reduce error accumulation; (2) Motion Condition Injection (MCI), enhancing temporal coherence by injecting noise-corrupted previous frames as motion condition; and (3) Unbounded RoPE via Cache-Resetting (URCR), enabling infinite-length generation through dynamic positional encoding. Our 1.3B-parameter causal model achieves 16 FPS on a single GPU and achieves competitive results in visual quality, temporal consistency, and lip synchronization.",
      "pdf_url": "https://arxiv.org/pdf/2512.11423v1",
      "arxiv_url": "http://arxiv.org/abs/2512.11423v1",
      "published": "2025-12-12",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "Causal Judge Evaluation: Calibrated Surrogate Metrics for LLM Systems",
      "authors": [
        "Eddie Landesberg"
      ],
      "abstract": "LLM-as-judge evaluation has become the de facto standard for scaling model assessment, but the practice is statistically unsound: uncalibrated scores can invert preferences, naive confidence intervals on uncalibrated scores achieve near-0% coverage, and importance-weighted estimators collapse under limited overlap despite high effective sample size (ESS). We introduce Causal Judge Evaluation (CJE), a framework that fixes all three failures. On n=4,961 Chatbot Arena prompts (after filtering from 5k), CJE achieves 99% pairwise ranking accuracy at full sample size (94% averaged across configurations), matching oracle quality, at 14x lower cost (for ranking 5 policies) by calibrating a 16x cheaper judge on just 5% oracle labels (~250 labels). CJE combines three components: (i) AutoCal-R, reward calibration via mean-preserving isotonic regression; (ii) SIMCal-W, weight stabilization via stacking of S-monotone candidates; and (iii) Oracle-Uncertainty Aware (OUA) inference that propagates calibration uncertainty into confidence intervals. We formalize the Coverage-Limited Efficiency (CLE) diagnostic, which explains why IPS-style estimators fail even when ESS exceeds 90%: the logger rarely visits regions where target policies concentrate. Key findings: SNIPS inverts rankings even with reward calibration (38% pairwise, negative Kendall's tau) due to weight instability; calibrated IPS remains near-random (47%) despite weight stabilization, consistent with CLE; OUA improves coverage from near-0% to ~86% (Direct) and ~96% (stacked-DR), where naive intervals severely under-cover.",
      "pdf_url": "https://arxiv.org/pdf/2512.11150v1",
      "arxiv_url": "http://arxiv.org/abs/2512.11150v1",
      "published": "2025-12-11",
      "categories": [
        "stat.ME",
        "stat.AP",
        "stat.ML"
      ]
    },
    {
      "title": "Topology Identification and Inference over Graphs",
      "authors": [
        "Gonzalo Mateos",
        "Yanning Shen",
        "Georgios B. Giannakis",
        "Ananthram Swami"
      ],
      "abstract": "Topology identification and inference of processes evolving over graphs arise in timely applications involving brain, transportation, financial, power, as well as social and information networks. This chapter provides an overview of graph topology identification and statistical inference methods for multidimensional relational data. Approaches for undirected links connecting graph nodes are outlined, going all the way from correlation metrics to covariance selection, and revealing ties with smooth signal priors. To account for directional (possibly causal) relations among nodal variables and address the limitations of linear time-invariant models in handling dynamic as well as nonlinear dependencies, a principled framework is surveyed to capture these complexities through judiciously selected kernels from a prescribed dictionary. Generalizations are also described via structural equations and vector autoregressions that can exploit attributes such as low rank, sparsity, acyclicity, and smoothness to model dynamic processes over possibly time-evolving topologies. It is argued that this approach supports both batch and online learning algorithms with convergence rate guarantees, is amenable to tensor (that is, multi-way array) formulations as well as decompositions that are well-suited for multidimensional network data, and can seamlessly leverage high-order statistical information.",
      "pdf_url": "https://arxiv.org/pdf/2512.10183v1",
      "arxiv_url": "http://arxiv.org/abs/2512.10183v1",
      "published": "2025-12-11",
      "categories": [
        "eess.SP",
        "cs.SI",
        "stat.ME",
        "stat.ML"
      ]
    },
    {
      "title": "Inference for Batched Adaptive Experiments",
      "authors": [
        "Jan Kemper",
        "Davud Rostam-Afschar"
      ],
      "abstract": "The advantages of adaptive experiments have led to their rapid adoption in economics, other fields, as well as among practitioners. However, adaptive experiments pose challenges for causal inference. This note suggests a BOLS (batched ordinary least squares) test statistic for inference of treatment effects in adaptive experiments. The statistic provides a precision-equalizing aggregation of per-period treatment-control differences under heteroskedasticity. The combined test statistic is a normalized average of heteroskedastic per-period z-statistics and can be used to construct asymptotically valid confidence intervals. We provide simulation results comparing rejection rates in the typical case with few treatment periods and few (or many) observations per batch.",
      "pdf_url": "https://arxiv.org/pdf/2512.10156v1",
      "arxiv_url": "http://arxiv.org/abs/2512.10156v1",
      "published": "2025-12-10",
      "categories": [
        "econ.EM",
        "cs.LG",
        "stat.ME"
      ]
    },
    {
      "title": "Rethinking Causal Discovery Through the Lens of Exchangeability",
      "authors": [
        "Tiago Brogueira",
        "Mário Figueiredo"
      ],
      "abstract": "Causal discovery methods have traditionally been developed under two distinct regimes: independent and identically distributed (i.i.d.) and timeseries data, each governed by separate modelling assumptions. In this paper, we argue that the i.i.d. setting can and should be reframed in terms of exchangeability, a strictly more general symmetry principle. We present the implications of this reframing, alongside two core arguments: (1) a conceptual argument, based on extending the dependency of experimental causal inference on exchangeability to causal discovery; and (2) an empirical argument, showing that many existing i.i.d. causal-discovery methods are predicated on exchangeability assumptions, and that the sole extensive widely-used real-world \"i.i.d.\" benchmark (the Tübingen dataset) consists mainly of exchangeable (and not i.i.d.) examples. Building on this insight, we introduce a novel synthetic dataset that enforces only the exchangeability assumption, without imposing the stronger i.i.d. assumption. We show that our exchangeable synthetic dataset mirrors the statistical structure of the real-world \"i.i.d.\" dataset more closely than all other i.i.d. synthetic datasets. Furthermore, we demonstrate the predictive capability of this dataset by proposing a neural-network-based causal-discovery algorithm trained exclusively on our synthetic dataset, and which performs similarly to other state-of-the-art i.i.d. methods on the real-world benchmark.",
      "pdf_url": "https://arxiv.org/pdf/2512.10152v1",
      "arxiv_url": "http://arxiv.org/abs/2512.10152v1",
      "published": "2025-12-10",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "Microfoundations and the Causal Interpretation of Price-Exposure Designs",
      "authors": [
        "Luca Moreno-Louzada",
        "Guilherme Figueira",
        "Pedro Picchetti"
      ],
      "abstract": "This paper studies regional exposure designs that use commodity prices as instruments to study local effects of aggregate shocks. Unlike standard shift share designs that leverage differential exposure to many shocks, the price exposure relies on exogenous variation from a single shock, leading to challenges for both identification and inference. We motivate the design using a multi sector labor model. Under the model and a potential outcomes framework, we characterize the 2SLS and TWFE estimands as weighted averages of region and sector specific effects plus contamination terms driven by the covariance structure of prices and by general-equilibrium output responses. We derive conditions under which these estimands have a clear causal interpretation and provide simple sensitivity analysis procedures for violations. Finally, we show that standard inference procedures suffer from an overrejection problem in price-exposure designs. We derive a new standard error estimator and show its desirable finite-sample properties through Monte Carlo simulations. In an application to gold mining and homicides in the Amazon, the price exposure standard errors are roughly twice as large as conventional clustered standard errors, making the main effect statistically insignificant.",
      "pdf_url": "https://arxiv.org/pdf/2512.10076v1",
      "arxiv_url": "http://arxiv.org/abs/2512.10076v1",
      "published": "2025-12-10",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "A Conversation with Mike West",
      "authors": [
        "Hedibert F. Lopes",
        "Filippo Ascolani"
      ],
      "abstract": "Mike West is currently the Arts & Sciences Distinguished Professor Emeritus of Statistics and Decision Sciences at Duke University. Mike's research in Bayesian analysis spans multiple interlinked areas: theory and methods of dynamic models in time series analysis, foundations of inference and decision analysis, multivariate and latent structure analysis, stochastic computation and optimisation, among others. Inter-disciplinary R&D has ranged across applications in commercial forecasting, dynamic networks, finance, econometrics, signal processing, climatology, systems biology, genomics and neuroscience, among other areas. Among Mike's currently active research areas are forecasting, causal prediction and decision analysis in business, economic policy and finance, as well as in personal decision making. Mike led the development of academic statistics at Duke University from 1990-2002, and has been broadly engaged in professional leadership elsewhere. He is past president of the International Society for Bayesian Analysis (ISBA), and has served in founding roles and as board member for several professional societies, national and international centres and institutes. Recipient of numerous awards, Mike has been active in research with various companies, banks, government agencies and academic centres, co-founder of a successful biotechnology company, and board member for several financial and IT companies. He has published 4 books, several edited volumes and over 200 papers. Mike has worked with many undergraduate and Master's research students, and as of 2025 has mentored around 65 primary PhD students and postdoctoral associates who moved to academic, industrial or governmental positions involving advanced statistical and data science research.",
      "pdf_url": "https://arxiv.org/pdf/2512.09790v1",
      "arxiv_url": "http://arxiv.org/abs/2512.09790v1",
      "published": "2025-12-10",
      "categories": [
        "stat.OT"
      ]
    },
    {
      "title": "Temporal Windows of Integration for Multisensory Wireless Systems as Enablers of Physical AI",
      "authors": [
        "Anup Mishra",
        "João Henrique Inacio de Souza",
        "Petar Popovski"
      ],
      "abstract": "Physical artificial intelligence (AI) refers to the AI that interacts with the physical world in real time. Similar to multisensory perception, Physical AI makes decisions based on multimodal updates from sensors and devices. Physical AI thus operates with a finite spatial footprint of its sensory tributaries. The multimodal updates traverse heterogeneous and unreliable paths, involving wireless links. Throughput or latency guarantees do not ensure correct decision-making, as misaligned, misordered, or stale inputs still yield wrong inferences. Preserving decision-time coherence hinges on three timing primitives at the network-application interface: (i) simultaneity, a short coincidence window that groups measurements as co-temporal, (ii) causality, path-wise delivery that never lets a consequence precede its precursor, and (iii) usefulness, a validity horizon that drops information too stale to influence the current action. In this work, we focus on usefulness and adopt temporal window of integration (TWI)-Causality: the TWI enforces decision-time usefulness by assuming path-wise causal consistency and cross-path simultaneity are handled upstream. We model end-to-end path delay as the sum of sensing/propagation, computation, and access/transmission latencies, and formulate network design as minimizing the validity horizon under a delivery reliability constraint. In effect, this calibrates delay-reliability budgets for a timing-aware system operating over sensors within a finite spatial footprint. The joint choice of horizon and per-path reliability is cast as a convex optimization problem, solved to global optimality to obtain the minimal horizon and per-path allocation of reliability. This is compared favourably to a benchmark based on uniform-after-threshold allocation. Overall, this study contributes to timing-aware Physical AI in next-generation networks.",
      "pdf_url": "https://arxiv.org/pdf/2512.09589v1",
      "arxiv_url": "http://arxiv.org/abs/2512.09589v1",
      "published": "2025-12-10",
      "categories": [
        "eess.SP"
      ]
    }
  ]
}