{
  "last_updated": "2026-02-05T01:09:11.151373",
  "papers": [
    {
      "title": "Causal Inference for the Effect of Code Coverage on Bug Introduction",
      "authors": [
        "Lukas Schulte",
        "Gordon Fraser",
        "Steffen Herbold"
      ],
      "abstract": "Context: Code coverage is widely used as a software quality assurance measure. However, its effect, and specifically the advisable dose, are disputed in both the research and engineering communities. Prior work reports only correlational associations, leaving results vulnerable to confounding factors. Objective: We aim to quantify the causal effect of code coverage (exposure) on bug introduction (outcome) in the context of mature JavaScript and TypeScript open source projects, addressing both the overall effect and its variance across coverage levels. Method: We construct a causal directed acyclic graph to identify confounders within the software engineering process, modeling key variables from the source code, issue- and review systems, and continuous integration. Using generalized propensity score adjustment, we will apply doubly robust regression-based causal inference for continuous exposure to a novel dataset of bug-introducing and non-bug-introducing changes. We estimate the average treatment effect and dose-response relationship to examine potential non-linear patterns (e.g., thresholds or diminishing returns) within the projects of our dataset.",
      "pdf_url": "https://arxiv.org/pdf/2602.03585v1",
      "arxiv_url": "http://arxiv.org/abs/2602.03585v1",
      "published": "2026-02-03",
      "categories": [
        "cs.SE"
      ]
    },
    {
      "title": "Causal Inference on Networks under Misspecified Exposure Mappings: A Partial Identification Framework",
      "authors": [
        "Maresa Schröder",
        "Miruna Oprescu",
        "Stefan Feuerriegel",
        "Nathan Kallus"
      ],
      "abstract": "Estimating treatment effects in networks is challenging, as each potential outcome depends on the treatments of all other nodes in the network. To overcome this difficulty, existing methods typically impose an exposure mapping that compresses the treatment assignments in the network into a low-dimensional summary. However, if this mapping is misspecified, standard estimators for direct and spillover effects can be severely biased. We propose a novel partial identification framework for causal inference on networks to assess the robustness of treatment effects under misspecifications of the exposure mapping. Specifically, we derive sharp upper and lower bounds on direct and spillover effects under such misspecifications. As such, our framework presents a novel application of causal sensitivity analysis to exposure mappings. We instantiate our framework for three canonical exposure settings widely used in practice: (i) weighted means of the neighborhood treatments, (ii) threshold-based exposure mappings, and (iii) truncated neighborhood interference in the presence of higher-order spillovers. Furthermore, we develop orthogonal estimators for these bounds and prove that the resulting bound estimates are valid, sharp, and efficient. Our experiments show the bounds remain informative and provide reliable conclusions under misspecification of exposure mappings.",
      "pdf_url": "https://arxiv.org/pdf/2602.03459v1",
      "arxiv_url": "http://arxiv.org/abs/2602.03459v1",
      "published": "2026-02-03",
      "categories": [
        "cs.LG",
        "stat.ME"
      ]
    },
    {
      "title": "Causal structures of turbulent skin-friction drag in wall-bounded turbulent flows",
      "authors": [
        "Yunchao Zhao",
        "Yitong Fan",
        "Weipeng Li"
      ],
      "abstract": "Understanding the mechanism of turbulent skin-friction drag (TSD) generation is of fundamental and practical importance for designing effective drag reduction strategies. However, many previous studies adopted correlation analysis to reveal the causal map between turbulent motions and TSD generation, an approach that is potentially risky as correlation does not necessarily imply causation. In this study, a novel causal inference method called Liang-Kleeman information flow (LKIF) is utilized for the first time to identify the velocity-induced causal structures related to TSD generation in a turbulent channel flow. The statistical properties of the causal structures are comprehensively investigated. The positive and negative causal structures, defined by their signs and respectively associated with an increase and decrease in TSD information entropy, promote and suppress the generation of extreme TSD. Particularly, we find that the underlying physics of causal structures is essentially associated with the processes of streamwise streaks and rolls approaching or receding from the extreme events. Results indicate that the physics-informed LKIF framework can reveal a more explicit and interpretable causal relationship than correlation analysis.",
      "pdf_url": "https://arxiv.org/pdf/2602.03187v1",
      "arxiv_url": "http://arxiv.org/abs/2602.03187v1",
      "published": "2026-02-03",
      "categories": [
        "physics.flu-dyn"
      ]
    },
    {
      "title": "The Trigger in the Haystack: Extracting and Reconstructing LLM Backdoor Triggers",
      "authors": [
        "Blake Bullwinkel",
        "Giorgio Severi",
        "Keegan Hines",
        "Amanda Minnich",
        "Ram Shankar Siva Kumar",
        "Yonatan Zunger"
      ],
      "abstract": "Detecting whether a model has been poisoned is a longstanding problem in AI security. In this work, we present a practical scanner for identifying sleeper agent-style backdoors in causal language models. Our approach relies on two key findings: first, sleeper agents tend to memorize poisoning data, making it possible to leak backdoor examples using memory extraction techniques. Second, poisoned LLMs exhibit distinctive patterns in their output distributions and attention heads when backdoor triggers are present in the input. Guided by these observations, we develop a scalable backdoor scanning methodology that assumes no prior knowledge of the trigger or target behavior and requires only inference operations. Our scanner integrates naturally into broader defensive strategies and does not alter model performance. We show that our method recovers working triggers across multiple backdoor scenarios and a broad range of models and fine-tuning methods.",
      "pdf_url": "https://arxiv.org/pdf/2602.03085v1",
      "arxiv_url": "http://arxiv.org/abs/2602.03085v1",
      "published": "2026-02-03",
      "categories": [
        "cs.CR",
        "cs.AI"
      ]
    },
    {
      "title": "Membership Inference Attacks from Causal Principles",
      "authors": [
        "Mathieu Even",
        "Clément Berenfeld",
        "Linus Bleistein",
        "Tudor Cebere",
        "Julie Josse",
        "Aurélien Bellet"
      ],
      "abstract": "Membership Inference Attacks (MIAs) are widely used to quantify training data memorization and assess privacy risks. Standard evaluation requires repeated retraining, which is computationally costly for large models. One-run methods (single training with randomized data inclusion) and zero-run methods (post hoc evaluation) are often used instead, though their statistical validity remains unclear. To address this gap, we frame MIA evaluation as a causal inference problem, defining memorization as the causal effect of including a data point in the training set. This novel formulation reveals and formalizes key sources of bias in existing protocols: one-run methods suffer from interference between jointly included points, while zero-run evaluations popular for LLMs are confounded by non-random membership assignment. We derive causal analogues of standard MIA metrics and propose practical estimators for multi-run, one-run, and zero-run regimes with non-asymptotic consistency guarantees. Experiments on real-world data show that our approach enables reliable memorization measurement even when retraining is impractical and under distribution shift, providing a principled foundation for privacy evaluation in modern AI systems.",
      "pdf_url": "https://arxiv.org/pdf/2602.02819v1",
      "arxiv_url": "http://arxiv.org/abs/2602.02819v1",
      "published": "2026-02-02",
      "categories": [
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "Disentangling spatial interference and spatial confounding biases in causal inference",
      "authors": [
        "Isqeel Ogunsola",
        "Olatunji Johnson"
      ],
      "abstract": "Spatial interference and spatial confounding are two major issues inhibiting precise causal estimates when dealing with observational spatial data. Moreover, the definition and interpretation of spatial confounding remain arguable in the literature. In this paper, our goal is to provide clarity in a novel way on misconception and issues around spatial confounding from Directed Acyclic Graph (DAG) perspective and to disentangle both direct, indirect spatial confounding and spatial interference based on bias induced on causal estimates. Also, existing analyses of spatial confounding bias typically rely on Normality assumptions for treatments and confounders, assumptions that are often violated in practice. Relaxing these assumptions, we derive analytical expressions for spatial confounding bias under more general distributional settings using Poisson as example . We showed that the choice of spatial weights, the distribution of the treatment, and the magnitude of interference critically determine the extent of bias due to spatial interference. We further demonstrate that direct and indirect spatial confounding can be disentangled, with both the weight matrix and the nature of exposure playing central roles in determining the magnitude of indirect bias. Theoretical results are supported by simulation studies and an application to real-world spatial data. In future, parametric frameworks for concomitantly adjusting for spatial interference, direct and indirect spatial confounding for both direct and mediated effects estimation will be developed.",
      "pdf_url": "https://arxiv.org/pdf/2602.02777v1",
      "arxiv_url": "http://arxiv.org/abs/2602.02777v1",
      "published": "2026-02-02",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "BinaryPPO: Efficient Policy Optimization for Binary Classification",
      "authors": [
        "Punya Syon Pandey",
        "Zhijing Jin"
      ],
      "abstract": "Supervised fine-tuning (SFT) is the standard approach for binary classification tasks such as toxicity detection, factuality verification, and causal inference. However, SFT often performs poorly in real-world settings with label noise, class imbalance, or sparse supervision. We introduce BinaryPPO, an offline reinforcement learning large language model (LLM) framework that reformulates binary classification as a reward maximization problem. Our method leverages a variant of Proximal Policy Optimization (PPO) with a confidence-weighted reward function that penalizes uncertain or incorrect predictions, enabling the model to learn robust decision policies from static datasets without online interaction. Across eight domain-specific benchmarks and multiple models with differing architectures, BinaryPPO improves accuracy by 40-60 percentage points, reaching up to 99%, substantially outperforming supervised baselines. We provide an in-depth analysis of the role of reward shaping, advantage scaling, and policy stability in enabling this improvement. Overall, we demonstrate that confidence-based reward design provides a robust alternative to SFT for binary classification. Our code is available at https://github.com/psyonp/BinaryPPO.",
      "pdf_url": "https://arxiv.org/pdf/2602.02708v1",
      "arxiv_url": "http://arxiv.org/abs/2602.02708v1",
      "published": "2026-02-02",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CL"
      ]
    },
    {
      "title": "Selective Information Borrowing for Region-Specific Treatment Effect Inference under Covariate Mismatch in Multi-Regional Clinical Trials",
      "authors": [
        "Chenxi Li",
        "Ke Zhu",
        "Shu Yang",
        "Xiaofei Wang"
      ],
      "abstract": "Multi-regional clinical trials (MRCTs) are central to global drug development, enabling evaluation of treatment effects across diverse populations. A key challenge is valid and efficient inference for a region-specific estimand when the target region is small and differs from auxiliary regions in baseline covariates or unmeasured factors. We adopt an estimand-based framework and focus on the region-specific average treatment effect (RSATE) in a prespecified target region, which is directly relevant to local regulatory decision-making. Cross-region differences can induce covariate shift, covariate mismatch, and outcome drift, potentially biasing information borrowing and invalidating RSATE inference. To address these issues, we develop a unified causal inference framework with selective information borrowing. First, we introduce an inverse-variance weighting estimator that combines a \"small-sample, rich-covariate\" target-only estimator with a \"large-sample, limited-covariate\" full-borrowing doubly robust estimator, maximizing efficiency under no outcome drift. Second, to accommodate outcome drift, we apply conformal prediction to assess patient-level comparability and adaptively select auxiliary-region patients for borrowing. Third, to ensure rigorous finite-sample inference, we employ a conditional randomization test with exact, model-free, selection-aware type I error control. Simulation studies show the proposed estimator improves efficiency, yielding 10-50% reductions in mean squared error and higher power relative to no-borrowing and full-borrowing approaches, while maintaining valid inference across diverse scenarios. An application to the POWER trial further demonstrates improved precision for RSATE estimation.",
      "pdf_url": "https://arxiv.org/pdf/2602.02703v1",
      "arxiv_url": "http://arxiv.org/abs/2602.02703v1",
      "published": "2026-02-02",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "C-kNN-LSH: A Nearest-Neighbor Algorithm for Sequential Counterfactual Inference",
      "authors": [
        "Jing Wang",
        "Jie Shen",
        "Qiaomin Xie",
        "Jeremy C Weiss"
      ],
      "abstract": "Estimating causal effects from longitudinal trajectories is central to understanding the progression of complex conditions and optimizing clinical decision-making, such as comorbidities and long COVID recovery. We introduce \\emph{C-kNN--LSH}, a nearest-neighbor framework for sequential causal inference designed to handle such high-dimensional, confounded situations. By utilizing locality-sensitive hashing, we efficiently identify ``clinical twins'' with similar covariate histories, enabling local estimation of conditional treatment effects across evolving disease states. To mitigate bias from irregular sampling and shifting patient recovery profiles, we integrate neighborhood estimator with a doubly-robust correction.\n  Theoretical analysis guarantees our estimator is consistent and second-order robust to nuisance error.\n  Evaluated on a real-world Long COVID cohort with 13,511 participants, \\emph{C-kNN-LSH} demonstrates superior performance in capturing recovery heterogeneity and estimating policy values compared to existing baselines.",
      "pdf_url": "https://arxiv.org/pdf/2602.02371v1",
      "arxiv_url": "http://arxiv.org/abs/2602.02371v1",
      "published": "2026-02-02",
      "categories": [
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "Causal Inference for Preprocessed Outcomes with an Application to Functional Connectivity",
      "authors": [
        "Zihang Wang",
        "Razieh Nabi",
        "Benjamin B. Risk"
      ],
      "abstract": "In biomedical research, repeated measurements within each subject are often processed to remove artifacts and unwanted sources of variation. The resulting data are used to construct derived outcomes that act as proxies for scientific outcomes that are not directly observable. Although intra-subject processing is widely used, its impact on inter-subject statistical inference has not been systematically studied, and a principled framework for causal analysis in this setting is lacking. In this article, we propose a semiparametric framework for causal inference with derived outcomes obtained after intra-subject processing. This framework applies to settings with a modular structure, where intra-subject analyses are conducted independently across subjects and are followed by inter-subject analyses based on parameters from the intra-subject stage. We develop multiply robust estimators of causal parameters under rate conditions on both intra-subject and inter-subject models, which allows the use of flexible machine learning. We specialize the framework to a mediation setting and focus on the natural direct effect. For high dimensional inference, we employ a step-down procedure that controls the exceedance rate of the false discovery proportion. Simulation studies demonstrate the superior performance of the proposed approach. We apply our method to estimate the impact of stimulant medication on brain connectivity in children with autism spectrum disorder.",
      "pdf_url": "https://arxiv.org/pdf/2602.02240v1",
      "arxiv_url": "http://arxiv.org/abs/2602.02240v1",
      "published": "2026-02-02",
      "categories": [
        "stat.ME",
        "stat.ML"
      ]
    }
  ]
}