{
  "last_updated": "2025-12-23T00:57:11.869755",
  "papers": [
    {
      "title": "Learning What to Write: Write-Gated KV for Efficient Long-Context Inference",
      "authors": [
        "Yen-Chieh Huang",
        "Rui Fang",
        "Ming-Syan Chen",
        "Pi-Cheng Hsiu"
      ],
      "abstract": "Long-context LLM inference is bottlenecked by the quadratic attention complexity and linear KV cache growth. Prior approaches mitigate this via post-hoc selection or eviction but overlook the root inefficiency: indiscriminate writing to persistent memory. In this paper, we formalize KV cache management as a causal system of three primitives: KV Admission, Selection, and Eviction. We instantiate KV Admission via Write-Gated KV, a lightweight mechanism that learns to predict token utility before it enters the cache. By filtering out low-utility states early to maintain a compact global cache alongside a sliding local cache, Write-Gated KV reduces memory usage by 46-57% and delivers 3.03-3.45$\\times$ prefill and 1.89-2.56$\\times$ decode speedups on Llama model with negligible accuracy loss, all while remaining compatible with FlashAttention and paged-KV systems. These results demonstrate that learning what to write, is a principled and practical recipe for efficient long-context inference. Code is available at https://github.com/EMCLab-Sinica/WG-KV .",
      "pdf_url": "https://arxiv.org/pdf/2512.17452v1",
      "arxiv_url": "http://arxiv.org/abs/2512.17452v1",
      "published": "2025-12-19",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Kinetic-Theory Bounds on the Equation of State of Dense QCD Matter",
      "authors": [
        "Michał Marczenko"
      ],
      "abstract": "We derive bounds on the equation of state of cold, dense matter by extending the causal, model-agnostic interpolation between chiral effective field theory and perturbative calculations with a microscopic constraint from relativistic kinetic theory. The additional condition restricts the stiffest admissible behavior of the equation of state and systematically reduces the range of allowed equations of state, with the strongest effect at high densities. The resulting bounds remain consistent with known low- and high-density limits, while the strength of the constraint depends on the density above which the kinetic-theory condition is applied. These bounds can be readily incorporated into future studies of cold, dense matter and used to assess the impact of microscopic stability conditions on equation-of-state inference.",
      "pdf_url": "https://arxiv.org/pdf/2512.17410v1",
      "arxiv_url": "http://arxiv.org/abs/2512.17410v1",
      "published": "2025-12-19",
      "categories": [
        "nucl-th",
        "astro-ph.HE"
      ]
    },
    {
      "title": "Piezo1 Decodes Mechanical Forces via Allosteric Network Reprogramming",
      "authors": [
        "Yuling Zhang",
        "Lei Kang",
        "Yancong Zhang",
        "Guohui Hu"
      ],
      "abstract": "Understanding how molecular machines transduce mechanical force into chemical signals is a central goal in chemistry. The mechanosensitive ion channel Piezo1 is an archetypal nanoscale mechanotransducer, but the molecular principles by which it decodes distinct mechanical stimuli remain elusive. Here, we combine large-scale molecular dynamics simulations with time-series causal inference to elucidate the dynamic allosteric communication networks within Piezo1 under both quasi-static membrane tension and shockwave-induced cavitation. Under tangential tension, Piezo1 employs the lever-like pathway, a linear, feed-forward pathway propagating the signal from peripheral mechanophores to the central pore. In contrast, a shockwave impulse in the normal direction triggers a two-stage gating mechanism based on the dynamic reprogramming of the allosteric network. An initial compression phase activates an apical shortcut pathway originating from the cap domain. A subsequent tension phase utilizes a rewired network with complex feedback loops to drive the channel to a fully open state. These findings reveal that the allosteric wiring of a molecular machine is not static but can be dynamically reconfigured by the nature of the physical input. This principle of force-dependent pathway selection offers a new framework for understanding mechanochemistry and for designing programmable, stimuli-responsive molecular systems.",
      "pdf_url": "https://arxiv.org/pdf/2512.17403v1",
      "arxiv_url": "http://arxiv.org/abs/2512.17403v1",
      "published": "2025-12-19",
      "categories": [
        "q-bio.MN"
      ]
    },
    {
      "title": "Sharp Structure-Agnostic Lower Bounds for General Functional Estimation",
      "authors": [
        "Jikai Jin",
        "Vasilis Syrgkanis"
      ],
      "abstract": "The design of efficient nonparametric estimators has long been a central problem in statistics, machine learning, and decision making. Classical optimal procedures often rely on strong structural assumptions, which can be misspecified in practice and complicate deployment. This limitation has sparked growing interest in structure-agnostic approaches -- methods that debias black-box nuisance estimates without imposing structural priors. Understanding the fundamental limits of these methods is therefore crucial. This paper provides a systematic investigation of the optimal error rates achievable by structure-agnostic estimators. We first show that, for estimating the average treatment effect (ATE), a central parameter in causal inference, doubly robust learning attains optimal structure-agnostic error rates. We then extend our analysis to a general class of functionals that depend on unknown nuisance functions and establish the structure-agnostic optimality of debiased/double machine learning (DML). We distinguish two regimes -- one where double robustness is attainable and one where it is not -- leading to different optimal rates for first-order debiasing, and show that DML is optimal in both regimes. Finally, we instantiate our general lower bounds by deriving explicit optimal rates that recover existing results and extend to additional estimands of interest. Our results provide theoretical validation for widely used first-order debiasing methods and guidance for practitioners seeking optimal approaches in the absence of structural assumptions. This paper generalizes and subsumes the ATE lower bound established in \\citet{jin2024structure} by the same authors.",
      "pdf_url": "https://arxiv.org/pdf/2512.17341v1",
      "arxiv_url": "http://arxiv.org/abs/2512.17341v1",
      "published": "2025-12-19",
      "categories": [
        "stat.ML",
        "cs.LG",
        "econ.EM",
        "math.ST",
        "stat.ME"
      ]
    },
    {
      "title": "A Synthetic Instrumental Variable Method: Using the Dual Tendency Condition for Coplanar Instruments",
      "authors": [
        "Ratbek Dzhumashev",
        "Ainura Tursunalieva"
      ],
      "abstract": "Traditional instrumental variable (IV) methods often struggle with weak or invalid instruments and rely heavily on external data. We introduce a Synthetic Instrumental Variable (SIV) approach that constructs valid instruments using only existing data. Our method leverages a data-driven dual tendency (DT) condition to identify valid instruments without requiring external variables. SIV is robust to heteroscedasticity and can determine the true sign of the correlation between endogenous regressors and errors--an assumption typically imposed in empirical work. Through simulations and real-world applications, we show that SIV improves causal inference by mitigating common IV limitations and reducing dependence on scarce instruments. This approach has broad implications for economics, epidemiology, and policy evaluation.",
      "pdf_url": "https://arxiv.org/pdf/2512.17301v1",
      "arxiv_url": "http://arxiv.org/abs/2512.17301v1",
      "published": "2025-12-19",
      "categories": [
        "stat.ME",
        "math.ST"
      ]
    },
    {
      "title": "Identification and efficient estimation of compliance and network causal effects in cluster-randomized trials",
      "authors": [
        "Chao Cheng",
        "Georgia Papadogeorgou",
        "Fan Li"
      ],
      "abstract": "Treatment noncompliance is pervasive in infectious disease cluster-randomized trials. Although all individuals within a cluster are assigned the same treatment condition, the treatment uptake status may vary across individuals due to noncompliance. We propose a semiparametric framework to evaluate the individual compliance effect and network assignment effect within principal stratum exhibiting different patterns of noncompliance. The individual compliance effect captures the portion of the treatment effect attributable to changes in treatment receipt, while the network assignment effect reflects the pure impact of treatment assignment and spillover among individuals within the same cluster. Unlike prior efforts which either empirically identify or interval identify these estimands, we characterize new structural assumptions for nonparametric point identification. We then develop semiparametrically efficient estimators that combine data-adaptive machine learning methods with efficient influence functions to enable more robust inference. Additionally, we introduce sensitivity analysis methods to study the impact under assumption violations, and apply the proposed methods to reanalyze a cluster-randomized trial in Kenya that evaluated the impact of school-based mass deworming on disease transmission.",
      "pdf_url": "https://arxiv.org/pdf/2512.16857v1",
      "arxiv_url": "http://arxiv.org/abs/2512.16857v1",
      "published": "2025-12-18",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Quantile-based causal inference for spatio-temporal processes: Assessing the impacts of wildfires on US air quality",
      "authors": [
        "Zipei Geng",
        "Jordan Richards",
        "Raphael Huser",
        "Marc G. Genton"
      ],
      "abstract": "Wildfires pose an increasingly severe threat to air quality, yet quantifying their causal impact remains challenging due to unmeasured meteorological and geographic confounders. Moreover, wildfire impacts on air quality may exhibit heterogeneous effects across pollution levels, which conventional mean-based causal methods fail to capture. To address these challenges, we develop a Quantile-based Latent Spatial Confounder Model (QLSCM) that substitutes conditional expectations with conditional quantiles, enabling causal analysis across the entire outcome distribution. We establish the causal interpretation of QLSCM theoretically, prove the identifiability of causal effects, and demonstrate estimator consistency under mild conditions. Simulations confirm the bias correction capability and the advantage of quantile-based inference over mean-based approaches. Applying our method to contiguous US wildfire and air quality data, we uncover important heterogeneous effects: fire radiative power exerts significant positive causal effects on aerosol optical depth at high quantiles in Western states like California and Oregon, while insignificant at lower quantiles. This indicates that wildfire impacts on air quality primarily manifest during extreme pollution events. Regional analyses reveal that Western and Northwestern regions experience the strongest causal effects during such extremes. These findings provide critical insights for environmental policy by identifying where and when mitigation efforts would be most effective.",
      "pdf_url": "https://arxiv.org/pdf/2512.16603v1",
      "arxiv_url": "http://arxiv.org/abs/2512.16603v1",
      "published": "2025-12-18",
      "categories": [
        "stat.AP"
      ]
    },
    {
      "title": "ARMFlow: AutoRegressive MeanFlow for Online 3D Human Reaction Generation",
      "authors": [
        "Zichen Geng",
        "Zeeshan Hayder",
        "Wei Liu",
        "Hesheng Wang",
        "Ajmal Mian"
      ],
      "abstract": "3D human reaction generation faces three main challenges:(1) high motion fidelity, (2) real-time inference, and (3) autoregressive adaptability for online scenarios. Existing methods fail to meet all three simultaneously. We propose ARMFlow, a MeanFlow-based autoregressive framework that models temporal dependencies between actor and reactor motions. It consists of a causal context encoder and an MLP-based velocity predictor. We introduce Bootstrap Contextual Encoding (BSCE) in training, encoding generated history instead of the ground-truth ones, to alleviate error accumulation in autoregressive generation. We further introduce the offline variant ReMFlow, achieving state-of-the-art performance with the fastest inference among offline methods. Our ARMFlow addresses key limitations of online settings by: (1) enhancing semantic alignment via a global contextual encoder; (2) achieving high accuracy and low latency in a single-step inference; and (3) reducing accumulated errors through BSCE. Our single-step online generation surpasses existing online methods on InterHuman and InterX by over 40% in FID, while matching offline state-of-the-art performance despite using only partial sequence conditions.",
      "pdf_url": "https://arxiv.org/pdf/2512.16234v1",
      "arxiv_url": "http://arxiv.org/abs/2512.16234v1",
      "published": "2025-12-18",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "BUILD with Precision: Bottom-Up Inference of Linear DAGs",
      "authors": [
        "Hamed Ajorlou",
        "Samuel Rey",
        "Gonzalo Mateos",
        "Geert Leus",
        "Antonio G. Marques"
      ],
      "abstract": "Learning the structure of directed acyclic graphs (DAGs) from observational data is a central problem in causal discovery, statistical signal processing, and machine learning. Under a linear Gaussian structural equation model (SEM) with equal noise variances, the problem is identifiable and we show that the ensemble precision matrix of the observations exhibits a distinctive structure that facilitates DAG recovery. Exploiting this property, we propose BUILD (Bottom-Up Inference of Linear DAGs), a deterministic stepwise algorithm that identifies leaf nodes and their parents, then prunes the leaves by removing incident edges to proceed to the next step, exactly reconstructing the DAG from the true precision matrix. In practice, precision matrices must be estimated from finite data, and ill-conditioning may lead to error accumulation across BUILD steps. As a mitigation strategy, we periodically re-estimate the precision matrix (with less variables as leaves are pruned), trading off runtime for enhanced robustness. Reproducible results on challenging synthetic benchmarks demonstrate that BUILD compares favorably to state-of-the-art DAG learning algorithms, while offering an explicit handle on complexity.",
      "pdf_url": "https://arxiv.org/pdf/2512.16111v1",
      "arxiv_url": "http://arxiv.org/abs/2512.16111v1",
      "published": "2025-12-18",
      "categories": [
        "cs.LG",
        "eess.SP"
      ]
    },
    {
      "title": "CauSTream: Causal Spatio-Temporal Representation Learning for Streamflow Forecasting",
      "authors": [
        "Shu Wan",
        "Reepal Shah",
        "John Sabo",
        "Huan Liu",
        "K. Selçuk Candan"
      ],
      "abstract": "Streamflow forecasting is crucial for water resource management and risk mitigation. While deep learning models have achieved strong predictive performance, they often overlook underlying physical processes, limiting interpretability and generalization. Recent causal learning approaches address these issues by integrating domain knowledge, yet they typically rely on fixed causal graphs that fail to adapt to data. We propose CauStream, a unified framework for causal spatiotemporal streamflow forecasting. CauSTream jointly learns (i) a runoff causal graph among meteorological forcings and (ii) a routing graph capturing dynamic dependencies across stations. We further establish identifiability conditions for these causal structures under a nonparametric setting. We evaluate CauSTream on three major U.S. river basins across three forecasting horizons. The model consistently outperforms prior state-of-the-art methods, with performance gaps widening at longer forecast windows, indicating stronger generalization to unseen conditions. Beyond forecasting, CauSTream also learns causal graphs that capture relationships among hydrological factors and stations. The inferred structures align closely with established domain knowledge, offering interpretable insights into watershed dynamics. CauSTream offers a principled foundation for causal spatiotemporal modeling, with the potential to extend to a wide range of scientific and environmental applications.",
      "pdf_url": "https://arxiv.org/pdf/2512.16046v1",
      "arxiv_url": "http://arxiv.org/abs/2512.16046v1",
      "published": "2025-12-18",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CE",
        "stat.ML"
      ]
    }
  ]
}