{
  "last_updated": "2025-06-26T00:55:17.271935",
  "papers": [
    {
      "title": "Bayesian Evolutionary Swarm Architecture: A Formal Epistemic System Grounded in Truth-Based Competition",
      "authors": [
        "Craig Steven Wright"
      ],
      "abstract": "We introduce a mathematically rigorous framework for an artificial\nintelligence system composed of probabilistic agents evolving through\nstructured competition and belief revision. The architecture, grounded in\nBayesian inference, measure theory, and population dynamics, defines agent\nfitness as a function of alignment with a fixed external oracle representing\nground truth. Agents compete in a discrete-time environment, adjusting\nposterior beliefs through observed outcomes, with higher-rated agents\nreproducing and lower-rated agents undergoing extinction. Ratings are updated\nvia pairwise truth-aligned utility comparisons, and belief updates preserve\nmeasurable consistency and stochastic convergence. We introduce hash-based\ncryptographic identity commitments to ensure traceability, alongside causal\ninference operators using do-calculus. Formal theorems on convergence,\nrobustness, and evolutionary stability are provided. The system establishes\ntruth as an evolutionary attractor, demonstrating that verifiable knowledge\narises from adversarial epistemic pressure within a computable, self-regulating\nswarm.",
      "pdf_url": "http://arxiv.org/pdf/2506.19191v1",
      "arxiv_url": "http://arxiv.org/abs/2506.19191v1",
      "published": "2025-06-23",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.GT",
        "math.LO",
        "68T05, 68Q87, 03E20",
        "I.2.6; I.2.3; F.1.1"
      ]
    },
    {
      "title": "Inferring Diffusion Structures of Heterogeneous Network Cascade",
      "authors": [
        "Yubai Yuan",
        "Siyu Huang",
        "Abdul Basit Adeel"
      ],
      "abstract": "Network cascade refers to diffusion processes in which outcome changes within\npart of an interconnected population trigger a sequence of changes across the\nentire network. These cascades are governed by underlying diffusion networks,\nwhich are often latent. Inferring such networks is critical for understanding\ncascade pathways, uncovering Granger causality of interaction mechanisms among\nindividuals, and enabling tasks such as forecasting or maximizing information\npropagation. In this project, we propose a novel double mixture directed graph\nmodel for inferring multi-layer diffusion networks from cascade data. The\nproposed model represents cascade pathways as a mixture of diffusion networks\nacross different layers, effectively capturing the strong heterogeneity present\nin real-world cascades. Additionally, the model imposes layer-specific\nstructural constraints, enabling diffusion networks at different layers to\ncapture complementary cascading patterns at the population level. A key\nadvantage of our model is its convex formulation, which allows us to establish\nboth statistical and computational guarantees for the resulting diffusion\nnetwork estimates. We conduct extensive simulation studies to demonstrate the\nmodel's performance in recovering diverse diffusion structures. Finally, we\napply the proposed method to analyze cascades of research topics in the social\nsciences across U.S. universities, revealing the underlying diffusion networks\nof research topic propagation among institutions.",
      "pdf_url": "http://arxiv.org/pdf/2506.19142v1",
      "arxiv_url": "http://arxiv.org/abs/2506.19142v1",
      "published": "2025-06-23",
      "categories": [
        "cs.SI",
        "stat.ML"
      ]
    },
    {
      "title": "Principal stratification with recurrent events truncated by a terminal event: A nested Bayesian nonparametric approach",
      "authors": [
        "Yuki Ohnishi",
        "Michael O. Harhay",
        "Fan Li"
      ],
      "abstract": "Recurrent events often serve as key endpoints in clinical studies but may be\nprematurely truncated by terminal events such as death, creating selection bias\nand complicating causal inference. To address this challenge, we propose novel\ncausal estimands within the principal stratification framework, introducing a\nrefined ``always-survivor'' stratum that defines survival until the final\nrecurrent event rather than a fixed time point, yielding more stable and\ninterpretable causal contrasts. We develop a flexible Bayesian nonparametric\nprior -- the enriched dependent Dirichlet process -- specifically designed for\njoint modeling of recurrent and terminal events, addressing a critical\nlimitation where standard Dirichlet process priors create random partitions\ndominated by recurrent events, yielding poor predictive performance for\nterminal events. Our nested structure separates within-arm and cross-arm\ndependence through a dual-frailty framework, enabling transparent sensitivity\nanalysis for non-identifiable parameters. Simulations are carried out to show\nthat our method has superior performance compared to existing methods. We also\nillustrate the proposed Bayesian methods to infer the causal effect of\nintensive blood pressure control on recurrent cardiovascular events in a\ncardiovascular clinical trial.",
      "pdf_url": "http://arxiv.org/pdf/2506.19015v1",
      "arxiv_url": "http://arxiv.org/abs/2506.19015v1",
      "published": "2025-06-23",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Steering Conceptual Bias via Transformer Latent-Subspace Activation",
      "authors": [
        "Vansh Sharma",
        "Venkat Raman"
      ],
      "abstract": "This work examines whether activating latent subspaces in language models\n(LLMs) can steer scientific code generation toward a specific programming\nlanguage. Five causal LLMs were first evaluated on scientific coding prompts to\nquantify their baseline bias among four programming languages. A static\nneuron-attribution method, perturbing the highest activated MLP weight for a\nC++ or CPP token, proved brittle and exhibited limited generalization across\nprompt styles and model scales. To address these limitations, a\ngradient-refined adaptive activation steering framework (G-ACT) was developed:\nper-prompt activation differences are clustered into a small set of steering\ndirections, and lightweight per-layer probes are trained and refined online to\nselect the appropriate steering vector. In LLaMA-3.2 3B, this approach reliably\nbiases generation towards the CPP language by increasing the average probe\nclassification accuracy by 15% and the early layers (0-6) improving the probe\nclassification accuracy by 61.5% compared to the standard ACT framework. For\nLLaMA-3.3 70B, where attention-head signals become more diffuse, targeted\ninjections at key layers still improve language selection. Although per-layer\nprobing introduces a modest inference overhead, it remains practical by\nsteering only a subset of layers and enables reproducible model behavior. These\nresults demonstrate a scalable, interpretable and efficient mechanism for\nconcept-level control for practical agentic systems.",
      "pdf_url": "http://arxiv.org/pdf/2506.18887v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18887v1",
      "published": "2025-06-23",
      "categories": [
        "cs.AI",
        "cs.LG",
        "cs.SY",
        "eess.SY",
        "I.2.7; I.2.6; I.2.1; D.3.3; C.4"
      ]
    },
    {
      "title": "A Practical Introduction to Regression-based Causal Inference in Meteorology (I): All confounders measured",
      "authors": [
        "Caren Marzban",
        "Yikun Zhang",
        "Nicholas Bond",
        "Michael Richman"
      ],
      "abstract": "Whether a variable is the cause of another, or simply associated with it, is\noften an important scientific question. Causal Inference is the name associated\nwith the body of techniques for addressing that question in a statistical\nsetting. Although assessing causality is relatively straightforward in the\npresence of temporal information, outside of that setting - the situation\nconsidered here - it is more difficult to assess causal effects. The\ndevelopment of the field of causal inference has involved concepts from a wide\nrange of topics, thereby limiting its adoption across some fields, including\nmeteorology. However, at its core, the requisite knowledge for causal inference\ninvolves little more than basic probability theory and regression, topics\nfamiliar to most meteorologists. By focusing on these core areas, this and a\ncompanion article provide a steppingstone for the meteorology community into\nthe field of (non-temporal) causal inference. Although some theoretical\nfoundations are presented, the main goal is the application of a specific\nmethod, called matching, to a problem in meteorology. The data for the\napplication are in public domain, and R code is provided as well, forming an\neasy path for meteorology students and researchers to enter the field.",
      "pdf_url": "http://arxiv.org/pdf/2506.18808v2",
      "arxiv_url": "http://arxiv.org/abs/2506.18808v2",
      "published": "2025-06-23",
      "categories": [
        "stat.AP"
      ]
    },
    {
      "title": "Likelihood Ratio test for Poisson graph",
      "authors": [
        "Chen Shuyan",
        "Liu Xin",
        "Wang Shaoli"
      ],
      "abstract": "Directed acyclic graphs are widely used to describe the causal effects among\nrandom variables, and the inference of those causal effects has become an\npopular topic in statistics and machine learning, and has wide applications in\nneuroinformatics, bioinformatics and so on. However, most studies focus on the\nestimation or inference of the directional relations among continuous random\nvariables, those among discrete random variables have not gained much\nattentions. In this article we focus on the inference of directed linkages and\ndirected pathways in a Poisson directed graphical model. We employ likelihood\nratio tests subject to non-convex acyclicity constraints, and derive the\nasymptotic distributions of the test statistic under the null hypothesis is\ntrue in high-dimensional situations. The power analysis and simulations suggest\nthat the tests achieve the desired objectives of inference. An analysis of a\nbasketball statistics dataset of NBA players during 2016-2017 season\nillustrates the utility of the proposed method to infer directed linkages and\ndirected pathways in player's statistics network.",
      "pdf_url": "http://arxiv.org/pdf/2506.18778v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18778v1",
      "published": "2025-06-23",
      "categories": [
        "stat.ME",
        "math.ST",
        "stat.TH",
        "Primary: 62F03, Secondary: 62F30"
      ]
    },
    {
      "title": "Towards Group Fairness with Multiple Sensitive Attributes in Federated Foundation Models",
      "authors": [
        "Yuning Yang",
        "Han Yu",
        "Tianrun Gao",
        "Xiaodong Xu",
        "Guangyu Wang"
      ],
      "abstract": "The deep integration of foundation models (FM) with federated learning (FL)\nenhances personalization and scalability for diverse downstream tasks, making\nit crucial in sensitive domains like healthcare. Achieving group fairness has\nbecome an increasingly prominent issue in the era of federated foundation\nmodels (FFMs), since biases in sensitive attributes might lead to inequitable\ntreatment for under-represented demographic groups. Existing studies mostly\nfocus on achieving fairness with respect to a single sensitive attribute. This\nrenders them unable to provide clear interpretability of dependencies among\nmultiple sensitive attributes which is required to achieve group fairness. Our\npaper takes the first attempt towards a causal analysis of the relationship\nbetween group fairness across various sensitive attributes in the FFM. We\nextend the FFM structure to trade off multiple sensitive attributes\nsimultaneously and quantify the causal effect behind the group fairness through\ncausal discovery and inference. Extensive experiments validate its\neffectiveness, offering insights into interpretability towards building\ntrustworthy and fair FFM systems.",
      "pdf_url": "http://arxiv.org/pdf/2506.18732v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18732v1",
      "published": "2025-06-23",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "A Practical Introduction to Regression-based Causal Inference in Meteorology (II): Unmeasured confounders",
      "authors": [
        "Caren Marzban",
        "Yikun Zhang",
        "Nicholas Bond",
        "Michael Richman"
      ],
      "abstract": "One obstacle to ``elevating\" correlation to causation is the phenomenon of\nconfounding, i.e., when a correlation between two variables exists because both\nvariables are in fact caused by a third variable. The situation where the\nconfounders are measured is examined in an earlier, accompanying article. Here,\nit is shown that even when the confounding variables are not measured, it is\nstill possible to estimate the causal effect via a regression-based method that\nuses the notion of Instrumental Variables. Using meteorological data set,\nsimilar to that in the sister article, a number of different estimates of the\ncausal effect are compared and contrasted. It is shown that the Instrumental\nVariable results based on unmeasured confounders are consistent with those of\nthe sister article where confounders are measured.",
      "pdf_url": "http://arxiv.org/pdf/2506.18652v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18652v1",
      "published": "2025-06-23",
      "categories": [
        "stat.AP"
      ]
    },
    {
      "title": "T-CPDL: A Temporal Causal Probabilistic Description Logic for Developing Logic-RAG Agent",
      "authors": [
        "Hong Qing Yu"
      ],
      "abstract": "Large language models excel at generating fluent text but frequently struggle\nwith structured reasoning involving temporal constraints, causal relationships,\nand probabilistic reasoning. To address these limitations, we propose Temporal\nCausal Probabilistic Description Logic (T-CPDL), an integrated framework that\nextends traditional Description Logic with temporal interval operators,\nexplicit causal relationships, and probabilistic annotations. We present two\ndistinct variants of T-CPDL: one capturing qualitative temporal relationships\nthrough Allen's interval algebra, and another variant enriched with explicit\ntimestamped causal assertions. Both variants share a unified logical structure,\nenabling complex reasoning tasks ranging from simple temporal ordering to\nnuanced probabilistic causation. Empirical evaluations on temporal reasoning\nand causal inference benchmarks confirm that T-CPDL substantially improves\ninference accuracy, interpretability, and confidence calibration of language\nmodel outputs. By delivering transparent reasoning paths and fine-grained\ntemporal and causal semantics, T-CPDL significantly enhances the capability of\nlanguage models to support robust, explainable, and trustworthy\ndecision-making. This work also lays the groundwork for developing advanced\nLogic-Retrieval-Augmented Generation (Logic-RAG) frameworks, potentially\nboosting the reasoning capabilities and efficiency of knowledge graph-enhanced\nRAG systems.",
      "pdf_url": "http://arxiv.org/pdf/2506.18559v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18559v1",
      "published": "2025-06-23",
      "categories": [
        "cs.AI",
        "cs.LO",
        "I.2.7; F.4.1"
      ]
    },
    {
      "title": "Leveraging specificity for causal inference in observational studies",
      "authors": [
        "Wang Miao"
      ],
      "abstract": "Hill's specificity criterion has been highly influential in biomedical and\nepidemiological research. However, it remains controversial and its application\noften relies on subjective and qualitative analysis without a comprehensive and\nrigorous causal theory. Focusing on unmeasured confounding adjustment with\nmultiple treatments and multiple outcomes, this paper develops a formal and\nquantitative framework for leveraging specificity for causal inference in\nobservational studies. The proposed framework introduces a causal specificity\nassumption, a quantitative measure of specificity, a hypothesis testing\nprocedure, and identification and estimation strategies. Identification under a\nnonparametric outcome model is established. The causal specificity assumption\nconcerns only the breadth of causal associations, in contrast to Hill's\nspecificity that concerns observed associations and to existing confounding\nadjustment methods that rely on auxiliary variables (e.g., instrumental\nvariables, negative controls) or independence structures (e.g., factor models).\nA sensitivity analysis procedure is proposed to assess robustness of the test\nagainst violations of this assumption. This framework is particularly suited to\nexposure- and outcome-wide studies, where joint causal discovery across\nmultiple treatments and multiple outcomes is of interest. It also offers a\npotential tool for addressing other sources of bias, such as invalid\ninstruments in Mendelian randomization and selection bias in missing data\nanalysis.",
      "pdf_url": "http://arxiv.org/pdf/2506.18469v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18469v1",
      "published": "2025-06-23",
      "categories": [
        "stat.ME"
      ]
    }
  ]
}