{
  "last_updated": "2025-03-21T00:49:38.041231",
  "papers": [
    {
      "title": "World Models in Artificial Intelligence: Sensing, Learning, and Reasoning Like a Child",
      "authors": [
        "Javier Del Ser",
        "Jesus L. Lobo",
        "Heimo Müller",
        "Andreas Holzinger"
      ],
      "abstract": "World Models help Artificial Intelligence (AI) predict outcomes, reason about\nits environment, and guide decision-making. While widely used in reinforcement\nlearning, they lack the structured, adaptive representations that even young\nchildren intuitively develop. Advancing beyond pattern recognition requires\ndynamic, interpretable frameworks inspired by Piaget's cognitive development\ntheory. We highlight six key research areas -- physics-informed learning,\nneurosymbolic learning, continual learning, causal inference, human-in-the-loop\nAI, and responsible AI -- as essential for enabling true reasoning in AI. By\nintegrating statistical learning with advances in these areas, AI can evolve\nfrom pattern recognition to genuine understanding, adaptation and reasoning\ncapabilities.",
      "pdf_url": "http://arxiv.org/pdf/2503.15168v1",
      "arxiv_url": "http://arxiv.org/abs/2503.15168v1",
      "published": "2025-03-19",
      "categories": [
        "cs.AI",
        "cs.CV",
        "cs.ET",
        "cs.LG",
        "68T05"
      ]
    },
    {
      "title": "DeCaFlow: A Deconfounding Causal Generative Model",
      "authors": [
        "Alejandro Almodóvar",
        "Adrián Javaloy",
        "Juan Parras",
        "Santiago Zazo",
        "Isabel Valera"
      ],
      "abstract": "Causal generative models (CGMs) have recently emerged as capable approaches\nto simulate the causal mechanisms generating our observations, enabling causal\ninference. Unfortunately, existing approaches either are overly restrictive,\nassuming the absence of hidden confounders, or lack generality, being tailored\nto a particular query and graph. In this work, we introduce DeCaFlow, a CGM\nthat accounts for hidden confounders in a single amortized training process\nusing only observational data and the causal graph. Importantly, DeCaFlow can\nprovably identify all causal queries with a valid adjustment set or\nsufficiently informative proxy variables. Remarkably, for the first time to our\nknowledge, we show that a confounded counterfactual query is identifiable, and\nthus solvable by DeCaFlow, as long as its interventional counterpart is as\nwell. Our empirical results on diverse settings (including the Ecoli70 dataset,\nwith 3 independent hidden confounders, tens of observed variables and hundreds\nof causal queries) show that DeCaFlow outperforms existing approaches, while\ndemonstrating its out-of-the-box flexibility.",
      "pdf_url": "http://arxiv.org/pdf/2503.15114v1",
      "arxiv_url": "http://arxiv.org/abs/2503.15114v1",
      "published": "2025-03-19",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "The Hardness of Validating Observational Studies with Experimental Data",
      "authors": [
        "Jake Fawkes",
        "Michael O'Riordan",
        "Athanasios Vlontzos",
        "Oriol Corcoll",
        "Ciarán Mark Gilligan-Lee"
      ],
      "abstract": "Observational data is often readily available in large quantities, but can\nlead to biased causal effect estimates due to the presence of unobserved\nconfounding. Recent works attempt to remove this bias by supplementing\nobservational data with experimental data, which, when available, is typically\non a smaller scale due to the time and cost involved in running a randomised\ncontrolled trial. In this work, we prove a theorem that places fundamental\nlimits on this ``best of both worlds'' approach. Using the framework of\nimpossible inference, we show that although it is possible to use experimental\ndata to \\emph{falsify} causal effect estimates from observational data, in\ngeneral it is not possible to \\emph{validate} such estimates. Our theorem\nproves that while experimental data can be used to detect bias in observational\nstudies, without additional assumptions on the smoothness of the correction\nfunction, it can not be used to remove it. We provide a practical example of\nsuch an assumption, developing a novel Gaussian Process based approach to\nconstruct intervals which contain the true treatment effect with high\nprobability, both inside and outside of the support of the experimental data.\nWe demonstrate our methodology on both simulated and semi-synthetic datasets\nand make the \\href{https://github.com/Jakefawkes/Obs_and_exp_data}{code\navailable}.",
      "pdf_url": "http://arxiv.org/pdf/2503.14795v1",
      "arxiv_url": "http://arxiv.org/abs/2503.14795v1",
      "published": "2025-03-19",
      "categories": [
        "stat.ML",
        "cs.LG",
        "stat.ME"
      ]
    },
    {
      "title": "Doubly robust identification of treatment effects from multiple environments",
      "authors": [
        "Piersilvio De Bartolomeis",
        "Julia Kostin",
        "Javier Abad",
        "Yixin Wang",
        "Fanny Yang"
      ],
      "abstract": "Practical and ethical constraints often require the use of observational data\nfor causal inference, particularly in medicine and social sciences. Yet,\nobservational datasets are prone to confounding, potentially compromising the\nvalidity of causal conclusions. While it is possible to correct for biases if\nthe underlying causal graph is known, this is rarely a feasible ask in\npractical scenarios. A common strategy is to adjust for all available\ncovariates, yet this approach can yield biased treatment effect estimates,\nespecially when post-treatment or unobserved variables are present. We propose\nRAMEN, an algorithm that produces unbiased treatment effect estimates by\nleveraging the heterogeneity of multiple data sources without the need to know\nor learn the underlying causal graph. Notably, RAMEN achieves doubly robust\nidentification: it can identify the treatment effect whenever the causal\nparents of the treatment or those of the outcome are observed, and the node\nwhose parents are observed satisfies an invariance assumption. Empirical\nevaluations on synthetic and real-world datasets show that our approach\noutperforms existing methods.",
      "pdf_url": "http://arxiv.org/pdf/2503.14459v1",
      "arxiv_url": "http://arxiv.org/abs/2503.14459v1",
      "published": "2025-03-18",
      "categories": [
        "stat.ML",
        "cs.LG",
        "stat.ME"
      ]
    },
    {
      "title": "The covariance of causal effect estimators for binary v-structures",
      "authors": [
        "Jack Kuipers",
        "Giusi Moffa"
      ],
      "abstract": "Previously [Journal of Causal Inference, 10, 90-105 (2022)], we computed the\nvariance of two estimators of causal effects for a v-structure of binary\nvariables. Here we show that a linear combination of these estimators has lower\nvariance than either. Furthermore, we show that this holds also when the\ntreatment variable is block randomised with a predefined number receiving\ntreatment, with analogous results to when it is sampled randomly.",
      "pdf_url": "http://arxiv.org/pdf/2503.14242v1",
      "arxiv_url": "http://arxiv.org/abs/2503.14242v1",
      "published": "2025-03-18",
      "categories": [
        "math.ST",
        "stat.TH"
      ]
    },
    {
      "title": "KANITE: Kolmogorov-Arnold Networks for ITE estimation",
      "authors": [
        "Eshan Mehendale",
        "Abhinav Thorat",
        "Ravi Kolla",
        "Niranjan Pedanekar"
      ],
      "abstract": "We introduce KANITE, a framework leveraging Kolmogorov-Arnold Networks (KANs)\nfor Individual Treatment Effect (ITE) estimation under multiple treatments\nsetting in causal inference. By utilizing KAN's unique abilities to learn\nunivariate activation functions as opposed to learning linear weights by\nMulti-Layer Perceptrons (MLPs), we improve the estimates of ITEs. The KANITE\nframework comprises two key architectures: 1.Integral Probability Metric (IPM)\narchitecture: This employs an IPM loss in a specialized manner to effectively\nalign towards ITE estimation across multiple treatments. 2. Entropy Balancing\n(EB) architecture: This uses weights for samples that are learned by optimizing\nentropy subject to balancing the covariates across treatment groups. Extensive\nevaluations on benchmark datasets demonstrate that KANITE outperforms\nstate-of-the-art algorithms in both $\\epsilon_{\\text{PEHE}}$ and\n$\\epsilon_{\\text{ATE}}$ metrics. Our experiments highlight the advantages of\nKANITE in achieving improved causal estimates, emphasizing the potential of\nKANs to advance causal inference methodologies across diverse application\nareas.",
      "pdf_url": "http://arxiv.org/pdf/2503.13912v1",
      "arxiv_url": "http://arxiv.org/abs/2503.13912v1",
      "published": "2025-03-18",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ME"
      ]
    },
    {
      "title": "Bayesian high-dimensional biological pathway-guided mediation analysis with application to metabolomics",
      "authors": [
        "Yuzi Zhang",
        "Donghai Liang",
        "Youran Tan",
        "Anne L. Dunlop",
        "Howard H. Chang"
      ],
      "abstract": "With advances in high-resolution mass spectrometry technologies, metabolomics\ndata are increasingly used to investigate biological mechanisms underlying\nassociations between exposures and health outcomes in clinical and\nepidemiological studies. Mediation analysis is a powerful framework for\ninvestigating a hypothesized causal chain and when applied to metabolomics\ndata, a large number of correlated metabolites belonging to interconnected\nmetabolic pathways need to be considered as mediators. To identify metabolic\npathways as active mediators, existing approaches typically focus on first\nidentifying individual metabolites as active mediators, followed by post-hoc\nmetabolic pathway determination. These multi-stage procedures make statistical\ninference challenging. We propose a Bayesian biological pathway-guided\nmediation analysis that aims to jointly analyze all metabolites together,\nidentify metabolic pathways directly, and estimate metabolic pathway-specific\nindirect effects. This is accomplished by incorporating existing biological\nknowledge of metabolic pathways to account for correlations among mediators,\nalong with variable selection and dimension reduction techniques. Advantages of\nthe proposed method is demonstrated in extensive simulation studies with\nreal-word metabolic pathway structure. We apply the proposed method to two\nstudies examining the role of metabolism in mediating (1) the effect of\nRoux-en-Y gastric bypass on glycemic control, and (2) the effect of prenatal\nexposure to per- and polyfluoroalkyl substances (PFAS) on gestational age at\nbirth. Our analyses confirm metabolic pathways previously identified and\nprovide additional uncertainty quantification for the mediation effects.",
      "pdf_url": "http://arxiv.org/pdf/2503.13894v1",
      "arxiv_url": "http://arxiv.org/abs/2503.13894v1",
      "published": "2025-03-18",
      "categories": [
        "stat.AP"
      ]
    },
    {
      "title": "Generating Causal Explanations of Vehicular Agent Behavioural Interactions with Learnt Reward Profiles",
      "authors": [
        "Rhys Howard",
        "Nick Hawes",
        "Lars Kunze"
      ],
      "abstract": "Transparency and explainability are important features that responsible\nautonomous vehicles should possess, particularly when interacting with humans,\nand causal reasoning offers a strong basis to provide these qualities. However,\neven if one assumes agents act to maximise some concept of reward, it is\ndifficult to make accurate causal inferences of agent planning without\ncapturing what is of importance to the agent. Thus our work aims to learn a\nweighting of reward metrics for agents such that explanations for agent\ninteractions can be causally inferred. We validate our approach quantitatively\nand qualitatively across three real-world driving datasets, demonstrating a\nfunctional improvement over previous methods and competitive performance across\nevaluation metrics.",
      "pdf_url": "http://arxiv.org/pdf/2503.14557v1",
      "arxiv_url": "http://arxiv.org/abs/2503.14557v1",
      "published": "2025-03-18",
      "categories": [
        "cs.AI",
        "cs.MA",
        "cs.RO",
        "I.2.0; I.2.6; I.2.9; I.2.11; I.6.0"
      ]
    },
    {
      "title": "Heterogeneous Treatment Effects in Regression Discontinuity Designs",
      "authors": [
        "Sebastian Calonico",
        "Matias D. Cattaneo",
        "Max H. Farrell",
        "Filippo Palomba",
        "Rocio Titiunik"
      ],
      "abstract": "Empirical studies using Regression Discontinuity (RD) designs often explore\nheterogeneous treatment effects based on pretreatment covariates. However, the\nlack of formal statistical methods has led to the widespread use of ad hoc\napproaches in applications. Motivated by common empirical practice, we develop\na unified, theoretically grounded framework for RD heterogeneity analysis. We\nshow that a fully interacted local linear (in functional parameters) model\neffectively captures heterogeneity while still being tractable and\ninterpretable in applications. The model structure holds without loss of\ngenerality for discrete covariates, while for continuous covariates our\nproposed (local functional linear-in-parameters) model can be potentially\nrestrictive, but it nonetheless naturally matches standard empirical practice\nand offers a causal interpretation for RD applications. We establish principled\nbandwidth selection and robust bias-corrected inference methods to analyze\nheterogeneous treatment effects and test group differences. We provide\ncompanion software to facilitate implementation of our results. An empirical\napplication illustrates the practical relevance of our methods.",
      "pdf_url": "http://arxiv.org/pdf/2503.13696v1",
      "arxiv_url": "http://arxiv.org/abs/2503.13696v1",
      "published": "2025-03-17",
      "categories": [
        "econ.EM",
        "stat.ME"
      ]
    },
    {
      "title": "Causes of evolutionary divergence in prostate cancer",
      "authors": [
        "Emre Esenturk",
        "Atef Sahli",
        "Valeriia Haberland",
        "Aleksandra Ziuboniewicz",
        "Christopher Wirth",
        "G. Steven Bova",
        "Robert G Bristow",
        "Mark N Brook",
        "Benedikt Brors",
        "Adam Butler",
        "Géraldine Cancel-Tassin",
        "Kevin CL Cheng",
        "Colin S Cooper",
        "Niall M Corcoran",
        "Olivier Cussenot",
        "Ros A Eeles",
        "Francesco Favero",
        "Clarissa Gerhauser",
        "Abraham Gihawi",
        "Etsehiwot G Girma",
        "Vincent J Gnanapragasam",
        "Andreas J Gruber",
        "Anis Hamid",
        "Vanessa M Hayes",
        "Housheng Hansen He",
        "Christopher M Hovens",
        "Eddie Luidy Imada",
        "G. Maria Jakobsdottir",
        "Chol-hee Jung",
        "Francesca Khani",
        "Zsofia Kote-Jarai",
        "Philippe Lamy",
        "Gregory Leeman",
        "Massimo Loda",
        "Pavlo Lutsik",
        "Luigi Marchionni",
        "Ramyar Molania",
        "Anthony T Papenfuss",
        "Diogo Pellegrina",
        "Bernard Pope",
        "Lucio R Queiroz",
        "Tobias Rausch",
        "Jüri Reimand",
        "Brian Robinson",
        "Thorsten Schlomm",
        "Karina D Sørensen",
        "Sebastian Uhrig",
        "Joachim Weischenfeldt",
        "Yaobo Xu",
        "Takafumi N Yamaguchi",
        "Claudio Zanettini",
        "Andy G Lynch",
        "David C Wedge",
        "Daniel S Brewer",
        "Dan J Woodcock"
      ],
      "abstract": "Cancer progression involves the sequential accumulation of genetic\nalterations that cumulatively shape the tumour phenotype. In prostate cancer,\ntumours can follow divergent evolutionary trajectories that lead to distinct\nsubtypes, but the causes of this divergence remain unclear. While causal\ninference could elucidate the factors involved, conventional methods are\nunsuitable due to the possibility of unobserved confounders and ambiguity in\nthe direction of causality. Here, we propose a method that circumvents these\nissues and apply it to genomic data from 829 prostate cancer patients. We\nidentify several genetic alterations that drive divergence as well as others\nthat prevent this transition, locking tumours into one trajectory. Further\nanalysis reveals that these genetic alterations may cause each other, implying\na positive-feedback loop that accelerates divergence. Our findings provide\ninsights into how cancer subtypes emerge and offer a foundation for genomic\nsurveillance strategies aimed at monitoring the progression of prostate cancer.",
      "pdf_url": "http://arxiv.org/pdf/2503.13189v1",
      "arxiv_url": "http://arxiv.org/abs/2503.13189v1",
      "published": "2025-03-17",
      "categories": [
        "q-bio.GN"
      ]
    }
  ]
}