{
  "last_updated": "2025-11-27T00:53:25.550759",
  "papers": [
    {
      "title": "Spatio-Temporal Hierarchical Causal Models",
      "authors": [
        "Xintong Li",
        "Haoran Zhang",
        "Xiao Zhou"
      ],
      "abstract": "The abundance of fine-grained spatio-temporal data, such as traffic sensor networks, offers vast opportunities for scientific discovery. However, inferring causal relationships from such observational data remains challenging, particularly due to unobserved confounders that are specific to units (e.g., geographical locations) yet influence outcomes over time. Most existing methods for spatio-temporal causal inference assume that all confounders are observed, an assumption that is often violated in practice. In this paper, we introduce Spatio-Temporal Hierarchical Causal Models (ST-HCMs), a novel graphical framework that extends hierarchical causal modeling to the spatio-temporal domain. At the core of our approach is the Spatio-Temporal Collapse Theorem, which shows that a complex ST-HCM converges to a simpler flat causal model as the amount of subunit data increases. This theoretical result enables a general procedure for causal identification, allowing ST-HCMs to recover causal effects even in the presence of unobserved, time-invariant unit-level confounders, a scenario where standard non-hierarchical models fail. We validate the effectiveness of our framework on both synthetic and real-world datasets, demonstrating its potential for robust causal inference in complex dynamic systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.20558v1",
      "arxiv_url": "http://arxiv.org/abs/2511.20558v1",
      "published": "2025-11-25",
      "categories": [
        "stat.ML",
        "cs.LG"
      ]
    },
    {
      "title": "Block Cascading: Training Free Acceleration of Block-Causal Video Models",
      "authors": [
        "Hmrishav Bandyopadhyay",
        "Nikhil Pinnaparaju",
        "Rahim Entezari",
        "Jim Scott",
        "Yi-Zhe Song",
        "Varun Jampani"
      ],
      "abstract": "Block-causal video generation faces a stark speed-quality trade-off: small 1.3B models manage only 16 FPS while large 14B models crawl at 4.5 FPS, forcing users to choose between responsiveness and quality. Block Cascading significantly mitigates this trade-off through training-free parallelization. Our key insight: future video blocks do not need fully denoised current blocks to begin generation. By starting block generation with partially denoised context from predecessors, we transform sequential pipelines into parallel cascades where multiple blocks denoise simultaneously. With 5 GPUs exploiting temporal parallelism, we achieve ~2x acceleration across all model scales: 1.3B models accelerate from 16 to 30 FPS, 14B models from 4.5 to 12.5 FPS. Beyond inference speed, Block Cascading eliminates overhead from KV-recaching (of ~200ms) during context switches for interactive generation. Extensive evaluations validated against multiple block-causal pipelines demonstrate no significant loss in generation quality when switching from block-causal to Block Cascading pipelines for inference. Project Page: https://hmrishavbandy.github.io/block_cascading_page/",
      "pdf_url": "https://arxiv.org/pdf/2511.20426v1",
      "arxiv_url": "http://arxiv.org/abs/2511.20426v1",
      "published": "2025-11-25",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "CounterVQA: Evaluating and Improving Counterfactual Reasoning in Vision-Language Models for Video Understanding",
      "authors": [
        "Yuefei Chen",
        "Jiang Liu",
        "Xiaodong Lin",
        "Ruixiang Tang"
      ],
      "abstract": "Vision Language Models (VLMs) have recently shown significant advancements in video understanding, especially in feature alignment, event reasoning, and instruction-following tasks. However, their capability for counterfactual reasoning, inferring alternative outcomes under hypothetical conditions, remains underexplored. This capability is essential for robust video understanding, as it requires identifying underlying causal structures and reasoning about unobserved possibilities, rather than merely recognizing observed patterns. To systematically evaluate this capability, we introduce CounterVQA, a video-based benchmark featuring three progressive difficulty levels that assess different aspects of counterfactual reasoning. Through comprehensive evaluation of both state-of-the-art open-source and closed-source models, we uncover a substantial performance gap: while these models achieve reasonable accuracy on simple counterfactual questions, performance degrades significantly on complex multi-hop causal chains. To address these limitations, we develop a post-training method, CFGPT, that enhances a model's visual counterfactual reasoning ability by distilling its counterfactual reasoning capability from the language modality, yielding consistent improvements across all CounterVQA difficulty levels. Dataset and code will be further released.",
      "pdf_url": "https://arxiv.org/pdf/2511.19923v1",
      "arxiv_url": "http://arxiv.org/abs/2511.19923v1",
      "published": "2025-11-25",
      "categories": [
        "cs.CV",
        "cs.CL"
      ]
    },
    {
      "title": "CoC-VLA: Delving into Adversarial Domain Transfer for Explainable Autonomous Driving via Chain-of-Causality Visual-Language-Action Model",
      "authors": [
        "Dapeng Zhang",
        "Fei Shen",
        "Rui Zhao",
        "Yinda Chen",
        "Peng Zhi",
        "Chenyang Li",
        "Rui Zhou",
        "Qingguo Zhou"
      ],
      "abstract": "Autonomous driving represents a prominent application of artificial intelligence. Recent approaches have shifted from focusing solely on common scenarios to addressing complex, long-tail situations such as subtle human behaviors, traffic accidents, and non-compliant driving patterns. Given the demonstrated capabilities of large language models (LLMs) in understanding visual and natural language inputs and following instructions, recent methods have integrated LLMs into autonomous driving systems to enhance reasoning, interpretability, and performance across diverse scenarios. However, existing methods typically rely either on real-world data, which is suitable for industrial deployment, or on simulation data tailored to rare or hard case scenarios. Few approaches effectively integrate the complementary advantages of both data sources. To address this limitation, we propose a novel VLM-guided, end-to-end adversarial transfer framework for autonomous driving that transfers long-tail handling capabilities from simulation to real-world deployment, named CoC-VLA. The framework comprises a teacher VLM model, a student VLM model, and a discriminator. Both the teacher and student VLM models utilize a shared base architecture, termed the Chain-of-Causality Visual-Language Model (CoC VLM), which integrates temporal information via an end-to-end text adapter. This architecture supports chain-of-thought reasoning to infer complex driving logic. The teacher and student VLM models are pre-trained separately on simulated and real-world datasets. The discriminator is trained adversarially to facilitate the transfer of long-tail handling capabilities from simulated to real-world environments by the student VLM model, using a novel backpropagation strategy.",
      "pdf_url": "https://arxiv.org/pdf/2511.19914v1",
      "arxiv_url": "http://arxiv.org/abs/2511.19914v1",
      "published": "2025-11-25",
      "categories": [
        "cs.RO"
      ]
    },
    {
      "title": "Clarifying identification and estimation of treatment effects in the Sequential Parallel Comparison Design",
      "authors": [
        "Benjamin Stockton",
        "Michele Santacatterina",
        "Soutrik Mandal",
        "Charles M. Cleland",
        "Erinn M. Hade",
        "Nicholas Illenberger",
        "Sharon Meropol",
        "Andrea B. Troxel",
        "Eva Petkova",
        "Chang Yu",
        "Thaddeus Tarpey"
      ],
      "abstract": "Sequential parallel comparison design (SPCD) clinical trials aim to adjust active treatment effect estimates for placebo response to minimize the impact of placebo responders on the estimates. This is potentially accomplished using a two stage design by measuring treatment effects among all participants during the first stage, then classifying some placebo arm participants as placebo non-responders who will be re-randomized in the second stage. In this paper, we use causal inference tools to clarify under what assumptions treatment effects can be identified in SPCD trials and what effects the conventional estimators target at each stage of the SPCD trial. We further illustrate the highly influential impact of placebo response misclassification on the second stage estimate. We conclude that the conventional SPCD estimators do not target meaningful treatment effects.",
      "pdf_url": "https://arxiv.org/pdf/2511.19677v1",
      "arxiv_url": "http://arxiv.org/abs/2511.19677v1",
      "published": "2025-11-24",
      "categories": [
        "stat.ME",
        "stat.AP"
      ]
    },
    {
      "title": "Nonparametric Instrumental Variable Regression with Observed Covariates",
      "authors": [
        "Zikai Shen",
        "Zonghao Chen",
        "Dimitri Meunier",
        "Ingo Steinwart",
        "Arthur Gretton",
        "Zhu Li"
      ],
      "abstract": "We study the problem of nonparametric instrumental variable regression with observed covariates, which we refer to as NPIV-O. Compared with standard nonparametric instrumental variable regression (NPIV), the additional observed covariates facilitate causal identification and enables heterogeneous causal effect estimation. However, the presence of observed covariates introduces two challenges for its theoretical analysis. First, it induces a partial identity structure, which renders previous NPIV analyses - based on measures of ill-posedness, stability conditions, or link conditions - inapplicable. Second, it imposes anisotropic smoothness on the structural function. To address the first challenge, we introduce a novel Fourier measure of partial smoothing; for the second challenge, we extend the existing kernel 2SLS instrumental variable algorithm with observed covariates, termed KIV-O, to incorporate Gaussian kernel lengthscales adaptive to the anisotropic smoothness. We prove upper $L^2$-learning rates for KIV-O and the first $L^2$-minimax lower learning rates for NPIV-O. Both rates interpolate between known optimal rates of NPIV and nonparametric regression (NPR). Interestingly, we identify a gap between our upper and lower bounds, which arises from the choice of kernel lengthscales tuned to minimize a projected risk. Our theoretical analysis also applies to proximal causal inference, an emerging framework for causal effect estimation that shares the same conditional moment restriction as NPIV-O.",
      "pdf_url": "https://arxiv.org/pdf/2511.19404v1",
      "arxiv_url": "http://arxiv.org/abs/2511.19404v1",
      "published": "2025-11-24",
      "categories": [
        "stat.ML",
        "cs.LG",
        "math.ST"
      ]
    },
    {
      "title": "The Unified Non-Convex Framework for Robust Causal Inference: Overcoming the Gaussian Barrier and Optimization Fragility",
      "authors": [
        "Eichi Uehara"
      ],
      "abstract": "This document proposes a Unified Robust Framework that re-engineers the estimation of the Average Treatment Effect on the Overlap (ATO). It synthesizes gamma-Divergence for outlier robustness, Graduated Non-Convexity (GNC) for global optimization, and a \"Gatekeeper\" mechanism to address the impossibility of higher-order orthogonality in Gaussian regimes.",
      "pdf_url": "https://arxiv.org/pdf/2511.19284v1",
      "arxiv_url": "http://arxiv.org/abs/2511.19284v1",
      "published": "2025-11-24",
      "categories": [
        "stat.ML",
        "cs.LG",
        "stat.ME"
      ]
    },
    {
      "title": "Scalable Bayesian Network Structure Learning Using Tsetlin Machine to Constrain the Search Space",
      "authors": [
        "Kunal Dumbre",
        "Lei Jiao",
        "Ole-Christoffer Granmo"
      ],
      "abstract": "The PC algorithm is a widely used method in causal inference for learning the structure of Bayesian networks. Despite its popularity, the PC algorithm suffers from significant time complexity, particularly as the size of the dataset increases, which limits its applicability in large-scale real-world problems. In this study, we propose a novel approach that utilises the Tsetlin Machine (TM) to construct Bayesian structures more efficiently. Our method leverages the most significant literals extracted from the TM and performs conditional independence (CI) tests on these selected literals instead of the full set of variables, resulting in a considerable reduction in computational time. We implemented our approach and compared it with various state-of-the-art methods. Our evaluation includes categorical datasets from the bnlearn repository, such as Munin1, Hepar2. The findings indicate that the proposed TM-based method not only reduces computational complexity but also maintains competitive accuracy in causal discovery, making it a viable alternative to traditional PC algorithm implementations by offering improved efficiency without compromising performance.",
      "pdf_url": "https://arxiv.org/pdf/2511.19273v1",
      "arxiv_url": "http://arxiv.org/abs/2511.19273v1",
      "published": "2025-11-24",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "CDLM: Consistency Diffusion Language Models For Faster Sampling",
      "authors": [
        "Minseo Kim",
        "Chenfeng Xu",
        "Coleman Hooper",
        "Harman Singh",
        "Ben Athiwaratkun",
        "Ce Zhang",
        "Kurt Keutzer",
        "Amir Gholami"
      ],
      "abstract": "Diffusion Language Models (DLMs) offer a promising parallel generation paradigm but suffer from slow inference due to numerous refinement steps and the inability to use standard KV caching. We introduce CDLM (Consistency Diffusion Language Models), a training-based acceleration method that simultaneously tackles both bottlenecks. CDLM integrates consistency modeling to drastically reduce the number of required sampling steps by enabling multi-token finalization. Furthermore, we enforce a block-wise causal attention mask during fine-tuning, making the model fully compatible with KV caching. Experiments show CDLM achieves 3.6x-14.5x lower latency while maintaining competitive accuracy on math and coding tasks. The full training and evaluation code is available at https://github.com/SqueezeAILab/CDLM.",
      "pdf_url": "https://arxiv.org/pdf/2511.19269v1",
      "arxiv_url": "http://arxiv.org/abs/2511.19269v1",
      "published": "2025-11-24",
      "categories": [
        "cs.LG",
        "cs.CL"
      ]
    },
    {
      "title": "Prior-Free Information Design",
      "authors": [
        "Maxwell Rosenthal"
      ],
      "abstract": "This paper introduces a prior-free framework for information design based on partial identification and applies it to robust causal inference. The decision maker observes the distribution of signals generated by an information structure and ranks alternatives by their worst-case payoff over the state distributions consistent with those signals. We characterize the set of robustly implementable actions and show that each can be implemented by an information structure that withholds at most one dimension of information from the decision maker. In the potential outcomes model, every treatment is implementable via an experiment that is almost fully informative.",
      "pdf_url": "https://arxiv.org/pdf/2511.18647v1",
      "arxiv_url": "http://arxiv.org/abs/2511.18647v1",
      "published": "2025-11-23",
      "categories": [
        "econ.TH",
        "econ.EM"
      ]
    }
  ]
}