{
  "last_updated": "2025-04-14T00:53:40.355592",
  "papers": [
    {
      "title": "Relaxing the Markov Requirements on Reinforcement Learning Under Weak Partial Ignorability",
      "authors": [
        "MaryLena Bleile"
      ],
      "abstract": "Incomplete data, confounding effects, and violations of the Markov property\nare interrelated problems which are ubiquitous in Reinforcement Learning\napplications. We introduce the concept of ``partial ignorabilty\" and leverage\nit to establish a novel convergence theorem for adaptive Reinforcement\nLearning. This theoretical result relaxes the Markov assumption on the\nstochastic process underlying conventional $Q$-learning, deploying a\ngeneralized form of the Robbins-Monro stochastic approximation theorem to\nestablish optimality. This result has clear downstream implications for most\nactive subfields of Reinforcement Learning, with clear paths for extension to\nthe field of Causal Inference.",
      "pdf_url": "http://arxiv.org/pdf/2504.07722v1",
      "arxiv_url": "http://arxiv.org/abs/2504.07722v1",
      "published": "2025-04-10",
      "categories": [
        "cs.LG",
        "stat.ME",
        "60G"
      ]
    },
    {
      "title": "Better Decisions through the Right Causal World Model",
      "authors": [
        "Elisabeth Dillies",
        "Quentin Delfosse",
        "Jannis Blüml",
        "Raban Emunds",
        "Florian Peter Busch",
        "Kristian Kersting"
      ],
      "abstract": "Reinforcement learning (RL) agents have shown remarkable performances in\nvarious environments, where they can discover effective policies directly from\nsensory inputs. However, these agents often exploit spurious correlations in\nthe training data, resulting in brittle behaviours that fail to generalize to\nnew or slightly modified environments. To address this, we introduce the Causal\nObject-centric Model Extraction Tool (COMET), a novel algorithm designed to\nlearn the exact interpretable causal world models (CWMs). COMET first extracts\nobject-centric state descriptions from observations and identifies the\nenvironment's internal states related to the depicted objects' properties.\nUsing symbolic regression, it models object-centric transitions and derives\ncausal relationships governing object dynamics. COMET further incorporates\nlarge language models (LLMs) for semantic inference, annotating causal\nvariables to enhance interpretability.\n  By leveraging these capabilities, COMET constructs CWMs that align with the\ntrue causal structure of the environment, enabling agents to focus on\ntask-relevant features. The extracted CWMs mitigate the danger of shortcuts,\npermitting the development of RL systems capable of better planning and\ndecision-making across dynamic scenarios. Our results, validated in Atari\nenvironments such as Pong and Freeway, demonstrate the accuracy and robustness\nof COMET, highlighting its potential to bridge the gap between object-centric\nreasoning and causal inference in reinforcement learning.",
      "pdf_url": "http://arxiv.org/pdf/2504.07257v1",
      "arxiv_url": "http://arxiv.org/abs/2504.07257v1",
      "published": "2025-04-09",
      "categories": [
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Causal Inference under Interference through Designed Markets",
      "authors": [
        "Evan Munro"
      ],
      "abstract": "Equilibrium effects make it challenging to evaluate the impact of an\nindividual-level treatment on outcomes in a single market, even with data from\na randomized trial. In some markets, however, a centralized mechanism allocates\ngoods and imposes useful structure on spillovers. For a class of strategy-proof\n\"cutoff\" mechanisms, we propose an estimator for global treatment effects using\nindividual-level data from one market, where treatment assignment is\nunconfounded. Algorithmically, we re-run a weighted and perturbed version of\nthe mechanism. Under a continuum market approximation, the estimator is\nasymptotically normal and semi-parametrically efficient. We extend this\napproach to learn spillover-aware treatment rules with vanishing asymptotic\nregret. Empirically, adjusting for equilibrium effects notably diminishes the\nestimated effect of information on inequality in the Chilean school system.",
      "pdf_url": "http://arxiv.org/pdf/2504.07217v1",
      "arxiv_url": "http://arxiv.org/abs/2504.07217v1",
      "published": "2025-04-09",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "Efficient Timestamping for Sampling-based Race Detection",
      "authors": [
        "Minjian Zhang",
        "Daniel Wee Soong Lim",
        "Mosaad Al Thokair",
        "Umang Mathur",
        "Mahesh Viswanathan"
      ],
      "abstract": "Dynamic race detection based on the happens before (HB) partial order has now\nbecome the de facto approach to quickly identify data races in multi-threaded\nsoftware. Most practical implementations for detecting these races use\ntimestamps to infer causality between events and detect races based on these\ntimestamps. Such an algorithm updates timestamps (stored in vector clocks) at\nevery event in the execution, and is known to induce excessive overhead. Random\nsampling has emerged as a promising algorithmic paradigm to offset this\noverhead. It offers the promise of making sound race detection scalable. In\nthis work we consider the task of designing an efficient sampling based race\ndetector with low overhead for timestamping when the number of sampled events\nis much smaller than the total events in an execution. To solve this problem,\nwe propose (1) a new notion of freshness timestamp, (2) a new data structure to\nstore timestamps, and (3) an algorithm that uses a combination of them to\nreduce the cost of timestamping in sampling based race detection. Further, we\nprove that our algorithm is close to optimal -- the number of vector clock\ntraversals is bounded by the number of sampled events and number of threads,\nand further, on any given dynamic execution, the cost of timestamping due to\nour algorithm is close to the amount of work any timestamping-based algorithm\nmust perform on that execution, that is it is instance optimal. Our evaluation\non real world benchmarks demonstrates the effectiveness of our proposed\nalgorithm over prior timestamping algorithms that are agnostic to sampling.",
      "pdf_url": "http://arxiv.org/pdf/2504.06688v1",
      "arxiv_url": "http://arxiv.org/abs/2504.06688v1",
      "published": "2025-04-09",
      "categories": [
        "cs.PL"
      ]
    },
    {
      "title": "A Streamable Neural Audio Codec with Residual Scalar-Vector Quantization for Real-Time Communication",
      "authors": [
        "Xiao-Hang Jiang",
        "Yang Ai",
        "Rui-Chen Zheng",
        "Zhen-Hua Ling"
      ],
      "abstract": "This paper proposes StreamCodec, a streamable neural audio codec designed for\nreal-time communication. StreamCodec adopts a fully causal, symmetric\nencoder-decoder structure and operates in the modified discrete cosine\ntransform (MDCT) domain, aiming for low-latency inference and real-time\nefficient generation. To improve codebook utilization efficiency and compensate\nfor the audio quality loss caused by structural causality, StreamCodec\nintroduces a novel residual scalar-vector quantizer (RSVQ). The RSVQ\nsequentially connects scalar quantizers and improved vector quantizers in a\nresidual manner, constructing coarse audio contours and refining acoustic\ndetails, respectively. Experimental results confirm that the proposed\nStreamCodec achieves decoded audio quality comparable to advanced\nnon-streamable neural audio codecs. Specifically, on the 16 kHz LibriTTS\ndataset, StreamCodec attains a ViSQOL score of 4.30 at 1.5 kbps. It has a fixed\nlatency of only 20 ms and achieves a generation speed nearly 20 times real-time\non a CPU, with a lightweight model size of just 7M parameters, making it highly\nsuitable for real-time communication applications.",
      "pdf_url": "http://arxiv.org/pdf/2504.06561v1",
      "arxiv_url": "http://arxiv.org/abs/2504.06561v1",
      "published": "2025-04-09",
      "categories": [
        "cs.SD"
      ]
    },
    {
      "title": "OPAL: Encoding Causal Understanding of Physical Systems for Robot Learning",
      "authors": [
        "Daniel Tcheurekdjian",
        "Joshua Klasmeier",
        "Tom Cooney",
        "Christopher McCann",
        "Tyler Fenstermaker"
      ],
      "abstract": "We present OPAL (Operant Physical Agent with Language), a novel\nvision-language-action architecture that introduces topological constraints to\nflow matching for robotic control. To do so, we further introduce topological\nattention. Our approach models action sequences as topologically-structured\nrepresentations with non-trivial constraints. Experimental results across 10\ncomplex manipulation tasks demonstrate OPAL's superior performance compared to\nprevious approaches, including Octo, OpenVLA, and ${\\pi}$0.\n  Our architecture achieves significant improvements in zero-shot performance\nwithout requiring task-specific fine-tuning, while reducing inference\ncomputational requirements by 42%. The theoretical guarantees provided by our\ntopological approach result in more coherent long-horizon action sequences. Our\nresults highlight the potential of constraining the search space of learning\nproblems in robotics by deriving from fundamental physical laws, and the\npossibility of using topological attention to embed causal understanding into\ntransformer architectures.",
      "pdf_url": "http://arxiv.org/pdf/2504.06538v1",
      "arxiv_url": "http://arxiv.org/abs/2504.06538v1",
      "published": "2025-04-09",
      "categories": [
        "cs.RO",
        "cs.AI"
      ]
    },
    {
      "title": "Characterizing direct and indirect causal effects when outcomes are dependent due to treatment spillover and outcome spillover",
      "authors": [
        "Subhankar Bhadra",
        "Michael Schweinberger"
      ],
      "abstract": "We provide novel insight into causal inference when both treatment spillover\nand outcome spillover occur in connected populations, by taking advantage of\nrecent advances in statistical network analysis. Scenarios with treatment\nspillover and outcome spillover are challenging, because both forms of\nspillover affect outcomes and therefore treatment spillover and outcome\nspillover are intertwined, and outcomes are dependent conditional on treatments\nby virtue of outcome spillover. As a result, the direct and indirect causal\neffects arising from spillover have remained black boxes: While the direct and\nindirect causal effects can be identified, it is unknown how these causal\neffects explicitly depend on the effects of treatment, treatment spillover, and\noutcome spillover. We make three contributions, facilitated by low-rank random\ninterference graphs. First, we provide novel insight into direct and indirect\ncausal effects by disentangling the contributions of treatment, treatment\nspillover, and outcome spillover. Second, we provide scalable estimators of\ndirect and indirect causal effects. Third, we establish rates of convergence\nfor estimators of direct and indirect causal effects. These are the first\nconvergence rates in scenarios in which treatment spillover and outcome\nspillover are intertwined and outcomes are dependent conditional on treatments,\nand the interference graph is sparse or dense.",
      "pdf_url": "http://arxiv.org/pdf/2504.06108v1",
      "arxiv_url": "http://arxiv.org/abs/2504.06108v1",
      "published": "2025-04-08",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Identification and estimation of causal peer effects using instrumental variables",
      "authors": [
        "Shanshan Luo",
        "Kang Shuai",
        "Yechi Zhang",
        "Wei Li",
        "Yangbo He"
      ],
      "abstract": "In social science researches, causal inference regarding peer effects often\nfaces significant challenges due to homophily bias and contextual confounding.\nFor example, unmeasured health conditions (e.g., influenza) and psychological\nstates (e.g., happiness, loneliness) can spread among closely connected\nindividuals, such as couples or siblings. To address these issues, we define\nfour effect estimands for dyadic data to characterize direct effects and\nspillover effects. We employ dual instrumental variables to achieve\nnonparametric identification of these causal estimands in the presence of\nunobserved confounding. We then derive the efficient influence functions for\nthese estimands under the nonparametric model. Additionally, we develop a\ntriply robust and locally efficient estimator that remains consistent even\nunder partial misspecification of the observed data model. The proposed robust\nestimators can be easily adapted to flexible approaches such as machine\nlearning estimation methods, provided that certain rate conditions are\nsatisfied. Finally, we illustrate our approach through simulations and an\nempirical application evaluating the peer effects of retirement on fluid\ncognitive perception among couples.",
      "pdf_url": "http://arxiv.org/pdf/2504.05658v1",
      "arxiv_url": "http://arxiv.org/abs/2504.05658v1",
      "published": "2025-04-08",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "REWIND: Real-Time Egocentric Whole-Body Motion Diffusion with Exemplar-Based Identity Conditioning",
      "authors": [
        "Jihyun Lee",
        "Weipeng Xu",
        "Alexander Richard",
        "Shih-En Wei",
        "Shunsuke Saito",
        "Shaojie Bai",
        "Te-Li Wang",
        "Minhyuk Sung",
        "Tae-Kyun Kim",
        "Jason Saragih"
      ],
      "abstract": "We present REWIND (Real-Time Egocentric Whole-Body Motion Diffusion), a\none-step diffusion model for real-time, high-fidelity human motion estimation\nfrom egocentric image inputs. While an existing method for egocentric\nwhole-body (i.e., body and hands) motion estimation is non-real-time and\nacausal due to diffusion-based iterative motion refinement to capture\ncorrelations between body and hand poses, REWIND operates in a fully causal and\nreal-time manner. To enable real-time inference, we introduce (1) cascaded\nbody-hand denoising diffusion, which effectively models the correlation between\negocentric body and hand motions in a fast, feed-forward manner, and (2)\ndiffusion distillation, which enables high-quality motion estimation with a\nsingle denoising step. Our denoising diffusion model is based on a modified\nTransformer architecture, designed to causally model output motions while\nenhancing generalizability to unseen motion lengths. Additionally, REWIND\noptionally supports identity-conditioned motion estimation when identity prior\nis available. To this end, we propose a novel identity conditioning method\nbased on a small set of pose exemplars of the target identity, which further\nenhances motion estimation quality. Through extensive experiments, we\ndemonstrate that REWIND significantly outperforms the existing baselines both\nwith and without exemplar-based identity conditioning.",
      "pdf_url": "http://arxiv.org/pdf/2504.04956v2",
      "arxiv_url": "http://arxiv.org/abs/2504.04956v2",
      "published": "2025-04-07",
      "categories": [
        "cs.GR",
        "cs.CV"
      ]
    },
    {
      "title": "Causal Inference Isn't Special: Why It's Just Another Prediction Problem",
      "authors": [
        "Carlos Fernández-Loría"
      ],
      "abstract": "Causal inference is often portrayed as fundamentally distinct from predictive\nmodeling, with its own terminology, goals, and intellectual challenges. But at\nits core, causal inference is simply a structured instance of prediction under\ndistribution shift. In both cases, we begin with labeled data from a source\ndomain and seek to generalize to a target domain where outcomes are not\nobserved. The key difference is that in causal inference, the labels --\npotential outcomes -- are selectively observed based on treatment assignment,\nintroducing bias that must be addressed through assumptions. This perspective\nreframes causal estimation as a familiar generalization problem and highlights\nhow techniques from predictive modeling, such as reweighting and domain\nadaptation, apply directly to causal tasks. It also clarifies that causal\nassumptions are not uniquely strong -- they are simply more explicit. By\nviewing causal inference through the lens of prediction, we demystify its\nlogic, connect it to familiar tools, and make it more accessible to\npractitioners and educators alike.",
      "pdf_url": "http://arxiv.org/pdf/2504.04320v1",
      "arxiv_url": "http://arxiv.org/abs/2504.04320v1",
      "published": "2025-04-06",
      "categories": [
        "cs.LG",
        "stat.ME",
        "stat.ML"
      ]
    }
  ]
}