{
  "last_updated": "2025-06-25T00:56:16.566721",
  "papers": [
    {
      "title": "Steering Conceptual Bias via Transformer Latent-Subspace Activation",
      "authors": [
        "Vansh Sharma",
        "Venkat Raman"
      ],
      "abstract": "This work examines whether activating latent subspaces in language models\n(LLMs) can steer scientific code generation toward a specific programming\nlanguage. Five causal LLMs were first evaluated on scientific coding prompts to\nquantify their baseline bias among four programming languages. A static\nneuron-attribution method, perturbing the highest activated MLP weight for a\nC++ or CPP token, proved brittle and exhibited limited generalization across\nprompt styles and model scales. To address these limitations, a\ngradient-refined adaptive activation steering framework (G-ACT) was developed:\nper-prompt activation differences are clustered into a small set of steering\ndirections, and lightweight per-layer probes are trained and refined online to\nselect the appropriate steering vector. In LLaMA-3.2 3B, this approach reliably\nbiases generation towards the CPP language by increasing the average probe\nclassification accuracy by 15% and the early layers (0-6) improving the probe\nclassification accuracy by 61.5% compared to the standard ACT framework. For\nLLaMA-3.3 70B, where attention-head signals become more diffuse, targeted\ninjections at key layers still improve language selection. Although per-layer\nprobing introduces a modest inference overhead, it remains practical by\nsteering only a subset of layers and enables reproducible model behavior. These\nresults demonstrate a scalable, interpretable and efficient mechanism for\nconcept-level control for practical agentic systems.",
      "pdf_url": "http://arxiv.org/pdf/2506.18887v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18887v1",
      "published": "2025-06-23",
      "categories": [
        "cs.AI",
        "cs.LG",
        "cs.SY",
        "eess.SY",
        "I.2.7; I.2.6; I.2.1; D.3.3; C.4"
      ]
    },
    {
      "title": "A Practical Introduction to Regression-based Causal Inference in Meteorology (I): All confounders measured",
      "authors": [
        "Caren Marzban",
        "Yikun Zhang",
        "Nicholas Bond",
        "Michael Richman"
      ],
      "abstract": "Whether a variable is the cause of another, or simply associated with it, is\noften an important scientific question. Causal Inference is the name associated\nwith the body of techniques for addressing that question in a statistical\nsetting. Although assessing causality is relatively straightforward in the\npresence of temporal information, outside of that setting - the situation\nconsidered here - it is more difficult to assess causal effects. The\ndevelopment of the field of causal inference has involved concepts from a wide\nrange of topics, thereby limiting its adoption across some fields, including\nmeteorology. However, at its core, the requisite knowledge for causal inference\ninvolves little more than basic probability theory and regression, topics\nfamiliar to most meteorologists. By focusing on these core areas, this and a\ncompanion article provide a steppingstone for the meteorology community into\nthe field of (non-temporal) causal inference. Although some theoretical\nfoundations are presented, the main goal is the application of a specific\nmethod, called matching, to a problem in meteorology. The data for the\napplication are in public domain, and R code is provided as well, forming an\neasy path for meteorology students and researchers to enter the field.",
      "pdf_url": "http://arxiv.org/pdf/2506.18808v2",
      "arxiv_url": "http://arxiv.org/abs/2506.18808v2",
      "published": "2025-06-23",
      "categories": [
        "stat.AP"
      ]
    },
    {
      "title": "Likelihood Ratio test for Poisson graph",
      "authors": [
        "Chen Shuyan",
        "Liu Xin",
        "Wang Shaoli"
      ],
      "abstract": "Directed acyclic graphs are widely used to describe the causal effects among\nrandom variables, and the inference of those causal effects has become an\npopular topic in statistics and machine learning, and has wide applications in\nneuroinformatics, bioinformatics and so on. However, most studies focus on the\nestimation or inference of the directional relations among continuous random\nvariables, those among discrete random variables have not gained much\nattentions. In this article we focus on the inference of directed linkages and\ndirected pathways in a Poisson directed graphical model. We employ likelihood\nratio tests subject to non-convex acyclicity constraints, and derive the\nasymptotic distributions of the test statistic under the null hypothesis is\ntrue in high-dimensional situations. The power analysis and simulations suggest\nthat the tests achieve the desired objectives of inference. An analysis of a\nbasketball statistics dataset of NBA players during 2016-2017 season\nillustrates the utility of the proposed method to infer directed linkages and\ndirected pathways in player's statistics network.",
      "pdf_url": "http://arxiv.org/pdf/2506.18778v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18778v1",
      "published": "2025-06-23",
      "categories": [
        "stat.ME",
        "math.ST",
        "stat.TH",
        "Primary: 62F03, Secondary: 62F30"
      ]
    },
    {
      "title": "Towards Group Fairness with Multiple Sensitive Attributes in Federated Foundation Models",
      "authors": [
        "Yuning Yang",
        "Han Yu",
        "Tianrun Gao",
        "Xiaodong Xu",
        "Guangyu Wang"
      ],
      "abstract": "The deep integration of foundation models (FM) with federated learning (FL)\nenhances personalization and scalability for diverse downstream tasks, making\nit crucial in sensitive domains like healthcare. Achieving group fairness has\nbecome an increasingly prominent issue in the era of federated foundation\nmodels (FFMs), since biases in sensitive attributes might lead to inequitable\ntreatment for under-represented demographic groups. Existing studies mostly\nfocus on achieving fairness with respect to a single sensitive attribute. This\nrenders them unable to provide clear interpretability of dependencies among\nmultiple sensitive attributes which is required to achieve group fairness. Our\npaper takes the first attempt towards a causal analysis of the relationship\nbetween group fairness across various sensitive attributes in the FFM. We\nextend the FFM structure to trade off multiple sensitive attributes\nsimultaneously and quantify the causal effect behind the group fairness through\ncausal discovery and inference. Extensive experiments validate its\neffectiveness, offering insights into interpretability towards building\ntrustworthy and fair FFM systems.",
      "pdf_url": "http://arxiv.org/pdf/2506.18732v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18732v1",
      "published": "2025-06-23",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "A Practical Introduction to Regression-based Causal Inference in Meteorology (II): Unmeasured confounders",
      "authors": [
        "Caren Marzban",
        "Yikun Zhang",
        "Nicholas Bond",
        "Michael Richman"
      ],
      "abstract": "One obstacle to ``elevating\" correlation to causation is the phenomenon of\nconfounding, i.e., when a correlation between two variables exists because both\nvariables are in fact caused by a third variable. The situation where the\nconfounders are measured is examined in an earlier, accompanying article. Here,\nit is shown that even when the confounding variables are not measured, it is\nstill possible to estimate the causal effect via a regression-based method that\nuses the notion of Instrumental Variables. Using meteorological data set,\nsimilar to that in the sister article, a number of different estimates of the\ncausal effect are compared and contrasted. It is shown that the Instrumental\nVariable results based on unmeasured confounders are consistent with those of\nthe sister article where confounders are measured.",
      "pdf_url": "http://arxiv.org/pdf/2506.18652v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18652v1",
      "published": "2025-06-23",
      "categories": [
        "stat.AP"
      ]
    },
    {
      "title": "T-CPDL: A Temporal Causal Probabilistic Description Logic for Developing Logic-RAG Agent",
      "authors": [
        "Hong Qing Yu"
      ],
      "abstract": "Large language models excel at generating fluent text but frequently struggle\nwith structured reasoning involving temporal constraints, causal relationships,\nand probabilistic reasoning. To address these limitations, we propose Temporal\nCausal Probabilistic Description Logic (T-CPDL), an integrated framework that\nextends traditional Description Logic with temporal interval operators,\nexplicit causal relationships, and probabilistic annotations. We present two\ndistinct variants of T-CPDL: one capturing qualitative temporal relationships\nthrough Allen's interval algebra, and another variant enriched with explicit\ntimestamped causal assertions. Both variants share a unified logical structure,\nenabling complex reasoning tasks ranging from simple temporal ordering to\nnuanced probabilistic causation. Empirical evaluations on temporal reasoning\nand causal inference benchmarks confirm that T-CPDL substantially improves\ninference accuracy, interpretability, and confidence calibration of language\nmodel outputs. By delivering transparent reasoning paths and fine-grained\ntemporal and causal semantics, T-CPDL significantly enhances the capability of\nlanguage models to support robust, explainable, and trustworthy\ndecision-making. This work also lays the groundwork for developing advanced\nLogic-Retrieval-Augmented Generation (Logic-RAG) frameworks, potentially\nboosting the reasoning capabilities and efficiency of knowledge graph-enhanced\nRAG systems.",
      "pdf_url": "http://arxiv.org/pdf/2506.18559v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18559v1",
      "published": "2025-06-23",
      "categories": [
        "cs.AI",
        "cs.LO",
        "I.2.7; F.4.1"
      ]
    },
    {
      "title": "Leveraging specificity for causal inference in observational studies",
      "authors": [
        "Wang Miao"
      ],
      "abstract": "Hill's specificity criterion has been highly influential in biomedical and\nepidemiological research. However, it remains controversial and its application\noften relies on subjective and qualitative analysis without a comprehensive and\nrigorous causal theory. Focusing on unmeasured confounding adjustment with\nmultiple treatments and multiple outcomes, this paper develops a formal and\nquantitative framework for leveraging specificity for causal inference in\nobservational studies. The proposed framework introduces a causal specificity\nassumption, a quantitative measure of specificity, a hypothesis testing\nprocedure, and identification and estimation strategies. Identification under a\nnonparametric outcome model is established. The causal specificity assumption\nconcerns only the breadth of causal associations, in contrast to Hill's\nspecificity that concerns observed associations and to existing confounding\nadjustment methods that rely on auxiliary variables (e.g., instrumental\nvariables, negative controls) or independence structures (e.g., factor models).\nA sensitivity analysis procedure is proposed to assess robustness of the test\nagainst violations of this assumption. This framework is particularly suited to\nexposure- and outcome-wide studies, where joint causal discovery across\nmultiple treatments and multiple outcomes is of interest. It also offers a\npotential tool for addressing other sources of bias, such as invalid\ninstruments in Mendelian randomization and selection bias in missing data\nanalysis.",
      "pdf_url": "http://arxiv.org/pdf/2506.18469v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18469v1",
      "published": "2025-06-23",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Learning Causal Graphs at Scale: A Foundation Model Approach",
      "authors": [
        "Naiyu Yin",
        "Tian Gao",
        "Yue Yu"
      ],
      "abstract": "Due to its human-interpretability and invariance properties, Directed Acyclic\nGraph (DAG) has been a foundational tool across various areas of AI research,\nleading to significant advancements. However, DAG learning remains highly\nchallenging, due to its super-exponential growth in computational cost and\nidentifiability issues, particularly in small-sample regimes. To address these\ntwo challenges, in this work we leverage the recent success of linear\ntransformers and develop a foundation model approach for discovering multiple\norder-consistent DAGs across tasks. In particular, we propose Attention-DAG\n(ADAG), a novel attention-mechanism-based architecture for learning multiple\nlinear Structural Equation Models (SEMs). ADAG learns the mapping from observed\ndata to both graph structure and parameters via a nonlinear attention-based\nkernel, enabling efficient multi-task estimation of the underlying linear SEMs.\nBy formulating the learning process across multiple tasks as a continuous\noptimization problem, the pre-trained ADAG model captures the common structural\nproperties as a shared low-dimensional prior, thereby reducing the\nill-posedness of downstream DAG learning tasks in small-sample regimes. We\nevaluate our proposed approach on benchmark synthetic datasets and find that\nADAG achieves substantial improvements in both DAG learning accuracy and\nzero-shot inference efficiency. To the best of our knowledge, this is the first\npractical approach for pre-training a foundation model specifically designed\nfor DAG learning, representing a step toward more efficient and generalizable\ndown-stream applications in causal discovery.",
      "pdf_url": "http://arxiv.org/pdf/2506.18285v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18285v1",
      "published": "2025-06-23",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "The Impact of Medication Non-adherence on Adverse Outcomes: Evidence from Schizophrenia Patients via Survival Analysis",
      "authors": [
        "Shahriar Noroozizadeh",
        "Pim Welle",
        "Jeremy C. Weiss",
        "George H. Chen"
      ],
      "abstract": "This study quantifies the association between non-adherence to antipsychotic\nmedications and adverse outcomes in individuals with schizophrenia. We frame\nthe problem using survival analysis, focusing on the time to the earliest of\nseveral adverse events (early death, involuntary hospitalization, jail\nbooking). We extend standard causal inference methods (T-learner, S-learner,\nnearest neighbor matching) to utilize various survival models to estimate\nindividual and average treatment effects, where treatment corresponds to\nmedication non-adherence. Analyses are repeated using different amounts of\nlongitudinal information (3, 6, 9, and 12 months). Using data from Allegheny\nCounty in western Pennsylvania, we find strong evidence that non-adherence\nadvances adverse outcomes by approximately 1 to 4 months. Ablation studies\nconfirm that county-provided risk scores adjust for key confounders, as their\nremoval amplifies the estimated effects. Subgroup analyses by medication\nformulation (injectable vs. oral) and medication type consistently show that\nnon-adherence is associated with earlier adverse events. These findings\nhighlight the clinical importance of adherence in delaying psychiatric crises\nand show that integrating survival analysis with causal inference tools can\nyield policy-relevant insights. We caution that although we apply causal\ninference, we only make associative claims and discuss assumptions needed for\ncausal interpretation.",
      "pdf_url": "http://arxiv.org/pdf/2506.18187v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18187v1",
      "published": "2025-06-22",
      "categories": [
        "cs.AI",
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "Causal Interventions in Bond Multi-Dealer-to-Client Platforms",
      "authors": [
        "Paloma Marín",
        "Sergio Ardanza-Trevijano",
        "Javier Sabio"
      ],
      "abstract": "The digitalization of financial markets has shifted trading from voice to\nelectronic channels, with Multi-Dealer-to-Client (MD2C) platforms now enabling\nclients to request quotes (RfQs) for financial instruments like bonds from\nmultiple dealers simultaneously. In this competitive landscape, dealers cannot\nsee each other's prices, making a rigorous analysis of the negotiation process\ncrucial to ensure their profitability. This article introduces a novel general\nframework for analyzing the RfQ process using probabilistic graphical models\nand causal inference. Within this framework, we explore different inferential\nquestions that are relevant for dealers participating in MD2C platforms, such\nas the computation of optimal prices, estimating potential revenues and the\nidentification of clients that might be interested in trading the dealer's\naxes. We then move into analyzing two different approaches for model\nspecification: a generative model built on the work of (Fermanian, Gu\\'eant &\nPu, 2017); and discriminative models utilizing machine learning techniques. We\nevaluate these methodologies using predictive metrics designed to assess their\neffectiveness in the context of optimal pricing, highlighting the relative\nbenefits of using models that take into account the internal mechanisms of the\nnegotiation process.",
      "pdf_url": "http://arxiv.org/pdf/2506.18147v1",
      "arxiv_url": "http://arxiv.org/abs/2506.18147v1",
      "published": "2025-06-22",
      "categories": [
        "q-fin.TR"
      ]
    }
  ]
}