{
  "last_updated": "2025-11-16T00:58:04.352492",
  "papers": [
    {
      "title": "GraphFaaS: Serverless GNN Inference for Burst-Resilient, Real-Time Intrusion Detection",
      "authors": [
        "Lingzhi Wang",
        "Vinod Yegneswaran",
        "Xinyi Shi",
        "Ziyu Li",
        "Ashish Gehani",
        "Yan Chen"
      ],
      "abstract": "Provenance-based intrusion detection is an increasingly popular application of graphical machine learning in cybersecurity, where system activities are modeled as provenance graphs to capture causality and correlations among potentially malicious actions. Graph Neural Networks (GNNs) have demonstrated strong performance in this setting. However, traditional statically-provisioned GNN inference architectures fall short in meeting two crucial demands of intrusion detection: (1) maintaining consistently low detection latency, and (2) handling highly irregular and bursty workloads. To holistically address these challenges, we present GraphFaaS, a serverless architecture tailored for GNN-based intrusion detection. GraphFaaS leverages the elasticity and agility of serverless computing to dynamically scale the GNN inference pipeline. We parallelize and adapt GNN workflows to a serverless environment, ensuring that the system can respond in real time to fluctuating workloads. By decoupling compute resources from static provisioning, GraphFaaS delivers stable inference latency, which is critical for dependable intrusion detection and timely incident response in cybersecurity operations. Preliminary evaluation shows GraphFaaS reduces average detection latency by 85% and coefficient of variation (CV) by 64% compared to the baseline.",
      "pdf_url": "https://arxiv.org/pdf/2511.10554v1",
      "arxiv_url": "http://arxiv.org/abs/2511.10554v1",
      "published": "2025-11-13",
      "categories": [
        "cs.CR"
      ]
    },
    {
      "title": "Causal Model-Based Reinforcement Learning for Sample-Efficient IoT Channel Access",
      "authors": [
        "Aswin Arun",
        "Christo Kurisummoottil Thomas",
        "Rimalpudi Sarvendranath",
        "Walid Saad"
      ],
      "abstract": "Despite the advantages of multi-agent reinforcement learning (MARL) for wireless use case such as medium access control (MAC), their real-world deployment in Internet of Things (IoT) is hindered by their sample inefficiency. To alleviate this challenge, one can leverage model-based reinforcement learning (MBRL) solutions, however, conventional MBRL approaches rely on black-box models that are not interpretable and cannot reason. In contrast, in this paper, a novel causal model-based MARL framework is developed by leveraging tools from causal learn- ing. In particular, the proposed model can explicitly represent causal dependencies between network variables using structural causal models (SCMs) and attention-based inference networks. Interpretable causal models are then developed to capture how MAC control messages influence observations, how transmission actions determine outcomes, and how channel observations affect rewards. Data augmentation techniques are then used to generate synthetic rollouts using the learned causal model for policy optimization via proximal policy optimization (PPO). Analytical results demonstrate exponential sample complexity gains of causal MBRL over black-box approaches. Extensive simulations demonstrate that, on average, the proposed approach can reduce environment interactions by 58%, and yield faster convergence compared to model-free baselines. The proposed approach inherently is also shown to provide interpretable scheduling decisions via attention-based causal attribution, revealing which network conditions drive the policy. The resulting combination of sample efficiency and interpretability establishes causal MBRL as a practical approach for resource-constrained wireless systems.",
      "pdf_url": "https://arxiv.org/pdf/2511.10291v1",
      "arxiv_url": "http://arxiv.org/abs/2511.10291v1",
      "published": "2025-11-13",
      "categories": [
        "cs.IT",
        "cs.LG",
        "cs.NI"
      ]
    },
    {
      "title": "Temporal Latent Variable Structural Causal Model for Causal Discovery under External Interferences",
      "authors": [
        "Ruichu Cai",
        "Xiaokai Huang",
        "Wei Chen",
        "Zijian Li",
        "Zhifeng Hao"
      ],
      "abstract": "Inferring causal relationships from observed data is an important task, yet it becomes challenging when the data is subject to various external interferences. Most of these interferences are the additional effects of external factors on observed variables. Since these external factors are often unknown, we introduce latent variables to represent these unobserved factors that affect the observed data. Specifically, to capture the causal strength and adjacency information, we propose a new temporal latent variable structural causal model, incorporating causal strength and adjacency coefficients that represent the causal relationships between variables. Considering that expert knowledge can provide information about unknown interferences in certain scenarios, we develop a method that facilitates the incorporation of prior knowledge into parameter learning based on Variational Inference, to guide the model estimation. Experimental results demonstrate the stability and accuracy of our proposed method.",
      "pdf_url": "https://arxiv.org/pdf/2511.10031v1",
      "arxiv_url": "http://arxiv.org/abs/2511.10031v1",
      "published": "2025-11-13",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "AI-Integrated Decision Support System for Real-Time Market Growth Forecasting and Multi-Source Content Diffusion Analytics",
      "authors": [
        "Ziqing Yin",
        "Xuanjing Chen",
        "Xi Zhang"
      ],
      "abstract": "The rapid proliferation of AI-generated content (AIGC) has reshaped the dynamics of digital marketing and online consumer behavior. However, predicting the diffusion trajectory and market impact of such content remains challenging due to data heterogeneity, non linear propagation mechanisms, and evolving consumer interactions. This study proposes an AI driven Decision Support System (DSS) that integrates multi source data including social media streams, marketing expenditure records, consumer engagement logs, and sentiment dynamics using a hybrid Graph Neural Network (GNN) and Temporal Transformer framework. The model jointly learns the content diffusion structure and temporal influence evolution through a dual channel architecture, while causal inference modules disentangle the effects of marketing stimuli on return on investment (ROI) and market visibility. Experiments on large scale real-world datasets collected from multiple online platforms such as Twitter, TikTok, and YouTube advertising show that our system outperforms existing baselines in all six metrics. The proposed DSS enhances marketing decisions by providing interpretable real-time insights into AIGC driven content dissemination and market growth patterns.",
      "pdf_url": "https://arxiv.org/pdf/2511.09962v1",
      "arxiv_url": "http://arxiv.org/abs/2511.09962v1",
      "published": "2025-11-13",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.MM"
      ]
    },
    {
      "title": "NeuroLingua: A Language-Inspired Hierarchical Framework for Multimodal Sleep Stage Classification Using EEG and EOG",
      "authors": [
        "Mahdi Samaee",
        "Mehran Yazdi",
        "Daniel Massicotte"
      ],
      "abstract": "Automated sleep stage classification from polysomnography remains limited by the lack of expressive temporal hierarchies, challenges in multimodal EEG and EOG fusion, and the limited interpretability of deep learning models. We propose NeuroLingua, a language-inspired framework that conceptualizes sleep as a structured physiological language. Each 30-second epoch is decomposed into overlapping 3-second subwindows (\"tokens\") using a CNN-based tokenizer, enabling hierarchical temporal modeling through dual-level Transformers: intra-segment encoding of local dependencies and inter-segment integration across seven consecutive epochs (3.5 minutes) for extended context. Modality-specific embeddings from EEG and EOG channels are fused via a Graph Convolutional Network, facilitating robust multimodal integration. NeuroLingua is evaluated on the Sleep-EDF Expanded and ISRUC-Sleep datasets, achieving state-of-the-art results on Sleep-EDF (85.3% accuracy, 0.800 macro F1, and 0.796 Cohen's kappa) and competitive performance on ISRUC (81.9% accuracy, 0.802 macro F1, and 0.755 kappa), matching or exceeding published baselines in overall and per-class metrics. The architecture's attention mechanisms enhance the detection of clinically relevant sleep microevents, providing a principled foundation for future interpretability, explainability, and causal inference in sleep research. By framing sleep as a compositional language, NeuroLingua unifies hierarchical sequence modeling and multimodal fusion, advancing automated sleep staging toward more transparent and clinically meaningful applications.",
      "pdf_url": "https://arxiv.org/pdf/2511.09773v1",
      "arxiv_url": "http://arxiv.org/abs/2511.09773v1",
      "published": "2025-11-12",
      "categories": [
        "cs.LG",
        "eess.SP"
      ]
    },
    {
      "title": "Distributional Treatment Effect Estimation across Heterogeneous Sites via Optimal Transport",
      "authors": [
        "Borna Bateni",
        "Yubai Yuan",
        "Qi Xu",
        "Annie Qu"
      ],
      "abstract": "We propose a novel framework for synthesizing counterfactual treatment group data in a target site by integrating full treatment and control group data from a source site with control group data from the target. Departing from conventional average treatment effect estimation, our approach adopts a distributional causal inference perspective by modeling treatment and control as distinct probability measures on the source and target sites. We formalize the cross-site heterogeneity (effect modification) as a push-forward transformation that maps the joint feature-outcome distribution from the source to the target site. This transformation is learned by aligning the control group distributions between sites using an Optimal Transport-based procedure, and subsequently applied to the source treatment group to generate the synthetic target treatment distribution. Under general regularity conditions, we establish theoretical guarantees for the consistency and asymptotic convergence of the synthetic treatment group data to the true target distribution. Simulation studies across multiple data-generating scenarios and a real-world application to patient-derived xenograft data demonstrate that our framework robustly recovers the full distributional properties of treatment effects.",
      "pdf_url": "https://arxiv.org/pdf/2511.09759v1",
      "arxiv_url": "http://arxiv.org/abs/2511.09759v1",
      "published": "2025-11-12",
      "categories": [
        "stat.ME",
        "math.ST",
        "stat.ML"
      ]
    },
    {
      "title": "History Rhymes: Macro-Contextual Retrieval for Robust Financial Forecasting",
      "authors": [
        "Sarthak Khanna",
        "Armin Berger",
        "Muskaan Chopra",
        "Rafet Sifa"
      ],
      "abstract": "Financial markets are inherently non-stationary: structural breaks and macroeconomic regime shifts often cause forecasting models to fail when deployed out of distribution (OOD). Conventional multimodal approaches that simply fuse numerical indicators and textual sentiment rarely adapt to such shifts. We introduce macro-contextual retrieval, a retrieval-augmented forecasting framework that grounds each prediction in historically analogous macroeconomic regimes. The method jointly embeds macro indicators (e.g., CPI, unemployment, yield spread, GDP growth) and financial news sentiment in a shared similarity space, enabling causal retrieval of precedent periods during inference without retraining.\n  Trained on seventeen years of S&P 500 data (2007-2023) and evaluated OOD on AAPL (2024) and XOM (2024), the framework consistently narrows the CV to OOD performance gap. Macro-conditioned retrieval achieves the only positive out-of-sample trading outcomes (AAPL: PF=1.18, Sharpe=0.95; XOM: PF=1.16, Sharpe=0.61), while static numeric, text-only, and naive multimodal baselines collapse under regime shifts. Beyond metric gains, retrieved neighbors form interpretable evidence chains that correspond to recognizable macro contexts, such as inflationary or yield-curve inversion phases, supporting causal interpretability and transparency. By operationalizing the principle that \"financial history may not repeat, but it often rhymes,\" this work demonstrates that macro-aware retrieval yields robust, explainable forecasts under distributional change.\n  All datasets, models, and source code are publicly available.",
      "pdf_url": "https://arxiv.org/pdf/2511.09754v1",
      "arxiv_url": "http://arxiv.org/abs/2511.09754v1",
      "published": "2025-11-12",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Principled analysis of crossover designs: causal effects, efficient estimation, and robust inference",
      "authors": [
        "Zhichao Jiang",
        "Peng Ding"
      ],
      "abstract": "Crossover designs randomly assign each unit to receive a sequence of treatments. By comparing outcomes within the same unit, these designs can effectively eliminate between-unit variation and facilitate the identification of both instantaneous effects of current treatments and carryover effects from past treatments. They are widely used in traditional biomedical studies and are increasingly adopted in modern digital platforms. However, standard analyses of crossover designs often rely on strong parametric models, making inference vulnerable to model misspecification. This paper adopts a design-based framework to analyze general crossover designs. We make two main contributions. First, we use potential outcomes to formally define the causal estimands and assumptions on the data-generating process. For any given type of crossover design and assumptions on potential outcomes, we outline a procedure for identification and estimation, emphasizing the central role of the treatment assignment mechanism in design-based inference. Second, we unify the analysis of crossover designs using least squares, with restrictions on the coefficients and weights on the units. Based on the theory, we recommend the specification of the regression function, weighting scheme, and coefficient restrictions to assess identifiability, construct efficient estimators, and estimate variances in a unified fashion. Crucially, the least squares procedure is simple to implement, and yields not only consistent and efficient point estimates but also valid variance estimates even when the working regression model is misspecified.",
      "pdf_url": "https://arxiv.org/pdf/2511.09215v1",
      "arxiv_url": "http://arxiv.org/abs/2511.09215v1",
      "published": "2025-11-12",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "FedSDWC: Federated Synergistic Dual-Representation Weak Causal Learning for OOD",
      "authors": [
        "Zhenyuan Huang",
        "Hui Zhang",
        "Wenzhong Tang",
        "Haijun Yang"
      ],
      "abstract": "Amid growing demands for data privacy and advances in computational infrastructure, federated learning (FL) has emerged as a prominent distributed learning paradigm. Nevertheless, differences in data distribution (such as covariate and semantic shifts) severely affect its reliability in real-world deployments. To address this issue, we propose FedSDWC, a causal inference method that integrates both invariant and variant features. FedSDWC infers causal semantic representations by modeling the weak causal influence between invariant and variant features, effectively overcoming the limitations of existing invariant learning methods in accurately capturing invariant features and directly constructing causal representations. This approach significantly enhances FL's ability to generalize and detect OOD data. Theoretically, we derive FedSDWC's generalization error bound under specific conditions and, for the first time, establish its relationship with client prior distributions. Moreover, extensive experiments conducted on multiple benchmark datasets validate the superior performance of FedSDWC in handling covariate and semantic shifts. For example, FedSDWC outperforms FedICON, the next best baseline, by an average of 3.04% on CIFAR-10 and 8.11% on CIFAR-100.",
      "pdf_url": "https://arxiv.org/pdf/2511.09036v1",
      "arxiv_url": "http://arxiv.org/abs/2511.09036v1",
      "published": "2025-11-12",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Group-Theoretic Structure Governing Identifiability in Inverse Problems",
      "authors": [
        "Isshin Arai",
        "Tomoaki Itano"
      ],
      "abstract": "In physical systems possessing symmetry, reconstructing the underlying causal structure from observational data constitutes an inverse problem of fundamental importance. In this work, we formulate the inverse problem of causal inference within the framework of group-representation theory, clarifying the structure of the representation spaces to which the {\\it causality} and estimation maps belong. This formulation leads to both theoretical and practical limits of reconstructability (identifiability). We show that the local velocity-gradient tensor, regarded as a {\\it causal factor}, can be reconstructed from the orientational motion of suspended particles. In this setting, the estimation map must act as a group homomorphism between the observation and causal spaces, and the reconstructable subspace is constrained by the decomposition structure of the SO(3) representation. Based on this principle, we construct an SO(3)-equivariant neural network (implemented with the e3nn framework) and verify that the identifiability determined by the group-representation structure is reproduced in the actual learning process. These results demonstrate a fundamental principle that the group-representation structure determines the reconstructability (identifiability limit) in inverse problems of causal inference.",
      "pdf_url": "https://arxiv.org/pdf/2511.08995v1",
      "arxiv_url": "http://arxiv.org/abs/2511.08995v1",
      "published": "2025-11-12",
      "categories": [
        "math-ph"
      ]
    }
  ]
}