{
  "last_updated": "2025-07-03T00:55:34.371813",
  "papers": [
    {
      "title": "When Additive Noise Meets Unobserved Mediators: Bivariate Denoising Diffusion for Causal Discovery",
      "authors": [
        "Dominik Meier",
        "Sujai Hiremath",
        "Promit Ghosal",
        "Kyra Gan"
      ],
      "abstract": "Distinguishing cause and effect from bivariate observational data is a\nfoundational problem in many disciplines, but challenging without additional\nassumptions. Additive noise models (ANMs) are widely used to enable\nsample-efficient bivariate causal discovery. However, conventional ANM-based\nmethods fail when unobserved mediators corrupt the causal relationship between\nvariables. This paper makes three key contributions: first, we rigorously\ncharacterize why standard ANM approaches break down in the presence of\nunmeasured mediators. Second, we demonstrate that prior solutions for hidden\nmediation are brittle in finite sample settings, limiting their practical\nutility. To address these gaps, we propose Bivariate Denoising Diffusion (BiDD)\nfor causal discovery, a method designed to handle latent noise introduced by\nunmeasured mediators. Unlike prior methods that infer directionality through\nmean squared error loss comparisons, our approach introduces a novel\nindependence test statistic: during the noising and denoising processes for\neach variable, we condition on the other variable as input and evaluate the\nindependence of the predicted noise relative to this input. We prove asymptotic\nconsistency of BiDD under the ANM, and conjecture that it performs well under\nhidden mediation. Experiments on synthetic and real-world data demonstrate\nconsistent performance, outperforming existing methods in mediator-corrupted\nsettings while maintaining strong performance in mediator-free settings.",
      "pdf_url": "http://arxiv.org/pdf/2506.23374v1",
      "arxiv_url": "http://arxiv.org/abs/2506.23374v1",
      "published": "2025-06-29",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "CycleVAR: Repurposing Autoregressive Model for Unsupervised One-Step Image Translation",
      "authors": [
        "Yi Liu",
        "Shengqian Li",
        "Zuzeng Lin",
        "Feng Wang",
        "Si Liu"
      ],
      "abstract": "The current conditional autoregressive image generation methods have shown\npromising results, yet their potential remains largely unexplored in the\npractical unsupervised image translation domain, which operates without\nexplicit cross-domain correspondences. A critical limitation stems from the\ndiscrete quantization inherent in traditional Vector Quantization-based\nframeworks, which disrupts gradient flow between the Variational Autoencoder\ndecoder and causal Transformer, impeding end-to-end optimization during\nadversarial training in image space. To tackle this issue, we propose using\nSoftmax Relaxed Quantization, a novel approach that reformulates codebook\nselection as a continuous probability mixing process via Softmax, thereby\npreserving gradient propagation. Building upon this differentiable foundation,\nwe introduce CycleVAR, which reformulates image-to-image translation as\nimage-conditional visual autoregressive generation by injecting multi-scale\nsource image tokens as contextual prompts, analogous to prefix-based\nconditioning in language models. CycleVAR exploits two modes to generate the\ntarget image tokens, including (1) serial multi-step generation, enabling\niterative refinement across scales, and (2) parallel one-step generation\nsynthesizing all resolution outputs in a single forward pass. Experimental\nfindings indicate that the parallel one-step generation mode attains superior\ntranslation quality with quicker inference speed than the serial multi-step\nmode in unsupervised scenarios. Furthermore, both quantitative and qualitative\nresults indicate that CycleVAR surpasses previous state-of-the-art unsupervised\nimage translation models, \\textit{e}.\\textit{g}., CycleGAN-Turbo.",
      "pdf_url": "http://arxiv.org/pdf/2506.23347v1",
      "arxiv_url": "http://arxiv.org/abs/2506.23347v1",
      "published": "2025-06-29",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "Auto-Doubly Robust Estimation of Causal Effects on a Network",
      "authors": [
        "Jizhou Liu",
        "Dake Zhang",
        "Eric J. Tchetgen Tchetgen"
      ],
      "abstract": "This paper develops new methods for causal inference in observational studies\non a single large network of interconnected units, addressing two key\nchallenges: long-range dependence among units and the presence of general\ninterference. We introduce a novel network version of Augmented Inverse\nPropensity Weighted, which combines propensity score and outcome models defined\non the network to achieve doubly robust identification and estimation of both\ndirect and spillover causal effects. Under a network version of conditional\nignorability, the proposed approach identifies the expected potential outcome\nfor a unit given the treatment assignment vector for its network neighborhood\nup to a user-specified distance, while marginalizing over treatment assignments\nfor the rest of the network. By introducing two additional assumptions on the\noutcome, we establish a new doubly robust identification result for the\nexpected potential outcome under a hypothetical intervention on the treatment\nassignment vector for the entire network. Under a union of Chain Graph models -\none governing the propensity model and the other the outcome model - we propose\na corresponding semiparametric estimator based on parametric models naturally\narising from the chain graph representation of the network. We formally prove\nthat, under weak network dependence, the proposed estimators are asymptotically\nnormal and we characterize the impact of model misspecification on the\nasymptotic variance. Extensive simulation studies highlight the practical\nrelevance of our approach. We further demonstrate its application in an\nempirical analysis of the NNAHRAY study, evaluating the impact of incarceration\non individual socioeconomic outcomes in Brooklyn, New York.",
      "pdf_url": "http://arxiv.org/pdf/2506.23332v1",
      "arxiv_url": "http://arxiv.org/abs/2506.23332v1",
      "published": "2025-06-29",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "P-CRE-DML: A Novel Approach for Causal Inference in Non-Linear Panel Data",
      "authors": [
        "Amarendra Sharma"
      ],
      "abstract": "This paper introduces a novel Proxy-Enhanced Correlated Random Effects Double\nMachine Learning (P-CRE-DML) framework to estimate causal effects in panel data\nwith non-linearities and unobserved heterogeneity. Combining Double Machine\nLearning (DML, Chernozhukov et al., 2018), Correlated Random Effects (CRE,\nMundlak, 1978), and lagged variables (Arellano & Bond, 1991) and innovating\nwithin the CRE-DML framework (Chernozhukov et al., 2022; Clarke & Polselli,\n2025; Fuhr & Papies, 2024), we apply P-CRE-DML to investigate the effect of\nsocial trust on GDP growth across 89 countries (2010-2020). We find positive\nand statistically significant relationship between social trust and economic\ngrowth. This aligns with prior findings on trust-growth relationship (e.g.,\nKnack & Keefer, 1997). Furthermore, a Monte Carlo simulation demonstrates\nP-CRE-DML's advantage in terms of lower bias over CRE-DML and System GMM.\nP-CRE-DML offers a robust and flexible alternative for panel data causal\ninference, with applications beyond economic growth.",
      "pdf_url": "http://arxiv.org/pdf/2506.23297v1",
      "arxiv_url": "http://arxiv.org/abs/2506.23297v1",
      "published": "2025-06-29",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "Token Activation Map to Visually Explain Multimodal LLMs",
      "authors": [
        "Yi Li",
        "Hualiang Wang",
        "Xinpeng Ding",
        "Haonan Wang",
        "Xiaomeng Li"
      ],
      "abstract": "Multimodal large language models (MLLMs) are broadly empowering various\nfields. Despite their advancements, the explainability of MLLMs remains less\nexplored, hindering deeper understanding, model credibility, and effective\nvisualization. Unlike conventional vision models (e.g., CNNs, ViTs, CLIP) that\nproduce a single output, MLLMs generate sequences of tokens progressively,\nwhere each generated token depends on the previous context. Therefore, earlier\ncontext tokens can introduce redundant activations that interfere with the\nexplanation of later tokens beyond their original information. Existing studies\noften overlook this issue, but our observations reveal that these redundant\ncorrelations can significantly hurt the reliability of explanations. To address\nthis, we propose an estimated causal inference method to mitigate the\ninterference of context to achieve high-quality MLLM explanation, with a novel\nrank Gaussian filter to further reduce activation noises. We term this method\nToken Activation Map (TAM) to highlight the consideration of interactions\nbetween tokens. TAM also indicates that it excels at explaining multiple tokens\nof MLLM, which is different from the Class Activation Map (CAM) for a single\nprediction. Our TAM method significantly outperforms existing SoTA methods,\nshowcasing high-quality visualization results that can be utilized for various\nscenarios, such as object localization, failure case analysis, video\nvisualization, MLLMs visual comparison, and model understanding (e.g., color,\nshape, action, location, visual reasoning, multi-turn conversation, etc). The\ncode is available atgithub.com/xmed-lab/TAM.",
      "pdf_url": "http://arxiv.org/pdf/2506.23270v1",
      "arxiv_url": "http://arxiv.org/abs/2506.23270v1",
      "published": "2025-06-29",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ]
    },
    {
      "title": "Causal Inference in Panel Data with a Continuous Treatment",
      "authors": [
        "Zhiguo Xiao",
        "Peikai Wu"
      ],
      "abstract": "This paper proposes a framework that incorporates the two-way fixed effects\nmodel as a special case to conduct causal inference with a continuous\ntreatment. Treatments are allowed to change over time and potential outcomes\nare dependent on historical treatments. Regression models on potential\noutcomes, along with the sequentially conditional independence assumptions\n(SCIAs) are introduced to identify the treatment effects, which are measured by\naggre causal responses. Least squares and generalized method of moments (GMM)\nestimators are developed for model parameters, which are then used to estimate\nthe aggregate causal effects. We establish the asymptotic properties of these\naggregate estimators. Additionally, we propose employing directed acyclic\ngraphs (DAGs) to test the validity of the SCIAs. An application examining the\naid-growth relationship illustrates the proposed methodology.",
      "pdf_url": "http://arxiv.org/pdf/2506.23226v1",
      "arxiv_url": "http://arxiv.org/abs/2506.23226v1",
      "published": "2025-06-29",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Design-Based and Network Sampling-Based Uncertainties in Network Experiments",
      "authors": [
        "Kensuke Sakamoto",
        "Yuya Shimizu"
      ],
      "abstract": "OLS estimators are widely used in network experiments to estimate spillover\neffects via regressions on exposure mappings that summarize treatment and\nnetwork structure. We study the causal interpretation and inference of such OLS\nestimators when both design-based uncertainty in treatment assignment and\nsampling-based uncertainty in network links are present. We show that\ncorrelations among elements of the exposure mapping can contaminate the OLS\nestimand, preventing it from aggregating heterogeneous spillover effects for\nclear causal interpretation. We derive the estimator's asymptotic distribution\nand propose a network-robust variance estimator. Simulations and an empirical\napplication reveal sizable contamination bias and inflated spillover estimates.",
      "pdf_url": "http://arxiv.org/pdf/2506.22989v1",
      "arxiv_url": "http://arxiv.org/abs/2506.22989v1",
      "published": "2025-06-28",
      "categories": [
        "econ.EM",
        "stat.ME"
      ]
    },
    {
      "title": "Causal Inference for Aggregated Treatment",
      "authors": [
        "Carolina Caetano",
        "Gregorio Caetano",
        "Brantly Callaway",
        "Derek Dyal"
      ],
      "abstract": "In this paper, we study causal inference when the treatment variable is an\naggregation of multiple sub-treatment variables. Researchers often report\nmarginal causal effects for the aggregated treatment, implicitly assuming that\nthe target parameter corresponds to a well-defined average of sub-treatment\neffects. We show that, even in an ideal scenario for causal inference such as\nrandom assignment, the weights underlying this average have some key\nundesirable properties: they are not unique, they can be negative, and, holding\nall else constant, these issues become exponentially more likely to occur as\nthe number of sub-treatments increases and the support of each sub-treatment\ngrows. We propose approaches to avoid these problems, depending on whether or\nnot the sub-treatment variables are observed.",
      "pdf_url": "http://arxiv.org/pdf/2506.22885v1",
      "arxiv_url": "http://arxiv.org/abs/2506.22885v1",
      "published": "2025-06-28",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "Boosting CTC-Based ASR Using LLM-Based Intermediate Loss Regularization",
      "authors": [
        "Duygu Altinok"
      ],
      "abstract": "End-to-end (E2E) automatic speech recognition (ASR) systems have\nrevolutionized the field by integrating all components into a single neural\nnetwork, with attention-based encoder-decoder models achieving state-of-the-art\nperformance. However, their autoregressive decoding process limits inference\nspeed, making them unsuitable for real-time applications. In contrast,\nCTC-based models offer faster, non-autoregressive decoding but struggle to\nmodel linguistic dependencies effectively. Addressing this challenge, we\npropose a novel auxiliary loss framework called Language-Aware Intermediate\nLoss (LAIL) to enhance CTC-based ASR using the linguistic knowledge of large\nlanguage models (LLMs). By attaching connector layers to intermediate encoder\nlayers, LAIL maps outputs to the embedding space of an LLM and computes a\ncausal language modeling loss during training. This approach enhances\nlinguistic modeling while preserving the computational efficiency of CTC\ndecoding. Using the Conformer architecture and various LLaMA models, we\ndemonstrate significant improvements in Word Error Rate (WER) on the\nLibriSpeech, TEDLIUM2, and WSJ corpora, achieving state-of-the-art performance\nfor CTC-based ASR with minimal computational overhead.",
      "pdf_url": "http://arxiv.org/pdf/2506.22846v1",
      "arxiv_url": "http://arxiv.org/abs/2506.22846v1",
      "published": "2025-06-28",
      "categories": [
        "cs.CL",
        "cs.SD",
        "eess.AS"
      ]
    },
    {
      "title": "Doubly robust estimation of causal effects for random object outcomes with continuous treatments",
      "authors": [
        "Satarupa Bhattacharjee",
        "Bing Li",
        "Xiao Wu",
        "Lingzhou Xue"
      ],
      "abstract": "Causal inference is central to statistics and scientific discovery, enabling\nresearchers to identify cause-and-effect relationships beyond associations.\nWhile traditionally studied within Euclidean spaces, contemporary applications\nincreasingly involve complex, non-Euclidean data structures that reside in\nabstract metric spaces, known as random objects, such as images, shapes,\nnetworks, and distributions. This paper introduces a novel framework for causal\ninference with continuous treatments applied to non-Euclidean data. To address\nthe challenges posed by the lack of linear structures, we leverage Hilbert\nspace embeddings of the metric spaces to facilitate Fr\\'echet mean estimation\nand causal effect mapping. Motivated by a study on the impact of exposure to\nfine particulate matter on age-at-death distributions across U.S. counties, we\npropose a nonparametric, doubly-debiased causal inference approach for outcomes\nas random objects with continuous treatments. Our framework can accommodate\nmoderately high-dimensional vector-valued confounders and derive efficient\ninfluence functions for estimation to ensure both robustness and\ninterpretability. We establish rigorous asymptotic properties of the\ncross-fitted estimators and employ conformal inference techniques for\ncounterfactual outcome prediction. Validated through numerical experiments and\napplied to real-world environmental data, our framework extends causal\ninference methodologies to complex data structures, broadening its\napplicability across scientific disciplines.",
      "pdf_url": "http://arxiv.org/pdf/2506.22754v1",
      "arxiv_url": "http://arxiv.org/abs/2506.22754v1",
      "published": "2025-06-28",
      "categories": [
        "stat.ME",
        "econ.EM",
        "math.ST",
        "stat.AP",
        "stat.ML",
        "stat.TH"
      ]
    }
  ]
}