{
  "last_updated": "2025-12-15T00:59:25.467778",
  "papers": [
    {
      "title": "Topology Identification and Inference over Graphs",
      "authors": [
        "Gonzalo Mateos",
        "Yanning Shen",
        "Georgios B. Giannakis",
        "Ananthram Swami"
      ],
      "abstract": "Topology identification and inference of processes evolving over graphs arise in timely applications involving brain, transportation, financial, power, as well as social and information networks. This chapter provides an overview of graph topology identification and statistical inference methods for multidimensional relational data. Approaches for undirected links connecting graph nodes are outlined, going all the way from correlation metrics to covariance selection, and revealing ties with smooth signal priors. To account for directional (possibly causal) relations among nodal variables and address the limitations of linear time-invariant models in handling dynamic as well as nonlinear dependencies, a principled framework is surveyed to capture these complexities through judiciously selected kernels from a prescribed dictionary. Generalizations are also described via structural equations and vector autoregressions that can exploit attributes such as low rank, sparsity, acyclicity, and smoothness to model dynamic processes over possibly time-evolving topologies. It is argued that this approach supports both batch and online learning algorithms with convergence rate guarantees, is amenable to tensor (that is, multi-way array) formulations as well as decompositions that are well-suited for multidimensional network data, and can seamlessly leverage high-order statistical information.",
      "pdf_url": "https://arxiv.org/pdf/2512.10183v1",
      "arxiv_url": "http://arxiv.org/abs/2512.10183v1",
      "published": "2025-12-11",
      "categories": [
        "eess.SP",
        "cs.SI",
        "stat.ME",
        "stat.ML"
      ]
    },
    {
      "title": "Inference for Batched Adaptive Experiments",
      "authors": [
        "Jan Kemper",
        "Davud Rostam-Afschar"
      ],
      "abstract": "The advantages of adaptive experiments have led to their rapid adoption in economics, other fields, as well as among practitioners. However, adaptive experiments pose challenges for causal inference. This note suggests a BOLS (batched ordinary least squares) test statistic for inference of treatment effects in adaptive experiments. The statistic provides a precision-equalizing aggregation of per-period treatment-control differences under heteroskedasticity. The combined test statistic is a normalized average of heteroskedastic per-period z-statistics and can be used to construct asymptotically valid confidence intervals. We provide simulation results comparing rejection rates in the typical case with few treatment periods and few (or many) observations per batch.",
      "pdf_url": "https://arxiv.org/pdf/2512.10156v1",
      "arxiv_url": "http://arxiv.org/abs/2512.10156v1",
      "published": "2025-12-10",
      "categories": [
        "econ.EM",
        "cs.LG",
        "stat.ME"
      ]
    },
    {
      "title": "Rethinking Causal Discovery Through the Lens of Exchangeability",
      "authors": [
        "Tiago Brogueira",
        "Mário Figueiredo"
      ],
      "abstract": "Causal discovery methods have traditionally been developed under two distinct regimes: independent and identically distributed (i.i.d.) and timeseries data, each governed by separate modelling assumptions. In this paper, we argue that the i.i.d. setting can and should be reframed in terms of exchangeability, a strictly more general symmetry principle. We present the implications of this reframing, alongside two core arguments: (1) a conceptual argument, based on extending the dependency of experimental causal inference on exchangeability to causal discovery; and (2) an empirical argument, showing that many existing i.i.d. causal-discovery methods are predicated on exchangeability assumptions, and that the sole extensive widely-used real-world \"i.i.d.\" benchmark (the Tübingen dataset) consists mainly of exchangeable (and not i.i.d.) examples. Building on this insight, we introduce a novel synthetic dataset that enforces only the exchangeability assumption, without imposing the stronger i.i.d. assumption. We show that our exchangeable synthetic dataset mirrors the statistical structure of the real-world \"i.i.d.\" dataset more closely than all other i.i.d. synthetic datasets. Furthermore, we demonstrate the predictive capability of this dataset by proposing a neural-network-based causal-discovery algorithm trained exclusively on our synthetic dataset, and which performs similarly to other state-of-the-art i.i.d. methods on the real-world benchmark.",
      "pdf_url": "https://arxiv.org/pdf/2512.10152v1",
      "arxiv_url": "http://arxiv.org/abs/2512.10152v1",
      "published": "2025-12-10",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "Microfoundations and the Causal Interpretation of Price-Exposure Designs",
      "authors": [
        "Luca Moreno-Louzada",
        "Guilherme Figueira",
        "Pedro Picchetti"
      ],
      "abstract": "This paper studies regional exposure designs that use commodity prices as instruments to study local effects of aggregate shocks. Unlike standard shift share designs that leverage differential exposure to many shocks, the price exposure relies on exogenous variation from a single shock, leading to challenges for both identification and inference. We motivate the design using a multi sector labor model. Under the model and a potential outcomes framework, we characterize the 2SLS and TWFE estimands as weighted averages of region and sector specific effects plus contamination terms driven by the covariance structure of prices and by general-equilibrium output responses. We derive conditions under which these estimands have a clear causal interpretation and provide simple sensitivity analysis procedures for violations. Finally, we show that standard inference procedures suffer from an overrejection problem in price-exposure designs. We derive a new standard error estimator and show its desirable finite-sample properties through Monte Carlo simulations. In an application to gold mining and homicides in the Amazon, the price exposure standard errors are roughly twice as large as conventional clustered standard errors, making the main effect statistically insignificant.",
      "pdf_url": "https://arxiv.org/pdf/2512.10076v1",
      "arxiv_url": "http://arxiv.org/abs/2512.10076v1",
      "published": "2025-12-10",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "A Conversation with Mike West",
      "authors": [
        "Hedibert F. Lopes",
        "Filippo Ascolani"
      ],
      "abstract": "Mike West is currently the Arts & Sciences Distinguished Professor Emeritus of Statistics and Decision Sciences at Duke University. Mike's research in Bayesian analysis spans multiple interlinked areas: theory and methods of dynamic models in time series analysis, foundations of inference and decision analysis, multivariate and latent structure analysis, stochastic computation and optimisation, among others. Inter-disciplinary R&D has ranged across applications in commercial forecasting, dynamic networks, finance, econometrics, signal processing, climatology, systems biology, genomics and neuroscience, among other areas. Among Mike's currently active research areas are forecasting, causal prediction and decision analysis in business, economic policy and finance, as well as in personal decision making. Mike led the development of academic statistics at Duke University from 1990-2002, and has been broadly engaged in professional leadership elsewhere. He is past president of the International Society for Bayesian Analysis (ISBA), and has served in founding roles and as board member for several professional societies, national and international centres and institutes. Recipient of numerous awards, Mike has been active in research with various companies, banks, government agencies and academic centres, co-founder of a successful biotechnology company, and board member for several financial and IT companies. He has published 4 books, several edited volumes and over 200 papers. Mike has worked with many undergraduate and Master's research students, and as of 2025 has mentored around 65 primary PhD students and postdoctoral associates who moved to academic, industrial or governmental positions involving advanced statistical and data science research.",
      "pdf_url": "https://arxiv.org/pdf/2512.09790v1",
      "arxiv_url": "http://arxiv.org/abs/2512.09790v1",
      "published": "2025-12-10",
      "categories": [
        "stat.OT"
      ]
    },
    {
      "title": "Temporal Windows of Integration for Multisensory Wireless Systems as Enablers of Physical AI",
      "authors": [
        "Anup Mishra",
        "João Henrique Inacio de Souza",
        "Petar Popovski"
      ],
      "abstract": "Physical artificial intelligence (AI) refers to the AI that interacts with the physical world in real time. Similar to multisensory perception, Physical AI makes decisions based on multimodal updates from sensors and devices. Physical AI thus operates with a finite spatial footprint of its sensory tributaries. The multimodal updates traverse heterogeneous and unreliable paths, involving wireless links. Throughput or latency guarantees do not ensure correct decision-making, as misaligned, misordered, or stale inputs still yield wrong inferences. Preserving decision-time coherence hinges on three timing primitives at the network-application interface: (i) simultaneity, a short coincidence window that groups measurements as co-temporal, (ii) causality, path-wise delivery that never lets a consequence precede its precursor, and (iii) usefulness, a validity horizon that drops information too stale to influence the current action. In this work, we focus on usefulness and adopt temporal window of integration (TWI)-Causality: the TWI enforces decision-time usefulness by assuming path-wise causal consistency and cross-path simultaneity are handled upstream. We model end-to-end path delay as the sum of sensing/propagation, computation, and access/transmission latencies, and formulate network design as minimizing the validity horizon under a delivery reliability constraint. In effect, this calibrates delay-reliability budgets for a timing-aware system operating over sensors within a finite spatial footprint. The joint choice of horizon and per-path reliability is cast as a convex optimization problem, solved to global optimality to obtain the minimal horizon and per-path allocation of reliability. This is compared favourably to a benchmark based on uniform-after-threshold allocation. Overall, this study contributes to timing-aware Physical AI in next-generation networks.",
      "pdf_url": "https://arxiv.org/pdf/2512.09589v1",
      "arxiv_url": "http://arxiv.org/abs/2512.09589v1",
      "published": "2025-12-10",
      "categories": [
        "eess.SP"
      ]
    },
    {
      "title": "Multiply-robust Estimator of Cumulative Incidence Function Difference for Right-Censored Competing Risks Data",
      "authors": [
        "Yifei Tian",
        "Ying Wu"
      ],
      "abstract": "In causal inference, estimating the average treatment effect is a central objective, and in the context of competing risks data, this effect can be quantified by the cause-specific cumulative incidence function (CIF) difference. While doubly robust estimators give a more robust way to estimate the causal effect from the observational study, they remain inconsistent if both models are misspecified. To improve the robustness, we develop a multiply robust estimator for the difference in cause-specific CIFs using right-censored competing risks data. The proposed framework integrates the pseudo-value approach, which transforms the censored, time-dependent CIF into a complete-data outcome, with the multiply robust estimation framework. By specifying multiple candidate models for both the propensity score and the outcome regression, the resulting estimator is consistent and asymptotically unbiased, provided that at least one of the multiple propensity score or outcome regression models is correctly specified. Simulation studies show our multiply robust estimator remains virtually unbiased and maintains nominal coverage rates under various model misspecification scenarios and a wide range of choices for the censoring rate. Finally, the proposed multiply robust model is illustrated using the Right Heart Catheterization dataset.",
      "pdf_url": "https://arxiv.org/pdf/2512.09433v1",
      "arxiv_url": "http://arxiv.org/abs/2512.09433v1",
      "published": "2025-12-10",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Prenatal alcohol exposure and child cognition: semi-continuous exposures, causal inference and evidence synthesis",
      "authors": [
        "Xiaoya Wang",
        "Richard J. Cook",
        "Yeying Zhu",
        "Tugba Akkaya-Hocagil",
        "R. Colin Carter",
        "Sandra W. Jacobson",
        "Joseph L. Jacobson",
        "Louise M. Ryan"
      ],
      "abstract": "We address the challenge of causal inference status and the dose-response effects with a semi-continuous exposure. A two-stage approach is proposed using estimating equation for multiple outcomes with large sample properties derived for the resulting estimators. Homogeneity tests are developed to assess whether causal effects of exposure status and the dose-response effects are the same across multiple outcomes. A global homogeneity test is also developed to assess whether the effect of exposure status (exposed/not exposed) and the dose-response effect of the continuous exposure level are each equal across all outcomes. The methods of estimation and testing are rigorously evaluated in simulation studies and applied to a motivating study on the effects of prenatal alcohol exposure on childhood cognition defined by executive function (EF), academic achievement in math, and learning and memory (LM).",
      "pdf_url": "https://arxiv.org/pdf/2512.09237v1",
      "arxiv_url": "http://arxiv.org/abs/2512.09237v1",
      "published": "2025-12-10",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Complementary strengths of the Neyman-Rubin and graphical causal frameworks",
      "authors": [
        "Tetiana Gorbach",
        "Xavier de Luna",
        "Juha Karvanen",
        "Ingeborg Waernbaum"
      ],
      "abstract": "This article contributes to the discussion on the relationship between the Neyman-Rubin and the graphical frameworks for causal inference. We present specific examples of data-generating mechanisms - such as those involving undirected or deterministic relationships and cycles - where analyses using a directed acyclic graph are challenging, but where the tools from the Neyman-Rubin causal framework are readily applicable. We also provide examples of data-generating mechanisms with M-bias, trapdoor variables, and complex front-door structures, where the application of the Neyman-Rubin approach is complicated, but the graphical approach is directly usable. The examples offer insights into commonly used causal inference frameworks and aim to improve comprehension of the languages for causal reasoning among a broad audience.",
      "pdf_url": "https://arxiv.org/pdf/2512.09130v1",
      "arxiv_url": "http://arxiv.org/abs/2512.09130v1",
      "published": "2025-12-09",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Prediction Intervals for Individual Treatment Effects in a Multiple Decision Point Framework using Conformal Inference",
      "authors": [
        "Swaraj Bose",
        "Walter Dempsey"
      ],
      "abstract": "Accurately quantifying uncertainty of individual treatment effects (ITEs) across multiple decision points is crucial for personalized decision-making in fields such as healthcare, finance, education, and online marketplaces. Previous work has focused on predicting non-causal longitudinal estimands or constructing prediction bands for ITEs using cross-sectional data based on exchangeability assumptions. We propose a novel method for constructing prediction intervals using conformal inference techniques for time-varying ITEs with weaker assumptions than prior literature. We guarantee a lower bound for coverage, which is dependent on the degree of non-exchangeability in the data. Although our method is broadly applicable across decision-making contexts, we support our theoretical claims with simulations emulating micro-randomized trials (MRTs) -- a sequential experimental design for mobile health (mHealth) studies. We demonstrate the practical utility of our method by applying it to a real-world MRT - the Intern Health Study (IHS).",
      "pdf_url": "https://arxiv.org/pdf/2512.08828v1",
      "arxiv_url": "http://arxiv.org/abs/2512.08828v1",
      "published": "2025-12-09",
      "categories": [
        "stat.ME",
        "stat.ML"
      ]
    }
  ]
}