{
  "last_updated": "2025-05-14T00:53:15.887845",
  "papers": [
    {
      "title": "Nonparametric Instrumental Variable Inference with Many Weak Instruments",
      "authors": [
        "Lars van der Laan",
        "Nathan Kallus",
        "Aurélien Bibaut"
      ],
      "abstract": "We study inference on linear functionals in the nonparametric instrumental\nvariable (NPIV) problem with a discretely-valued instrument under a\nmany-weak-instruments asymptotic regime, where the number of instrument values\ngrows with the sample size. A key motivating example is estimating long-term\ncausal effects in a new experiment with only short-term outcomes, using past\nexperiments to instrument for the effect of short- on long-term outcomes. Here,\nthe assignment to a past experiment serves as the instrument: we have many past\nexperiments but only a limited number of units in each. Since the structural\nfunction is nonparametric but constrained by only finitely many moment\nrestrictions, point identification typically fails. To address this, we\nconsider linear functionals of the minimum-norm solution to the moment\nrestrictions, which is always well-defined. As the number of instrument levels\ngrows, these functionals define an approximating sequence to a target\nfunctional, replacing point identification with a weaker asymptotic notion\nsuited to discrete instruments. Extending the Jackknife Instrumental Variable\nEstimator (JIVE) beyond the classical parametric setting, we propose npJIVE, a\nnonparametric estimator for solutions to linear inverse problems with many weak\ninstruments. We construct automatic debiased machine learning estimators for\nlinear functionals of both the structural function and its minimum-norm\nprojection, and establish their efficiency in the many-weak-instruments regime.",
      "pdf_url": "http://arxiv.org/pdf/2505.07729v1",
      "arxiv_url": "http://arxiv.org/abs/2505.07729v1",
      "published": "2025-05-12",
      "categories": [
        "stat.ME",
        "math.ST",
        "stat.ML",
        "stat.TH"
      ]
    },
    {
      "title": "Generative Pre-trained Autoregressive Diffusion Transformer",
      "authors": [
        "Yuan Zhang",
        "Jiacheng Jiang",
        "Guoqing Ma",
        "Zhiying Lu",
        "Haoyang Huang",
        "Jianlong Yuan",
        "Nan Duan"
      ],
      "abstract": "In this work, we present GPDiT, a Generative Pre-trained Autoregressive\nDiffusion Transformer that unifies the strengths of diffusion and\nautoregressive modeling for long-range video synthesis, within a continuous\nlatent space. Instead of predicting discrete tokens, GPDiT autoregressively\npredicts future latent frames using a diffusion loss, enabling natural modeling\nof motion dynamics and semantic consistency across frames. This continuous\nautoregressive framework not only enhances generation quality but also endows\nthe model with representation capabilities. Additionally, we introduce a\nlightweight causal attention variant and a parameter-free rotation-based\ntime-conditioning mechanism, improving both the training and inference\nefficiency. Extensive experiments demonstrate that GPDiT achieves strong\nperformance in video generation quality, video representation ability, and\nfew-shot learning tasks, highlighting its potential as an effective framework\nfor video modeling in continuous space.",
      "pdf_url": "http://arxiv.org/pdf/2505.07344v1",
      "arxiv_url": "http://arxiv.org/abs/2505.07344v1",
      "published": "2025-05-12",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "GMM with Many Weak Moment Conditions and Nuisance Parameters: General Theory and Applications to Causal Inference",
      "authors": [
        "Rui Wang",
        "Kwun Chuen Gary Chan",
        "Ting Ye"
      ],
      "abstract": "Weak identification is a common issue for many statistical problems -- for\nexample, when instrumental variables are weakly correlated with treatment, or\nwhen proxy variables are weakly correlated with unmeasured confounders. Under\nweak identification, standard estimation methods, such as the generalized\nmethod of moments (GMM), can have sizeable bias in finite samples or even\nasymptotically. In addition, many practical settings involve a growing number\nof nuisance parameters, adding further complexity to the problem. In this\npaper, we study estimation and inference under a general nonlinear moment model\nwith many weak moment conditions and many nuisance parameters. To obtain\ndebiased inference for finite-dimensional target parameters, we demonstrate\nthat Neyman orthogonality plays a stronger role than in conventional settings\nwith strong identification. We study a general two-step debiasing estimator\nthat allows for possibly nonparametric first-step estimation of nuisance\nparameters, and we establish its consistency and asymptotic normality under a\nmany weak moment asymptotic regime. Our theory accommodates both\nhigh-dimensional moment conditions and infinite-dimensional nuisance\nparameters. We provide high-level assumptions for a general setting and discuss\nspecific applications to the problems of estimation and inference with weak\ninstruments and weak proxies.",
      "pdf_url": "http://arxiv.org/pdf/2505.07295v1",
      "arxiv_url": "http://arxiv.org/abs/2505.07295v1",
      "published": "2025-05-12",
      "categories": [
        "math.ST",
        "stat.ME",
        "stat.TH"
      ]
    },
    {
      "title": "Causal View of Time Series Imputation: Some Identification Results on Missing Mechanism",
      "authors": [
        "Ruichu Cai",
        "Kaitao Zheng",
        "Junxian Huang",
        "Zijian Li",
        "Zhengming Chen",
        "Boyan Xu",
        "Zhifeng Hao"
      ],
      "abstract": "Time series imputation is one of the most challenge problems and has broad\napplications in various fields like health care and the Internet of Things.\nExisting methods mainly aim to model the temporally latent dependencies and the\ngeneration process from the observed time series data. In real-world scenarios,\ndifferent types of missing mechanisms, like MAR (Missing At Random), and MNAR\n(Missing Not At Random) can occur in time series data. However, existing\nmethods often overlook the difference among the aforementioned missing\nmechanisms and use a single model for time series imputation, which can easily\nlead to misleading results due to mechanism mismatching. In this paper, we\npropose a framework for time series imputation problem by exploring Different\nMissing Mechanisms (DMM in short) and tailoring solutions accordingly.\nSpecifically, we first analyze the data generation processes with temporal\nlatent states and missing cause variables for different mechanisms.\nSequentially, we model these generation processes via variational inference and\nestimate prior distributions of latent variables via normalizing flow-based\nneural architecture. Furthermore, we establish identifiability results under\nthe nonlinear independent component analysis framework to show that latent\nvariables are identifiable. Experimental results show that our method surpasses\nexisting time series imputation techniques across various datasets with\ndifferent missing mechanisms, demonstrating its effectiveness in real-world\napplications.",
      "pdf_url": "http://arxiv.org/pdf/2505.07180v1",
      "arxiv_url": "http://arxiv.org/abs/2505.07180v1",
      "published": "2025-05-12",
      "categories": [
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "Causal knowledge graph analysis identifies adverse drug effects",
      "authors": [
        "Sumyyah Toonsi",
        "Paul Schofield",
        "Robert Hoehndorf"
      ],
      "abstract": "Knowledge graphs and structural causal models have each proven valuable for\norganizing biomedical knowledge and estimating causal effects, but remain\nlargely disconnected: knowledge graphs encode qualitative relationships\nfocusing on facts and deductive reasoning without formal probabilistic\nsemantics, while causal models lack integration with background knowledge in\nknowledge graphs and have no access to the deductive reasoning capabilities\nthat knowledge graphs provide. To bridge this gap, we introduce a novel\nformulation of Causal Knowledge Graphs (CKGs) which extend knowledge graphs\nwith formal causal semantics, preserving their deductive capabilities while\nenabling principled causal inference. CKGs support deconfounding via explicitly\nmarked causal edges and facilitate hypothesis formulation aligned with both\nencoded and entailed background knowledge. We constructed a Drug-Disease CKG\n(DD-CKG) integrating disease progression pathways, drug indications,\nside-effects, and hierarchical disease classification to enable automated\nlarge-scale mediation analysis. Applied to UK Biobank and MIMIC-IV cohorts, we\ntested whether drugs mediate effects between indications and downstream disease\nprogression, adjusting for confounders inferred from the DD-CKG. Our approach\nsuccessfully reproduced known adverse drug reactions with high precision while\nidentifying previously undocumented significant candidate adverse effects.\nFurther validation through side effect similarity analysis demonstrated that\ncombining our predicted drug effects with established databases significantly\nimproves the prediction of shared drug indications, supporting the clinical\nrelevance of our novel findings. These results demonstrate that our methodology\nprovides a generalizable, knowledge-driven framework for scalable causal\ninference.",
      "pdf_url": "http://arxiv.org/pdf/2505.06949v1",
      "arxiv_url": "http://arxiv.org/abs/2505.06949v1",
      "published": "2025-05-11",
      "categories": [
        "cs.AI",
        "q-bio.BM"
      ]
    },
    {
      "title": "Beyond Patterns: Harnessing Causal Logic for Autonomous Driving Trajectory Prediction",
      "authors": [
        "Bonan Wang",
        "Haicheng Liao",
        "Chengyue Wang",
        "Bin Rao",
        "Yanchen Guan",
        "Guyang Yu",
        "Jiaxun Zhang",
        "Songning Lai",
        "Chengzhong Xu",
        "Zhenning Li"
      ],
      "abstract": "Accurate trajectory prediction has long been a major challenge for autonomous\ndriving (AD). Traditional data-driven models predominantly rely on statistical\ncorrelations, often overlooking the causal relationships that govern traffic\nbehavior. In this paper, we introduce a novel trajectory prediction framework\nthat leverages causal inference to enhance predictive robustness,\ngeneralization, and accuracy. By decomposing the environment into spatial and\ntemporal components, our approach identifies and mitigates spurious\ncorrelations, uncovering genuine causal relationships. We also employ a\nprogressive fusion strategy to integrate multimodal information, simulating\nhuman-like reasoning processes and enabling real-time inference. Evaluations on\nfive real-world datasets--ApolloScape, nuScenes, NGSIM, HighD, and\nMoCAD--demonstrate our model's superiority over existing state-of-the-art\n(SOTA) methods, with improvements in key metrics such as RMSE and FDE. Our\nfindings highlight the potential of causal reasoning to transform trajectory\nprediction, paving the way for robust AD systems.",
      "pdf_url": "http://arxiv.org/pdf/2505.06856v1",
      "arxiv_url": "http://arxiv.org/abs/2505.06856v1",
      "published": "2025-05-11",
      "categories": [
        "cs.AI",
        "cs.RO"
      ]
    },
    {
      "title": "A logic for instrumental obligation",
      "authors": [
        "Jialiang Yan",
        "Qingyu He"
      ],
      "abstract": "This paper develops a logic based on causal inferences to formally capture\nthe concept of instrumental obligation. We establish a causal deontic model\nthat extends causal models with priority structures, allowing us to represent\nboth the instrumental and deontic aspects of an obligation. In this framework,\ninstrumental obligation is defined as a derived notion through intervention\nformulas of causal reasoning, where an action is considered obligatory if it is\nthe best way to achieve the goal. We provide a sound and complete axiomatic\nsystem and show that the logic is NP-complete. The concept of instrumental\npermission is also taken into account in the model.",
      "pdf_url": "http://arxiv.org/pdf/2505.06824v1",
      "arxiv_url": "http://arxiv.org/abs/2505.06824v1",
      "published": "2025-05-11",
      "categories": [
        "math.LO"
      ]
    },
    {
      "title": "Hillclimb-Causal Inference: A Data-Driven Approach to Identify Causal Pathways Among Parental Behaviors, Genetic Risk, and Externalizing Behaviors in Children",
      "authors": [
        "Mengman Wei",
        "Qian Peng"
      ],
      "abstract": "Motivation: Externalizing behaviors in children, such as aggression,\nhyperactivity, and defiance, are influenced by complex interplays between\ngenetic predispositions and environmental factors, particularly parental\nbehaviors. Unraveling these intricate causal relationships can benefit from the\nuse of robust data-driven methods.\n  Methods: We developed a method called Hillclimb-Causal Inference, a causal\ndiscovery approach that integrates the Hill Climb Search algorithm with a\ncustomized Linear Gaussian Bayesian Information Criterion (BIC). This method\nwas applied to data from the Adolescent Brain Cognitive Development (ABCD)\nStudy, which included parental behavior assessments, children's genotypes, and\nexternalizing behavior measures. We performed dimensionality reduction to\naddress multicollinearity among parental behaviors and assessed children's\ngenetic risk for externalizing disorders using polygenic risk scores (PRS),\nwhich were computed based on GWAS summary statistics from independent cohorts.\nOnce the causal pathways were identified, we employed structural equation\nmodeling (SEM) to quantify the relationships within the model.\n  Results: We identified prominent causal pathways linking parental behaviors\nto children's externalizing outcomes. Parental alcohol misuse and broader\nbehavioral issues exhibited notably stronger direct effects (0.33 and 0.20,\nrespectively) compared to children's polygenic risk scores (0.07). Moreover,\nwhen considering both direct and indirect paths, parental substance misuse\n(alcohol, drug, and tobacco) collectively resulted in a total effect exceeding\n1.1 on externalizing behaviors. Bootstrap and sensitivity analyses further\nvalidated the robustness of these findings.",
      "pdf_url": "http://arxiv.org/pdf/2505.06784v1",
      "arxiv_url": "http://arxiv.org/abs/2505.06784v1",
      "published": "2025-05-10",
      "categories": [
        "q-bio.QM"
      ]
    },
    {
      "title": "dcFCI: Robust Causal Discovery Under Latent Confounding, Unfaithfulness, and Mixed Data",
      "authors": [
        "Adèle H. Ribeiro",
        "Dominik Heider"
      ],
      "abstract": "Causal discovery is central to inferring causal relationships from\nobservational data. In the presence of latent confounding, algorithms such as\nFast Causal Inference (FCI) learn a Partial Ancestral Graph (PAG) representing\nthe true model's Markov Equivalence Class. However, their correctness\ncritically depends on empirical faithfulness, the assumption that observed\n(in)dependencies perfectly reflect those of the underlying causal model, which\noften fails in practice due to limited sample sizes. To address this, we\nintroduce the first nonparametric score to assess a PAG's compatibility with\nobserved data, even with mixed variable types. This score is both necessary and\nsufficient to characterize structural uncertainty and distinguish between\ndistinct PAGs. We then propose data-compatible FCI (dcFCI), the first hybrid\ncausal discovery algorithm to jointly address latent confounding, empirical\nunfaithfulness, and mixed data types. dcFCI integrates our score into an\n(Anytime)FCI-guided search that systematically explores, ranks, and validates\ncandidate PAGs. Experiments on synthetic and real-world scenarios demonstrate\nthat dcFCI significantly outperforms state-of-the-art methods, often recovering\nthe true PAG even in small and heterogeneous datasets. Examining top-ranked\nPAGs further provides valuable insights into structural uncertainty, supporting\nmore robust and informed causal reasoning and decision-making.",
      "pdf_url": "http://arxiv.org/pdf/2505.06542v1",
      "arxiv_url": "http://arxiv.org/abs/2505.06542v1",
      "published": "2025-05-10",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ]
    },
    {
      "title": "Semiparametric semi-supervised learning for general targets under distribution shift and decaying overlap",
      "authors": [
        "Lorenzo Testa",
        "Qi Xu",
        "Jing Lei",
        "Kathryn Roeder"
      ],
      "abstract": "In modern scientific applications, large volumes of covariate data are\nreadily available, while outcome labels are costly, sparse, and often subject\nto distribution shift. This asymmetry has spurred interest in semi-supervised\n(SS) learning, but most existing approaches rely on strong assumptions -- such\nas missing completely at random (MCAR) labeling or strict positivity -- that\nput substantial limitations on their practical usefulness. In this work, we\nintroduce a general semiparametric framework for estimation and inference in SS\nsettings where labels are missing at random (MAR) and the overlap may vanish as\nsample size increases. Our framework accommodates a wide range of smooth\nstatistical targets -- including means, linear coefficients, quantiles, and\ncausal effects -- and remains valid under high-dimensional nuisance estimation\nand distributional shift between labeled and unlabeled samples. We construct\nestimators that are doubly robust and asymptotically normal by deriving\ninfluence functions under this decaying MAR-SS regime. A key insight is that\nclassical root-$n$ convergence fails under vanishing overlap; we instead\nprovide corrected asymptotic rates that capture the impact of the decay in\noverlap. We validate our theory through simulations and demonstrate practical\nutility in real-world applications on the internet of things and breast cancer\nwhere labeled data are scarce.",
      "pdf_url": "http://arxiv.org/pdf/2505.06452v1",
      "arxiv_url": "http://arxiv.org/abs/2505.06452v1",
      "published": "2025-05-09",
      "categories": [
        "math.ST",
        "stat.TH"
      ]
    }
  ]
}