{
  "last_updated": "2025-11-11T00:54:30.880699",
  "papers": [
    {
      "title": "The Causal Round Trip: Generating Authentic Counterfactuals by Eliminating Information Loss",
      "authors": [
        "Rui Wu",
        "Lizheng Wang",
        "Yongjun Li"
      ],
      "abstract": "Judea Pearl's vision of Structural Causal Models (SCMs) as engines for\ncounterfactual reasoning hinges on faithful abduction: the precise inference of\nlatent exogenous noise. For decades, operationalizing this step for complex,\nnon-linear mechanisms has remained a significant computational challenge. The\nadvent of diffusion models, powerful universal function approximators, offers a\npromising solution. However, we argue that their standard design, optimized for\nperceptual generation over logical inference, introduces a fundamental flaw for\nthis classical problem: an inherent information loss we term the Structural\nReconstruction Error (SRE). To address this challenge, we formalize the\nprinciple of Causal Information Conservation (CIC) as the necessary condition\nfor faithful abduction. We then introduce BELM-MDCM, the first diffusion-based\nframework engineered to be causally sound by eliminating SRE by construction\nthrough an analytically invertible mechanism. To operationalize this framework,\na Targeted Modeling strategy provides structural regularization, while a Hybrid\nTraining Objective instills a strong causal inductive bias. Rigorous\nexperiments demonstrate that our Zero-SRE framework not only achieves\nstate-of-the-art accuracy but, more importantly, enables the high-fidelity,\nindividual-level counterfactuals required for deep causal inquiries. Our work\nprovides a foundational blueprint that reconciles the power of modern\ngenerative models with the rigor of classical causal theory, establishing a new\nand more rigorous standard for this emerging field.",
      "pdf_url": "http://arxiv.org/pdf/2511.05236v1",
      "arxiv_url": "http://arxiv.org/abs/2511.05236v1",
      "published": "2025-11-07",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "Estimating Bidirectional Causal Effects with Large Scale Online Kernel Learning",
      "authors": [
        "Masahiro Tanaka"
      ],
      "abstract": "In this study, a scalable online kernel learning framework is proposed for\nestimating bidirectional causal effects in systems characterized by mutual\ndependence and heteroskedasticity. Traditional causal inference often focuses\non unidirectional effects, overlooking the common bidirectional relationships\nin real-world phenomena. Building on heteroskedasticity-based identification,\nthe proposed method integrates a quasi-maximum likelihood estimator for\nsimultaneous equation models with large scale online kernel learning. It\nemploys random Fourier feature approximations to flexibly model nonlinear\nconditional means and variances, while an adaptive online gradient descent\nalgorithm ensures computational efficiency for streaming and high-dimensional\ndata. Results from extensive simulations demonstrate that the proposed method\nachieves superior accuracy and stability than single equation and polynomial\napproximation baselines, exhibiting lower bias and root mean squared error\nacross various data-generating processes. These results confirm that the\nproposed approach effectively captures complex bidirectional causal effects\nwith near-linear computational scaling. By combining econometric identification\nwith modern machine learning techniques, the proposed framework offers a\npractical, scalable, and theoretically grounded solution for large scale causal\ninference in natural/social science, policy making, business, and industrial\napplications.",
      "pdf_url": "http://arxiv.org/pdf/2511.05050v1",
      "arxiv_url": "http://arxiv.org/abs/2511.05050v1",
      "published": "2025-11-07",
      "categories": [
        "stat.ML",
        "cs.LG",
        "stat.ME"
      ]
    },
    {
      "title": "Causal Structure and Representation Learning with Biomedical Applications",
      "authors": [
        "Caroline Uhler",
        "Jiaqi Zhang"
      ],
      "abstract": "Massive data collection holds the promise of a better understanding of\ncomplex phenomena and, ultimately, better decisions. Representation learning\nhas become a key driver of deep learning applications, as it allows learning\nlatent spaces that capture important properties of the data without requiring\nany supervised annotations. Although representation learning has been hugely\nsuccessful in predictive tasks, it can fail miserably in causal tasks including\npredicting the effect of a perturbation/intervention. This calls for a marriage\nbetween representation learning and causal inference. An exciting opportunity\nin this regard stems from the growing availability of multi-modal data\n(observational and perturbational, imaging-based and sequencing-based, at the\nsingle-cell level, tissue-level, and organism-level). We outline a statistical\nand computational framework for causal structure and representation learning\nmotivated by fundamental biomedical questions: how to effectively use\nobservational and perturbational data to perform causal discovery on observed\ncausal variables; how to use multi-modal views of the system to learn causal\nvariables; and how to design optimal perturbations.",
      "pdf_url": "http://arxiv.org/pdf/2511.04790v1",
      "arxiv_url": "http://arxiv.org/abs/2511.04790v1",
      "published": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ]
    },
    {
      "title": "Dynamic causal discovery in Alzheimer's disease through latent pseudotime modelling",
      "authors": [
        "Natalia Glazman",
        "Jyoti Mangal",
        "Pedro Borges",
        "Sebastien Ourselin",
        "M. Jorge Cardoso"
      ],
      "abstract": "The application of causal discovery to diseases like Alzheimer's (AD) is\nlimited by the static graph assumptions of most methods; such models cannot\naccount for an evolving pathophysiology, modulated by a latent disease\npseudotime. We propose to apply an existing latent variable model to real-world\nAD data, inferring a pseudotime that orders patients along a data-driven\ndisease trajectory independent of chronological age, then learning how causal\nrelationships evolve. Pseudotime outperformed age in predicting diagnosis (AUC\n0.82 vs 0.59). Incorporating minimal, disease-agnostic background knowledge\nsubstantially improved graph accuracy and orientation. Our framework reveals\ndynamic interactions between novel (NfL, GFAP) and established AD markers,\nenabling practical causal discovery despite violated assumptions.",
      "pdf_url": "http://arxiv.org/pdf/2511.04619v1",
      "arxiv_url": "http://arxiv.org/abs/2511.04619v1",
      "published": "2025-11-06",
      "categories": [
        "stat.AP",
        "cs.CE",
        "cs.LG"
      ]
    },
    {
      "title": "Extracting Causal Relations in Deep Knowledge Tracing",
      "authors": [
        "Kevin Hong",
        "Kia Karbasi",
        "Gregory Pottie"
      ],
      "abstract": "A longstanding goal in computational educational research is to develop\nexplainable knowledge tracing (KT) models. Deep Knowledge Tracing (DKT), which\nleverages a Recurrent Neural Network (RNN) to predict student knowledge and\nperformance on exercises, has been proposed as a major advancement over\ntraditional KT methods. Several studies suggest that its performance gains stem\nfrom its ability to model bidirectional relationships between different\nknowledge components (KCs) within a course, enabling the inference of a\nstudent's understanding of one KC from their performance on others. In this\npaper, we challenge this prevailing explanation and demonstrate that DKT's\nstrength lies in its implicit ability to model prerequisite relationships as a\ncausal structure, rather than bidirectional relationships. By pruning exercise\nrelation graphs into Directed Acyclic Graphs (DAGs) and training DKT on causal\nsubsets of the Assistments dataset, we show that DKT's predictive capabilities\nalign strongly with these causal structures. Furthermore, we propose an\nalternative method for extracting exercise relation DAGs using DKT's learned\nrepresentations and provide empirical evidence supporting our claim. Our\nfindings suggest that DKT's effectiveness is largely driven by its capacity to\napproximate causal dependencies between KCs rather than simple relational\nmappings.",
      "pdf_url": "http://arxiv.org/pdf/2511.03948v1",
      "arxiv_url": "http://arxiv.org/abs/2511.03948v1",
      "published": "2025-11-06",
      "categories": [
        "cs.AI",
        "cs.HC",
        "I.2.6; K.3.1"
      ]
    },
    {
      "title": "Tutorial Debriefing: Applied Statistical Causal Inference in Requirements Engineering",
      "authors": [
        "Julian Frattini",
        "Hans-Martin Heyn",
        "Robert Feldt",
        "Richard Torkar"
      ],
      "abstract": "As any scientific discipline, the software engineering (SE) research\ncommunity strives to contribute to the betterment of the target population of\nour research: software producers and consumers. We will only achieve this\nbetterment if we manage to transfer the knowledge acquired during research into\npractice. This transferal of knowledge may come in the form of tools,\nprocesses, and guidelines for software developers. However, the value of these\ncontributions hinges on the assumption that applying them causes an improvement\nof the development process, user experience, or other performance metrics. Such\na promise requires evidence of causal relationships between an exposure or\nintervention (i.e., the contributed tool, process or guideline) and an outcome\n(i.e., performance metrics). A straight-forward approach to obtaining this\nevidence is via controlled experiments in which a sample of a population is\nrandomly divided into a group exposed to the new tool, process, or guideline,\nand a control group. However, such randomized control trials may not be\nlegally, ethically, or logistically feasible. In these cases, we need a\nreliable process for statistical causal inference (SCI) from observational\ndata.",
      "pdf_url": "http://arxiv.org/pdf/2511.03875v1",
      "arxiv_url": "http://arxiv.org/abs/2511.03875v1",
      "published": "2025-11-05",
      "categories": [
        "cs.SE"
      ]
    },
    {
      "title": "Higher-Order Causal Structure Learning with Additive Models",
      "authors": [
        "James Enouen",
        "Yujia Zheng",
        "Ignavier Ng",
        "Yan Liu",
        "Kun Zhang"
      ],
      "abstract": "Causal structure learning has long been the central task of inferring causal\ninsights from data. Despite the abundance of real-world processes exhibiting\nhigher-order mechanisms, however, an explicit treatment of interactions in\ncausal discovery has received little attention. In this work, we focus on\nextending the causal additive model (CAM) to additive models with higher-order\ninteractions. This second level of modularity we introduce to the structure\nlearning problem is most easily represented by a directed acyclic hypergraph\nwhich extends the DAG. We introduce the necessary definitions and theoretical\ntools to handle the novel structure we introduce and then provide\nidentifiability results for the hyper DAG, extending the typical Markov\nequivalence classes. We next provide insights into why learning the more\ncomplex hypergraph structure may actually lead to better empirical results. In\nparticular, more restrictive assumptions like CAM correspond to easier-to-learn\nhyper DAGs and better finite sample complexity. We finally develop an extension\nof the greedy CAM algorithm which can handle the more complex hyper DAG search\nspace and demonstrate its empirical usefulness in synthetic experiments.",
      "pdf_url": "http://arxiv.org/pdf/2511.03831v1",
      "arxiv_url": "http://arxiv.org/abs/2511.03831v1",
      "published": "2025-11-05",
      "categories": [
        "cs.LG",
        "math.ST",
        "stat.ML",
        "stat.TH"
      ]
    },
    {
      "title": "Bayesian Causal Effect Estimation for Categorical Data using Staged Tree Models",
      "authors": [
        "Andrea Cremaschi",
        "Manuele Leonelli",
        "Gherardo Varando"
      ],
      "abstract": "We propose a fully Bayesian approach for causal inference with multivariate\ncategorical data based on staged tree models, a class of probabilistic\ngraphical models capable of representing asymmetric and context-specific\ndependencies. To account for uncertainty in both structure and parameters, we\nintroduce a flexible family of prior distributions over staged trees. These\ninclude product partition models to encourage parsimony, a novel distance-based\nprior to promote interpretable dependence patterns, and an extension that\nincorporates continuous covariates into the learning process. Posterior\ninference is achieved via a tailored Markov Chain Monte Carlo algorithm with\nsplit-and-merge moves, yielding posterior samples of staged trees from which\naverage treatment effects and uncertainty measures are derived. Posterior\nsummaries and uncertainty measures are obtained via techniques from the\nBayesian nonparametrics literature. Two case studies on electronic fetal\nmonitoring and cesarean delivery and on anthracycline therapy and cardiac\ndysfunction in breast cancer illustrate the methods.",
      "pdf_url": "http://arxiv.org/pdf/2511.03399v1",
      "arxiv_url": "http://arxiv.org/abs/2511.03399v1",
      "published": "2025-11-05",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "UnCLe: Towards Scalable Dynamic Causal Discovery in Non-linear Temporal Systems",
      "authors": [
        "Tingzhu Bi",
        "Yicheng Pan",
        "Xinrui Jiang",
        "Huize Sun",
        "Meng Ma",
        "Ping Wang"
      ],
      "abstract": "Uncovering cause-effect relationships from observational time series is\nfundamental to understanding complex systems. While many methods infer static\ncausal graphs, real-world systems often exhibit dynamic causality-where\nrelationships evolve over time. Accurately capturing these temporal dynamics\nrequires time-resolved causal graphs. We propose UnCLe, a novel deep learning\nmethod for scalable dynamic causal discovery. UnCLe employs a pair of Uncoupler\nand Recoupler networks to disentangle input time series into semantic\nrepresentations and learns inter-variable dependencies via auto-regressive\nDependency Matrices. It estimates dynamic causal influences by analyzing\ndatapoint-wise prediction errors induced by temporal perturbations. Extensive\nexperiments demonstrate that UnCLe not only outperforms state-of-the-art\nbaselines on static causal discovery benchmarks but, more importantly, exhibits\na unique capability to accurately capture and represent evolving temporal\ncausality in both synthetic and real-world dynamic systems (e.g., human\nmotion). UnCLe offers a promising approach for revealing the underlying,\ntime-varying mechanisms of complex phenomena.",
      "pdf_url": "http://arxiv.org/pdf/2511.03168v1",
      "arxiv_url": "http://arxiv.org/abs/2511.03168v1",
      "published": "2025-11-05",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "Adaptive Orthogonalization for Stable Estimation of the Effects of Time-Varying Treatments",
      "authors": [
        "Yige Li",
        "María de los Angeles Resa",
        "José R. Zubizarreta"
      ],
      "abstract": "Inferring the causal effects of time-varying treatments is often hindered by\nhighly variable inverse propensity weights, particularly in settings with\nlimited covariate overlap. Building on the key framework of Imai and Ratkovic\n(2015), we establish sufficient balancing conditions for identification in\nlongitudinal studies of treatment effects and propose a novel estimator that\ndirectly targets features of counterfactual or potential covariates. Instead of\nbalancing observed covariates, our method balances the components of covariates\nthat are orthogonal to their history, thereby isolating the new information at\neach time point. This strategy directly targets the joint distribution of\npotential covariates and prioritizes features that are most relevant to the\noutcome. We prove that the resulting estimator for the mean potential outcome\nis consistent and asymptotically normal, even in settings where standard\ninverse propensity weighting fails. Extensive simulations show that our\nestimator attains efficiency comparable to that of g-computation while\nproviding superior robustness to model misspecification. We apply our method to\na longitudinal study of private versus public schooling in Chile, demonstrating\nits stability and interpretability in estimating their effects on university\nadmission scores.",
      "pdf_url": "http://arxiv.org/pdf/2511.02971v1",
      "arxiv_url": "http://arxiv.org/abs/2511.02971v1",
      "published": "2025-11-04",
      "categories": [
        "stat.ME"
      ]
    }
  ]
}