{
  "last_updated": "2025-02-22T00:43:51.194943",
  "papers": [
    {
      "title": "Internal Incoherency Scores for Constraint-based Causal Discovery Algorithms",
      "authors": [
        "Sofia Faltenbacher",
        "Jonas Wahl",
        "Rebecca Herman",
        "Jakob Runge"
      ],
      "abstract": "Causal discovery aims to infer causal graphs from observational or\nexperimental data. Methods such as the popular PC algorithm are based on\nconditional independence testing and utilize enabling assumptions, such as the\nfaithfulness assumption, for their inferences. In practice, these assumptions,\nas well as the functional assumptions inherited from the chosen conditional\nindependence test, are typically taken as a given and not further tested for\ntheir validity on the data. In this work, we propose internal coherency scores\nthat allow testing for assumption violations and finite sample errors, whenever\ndetectable without requiring ground truth or further statistical tests. We\nprovide a complete classification of erroneous results, including a distinction\nbetween detectable and undetectable errors, and prove that the detectable\nerroneous results can be measured by our scores. We illustrate our coherency\nscores on the PC algorithm with simulated and real-world datasets, and envision\nthat testing for internal coherency can become a standard tool in applying\nconstraint-based methods, much like a suite of tests is used to validate the\nassumptions of classical regression analysis.",
      "pdf_url": "http://arxiv.org/pdf/2502.14719v1",
      "arxiv_url": "http://arxiv.org/abs/2502.14719v1",
      "published": "2025-02-20",
      "categories": [
        "stat.ML",
        "cs.LG"
      ]
    },
    {
      "title": "Outlier Detection in Mendelian Randomisation",
      "authors": [
        "Maximilian M Mandl",
        "Anne-Laure Boulesteix",
        "Stephen Burgess",
        "Verena Zuber"
      ],
      "abstract": "Mendelian Randomisation (MR) uses genetic variants as instrumental variables\nto infer causal effects of exposures on an outcome. One key assumption of MR is\nthat the genetic variants used as instrumental variables are independent of the\noutcome conditional on the risk factor and unobserved confounders. Violations\nof this assumption, i.e. the effect of the instrumental variables on the\noutcome through a path other than the risk factor included in the model (which\ncan be caused by pleiotropy), are common phenomena in human genetics. Genetic\nvariants, which deviate from this assumption, appear as outliers to the MR\nmodel fit and can be detected by the general heterogeneity statistics proposed\nin the literature, which are known to suffer from overdispersion, i.e. too many\ngenetic variants are declared as false outliers. We propose a method that\ncorrects for overdispersion of the heterogeneity statistics in uni- and\nmultivariable MR analysis by making use of the estimated inflation factor to\ncorrectly remove outlying instruments and therefore account for pleiotropic\neffects. Our method is applicable to summary-level data.",
      "pdf_url": "http://arxiv.org/pdf/2502.14716v1",
      "arxiv_url": "http://arxiv.org/abs/2502.14716v1",
      "published": "2025-02-20",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Optimal word order for non-causal text generation with Large Language Models: the Spanish case",
      "authors": [
        "Andrea Busto-Castiñeira",
        "Silvia García-Méndez",
        "Francisco de Arriba-Pérez",
        "Francisco J. González-Castaño"
      ],
      "abstract": "Natural Language Generation (NLG) popularity has increased owing to the\nprogress in Large Language Models (LLMs), with zero-shot inference\ncapabilities. However, most neural systems utilize decoder-only causal\n(unidirectional) transformer models, which are effective for English but may\nreduce the richness of languages with less strict word order, subject omission,\nor different relative clause attachment preferences. This is the first work\nthat analytically addresses optimal text generation order for non-causal\nlanguage models. We present a novel Viterbi algorithm-based methodology for\nmaximum likelihood word order estimation. We analyze the non-causal\nmost-likelihood order probability for NLG in Spanish and, then, the probability\nof generating the same phrases with Spanish causal NLG. This comparative\nanalysis reveals that causal NLG prefers English-like SVO structures. We also\nanalyze the relationship between optimal generation order and causal\nleft-to-right generation order using Spearman's rank correlation. Our results\ndemonstrate that the ideal order predicted by the maximum likelihood estimator\nis not closely related to the causal order and may be influenced by the\nsyntactic structure of the target sentence.",
      "pdf_url": "http://arxiv.org/pdf/2502.14451v1",
      "arxiv_url": "http://arxiv.org/abs/2502.14451v1",
      "published": "2025-02-20",
      "categories": [
        "cs.CL"
      ]
    },
    {
      "title": "Robust Counterfactual Inference in Markov Decision Processes",
      "authors": [
        "Jessica Lally",
        "Milad Kazemi",
        "Nicola Paoletti"
      ],
      "abstract": "This paper addresses a key limitation in existing counterfactual inference\nmethods for Markov Decision Processes (MDPs). Current approaches assume a\nspecific causal model to make counterfactuals identifiable. However, there are\nusually many causal models that align with the observational and interventional\ndistributions of an MDP, each yielding different counterfactual distributions,\nso fixing a particular causal model limits the validity (and usefulness) of\ncounterfactual inference. We propose a novel non-parametric approach that\ncomputes tight bounds on counterfactual transition probabilities across all\ncompatible causal models. Unlike previous methods that require solving\nprohibitively large optimisation problems (with variables that grow\nexponentially in the size of the MDP), our approach provides closed-form\nexpressions for these bounds, making computation highly efficient and scalable\nfor non-trivial MDPs. Once such an interval counterfactual MDP is constructed,\nour method identifies robust counterfactual policies that optimise the\nworst-case reward w.r.t. the uncertain interval MDP probabilities. We evaluate\nour method on various case studies, demonstrating improved robustness over\nexisting methods.",
      "pdf_url": "http://arxiv.org/pdf/2502.13731v1",
      "arxiv_url": "http://arxiv.org/abs/2502.13731v1",
      "published": "2025-02-19",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "Distal Causal Excursion Effects: Modeling Long-Term Effects of Time-Varying Treatments in Micro-Randomized Trials",
      "authors": [
        "Tianchen Qian"
      ],
      "abstract": "Micro-randomized trials (MRTs) play a crucial role in optimizing digital\ninterventions. In an MRT, each participant is sequentially randomized among\ntreatment options hundreds of times. While the interventions tested in MRTs\ntarget short-term behavioral responses (proximal outcomes), their ultimate goal\nis to drive long-term behavior change (distal outcomes). However, existing\ncausal inference methods, such as the causal excursion effect, are limited to\nproximal outcomes, making it challenging to quantify the long-term impact of\ninterventions. To address this gap, we introduce the distal causal excursion\neffect (DCEE), a novel estimand that quantifies the long-term effect of\ntime-varying treatments. The DCEE contrasts distal outcomes under two excursion\npolicies while marginalizing over most treatment assignments, enabling a\nparsimonious and interpretable causal model even with a large number of\ndecision points. We propose two estimators for the DCEE -- one with\ncross-fitting and one without -- both robust to misspecification of the outcome\nmodel. We establish their asymptotic properties and validate their performance\nthrough simulations. We apply our method to the HeartSteps MRT to assess the\nimpact of activity prompts on long-term habit formation. Our findings suggest\nthat prompts delivered earlier in the study have a stronger long-term effect\nthan those delivered later, underscoring the importance of intervention timing\nin behavior change. This work provides the critically needed toolkit for\nscientists working on digital interventions to assess long-term causal effects\nusing MRT data.",
      "pdf_url": "http://arxiv.org/pdf/2502.13500v1",
      "arxiv_url": "http://arxiv.org/abs/2502.13500v1",
      "published": "2025-02-19",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Robust Inference for the Direct Average Treatment Effect with Treatment Assignment Interference",
      "authors": [
        "Matias D. Cattaneo",
        "Yihan He",
        "Ruiqi",
        "Yu"
      ],
      "abstract": "Uncertainty quantification in causal inference settings with random network\ninterference is a challenging open problem. We study the large sample\ndistributional properties of the classical difference-in-means Hajek treatment\neffect estimator, and propose a robust inference procedure for the\n(conditional) direct average treatment effect, allowing for cross-unit\ninterference in both the outcome and treatment equations. Leveraging ideas from\nstatistical physics, we introduce a novel Ising model capturing interference in\nthe treatment assignment, and then obtain three main results. First, we\nestablish a Berry-Esseen distributional approximation pointwise in the degree\nof interference generated by the Ising model. Our distributional approximation\nrecovers known results in the literature under no-interference in treatment\nassignment, and also highlights a fundamental fragility of inference procedures\ndeveloped using such a pointwise approximation. Second, we establish a uniform\ndistributional approximation for the Hajek estimator, and develop robust\ninference procedures that remain valid regardless of the unknown degree of\ninterference in the Ising model. Third, we propose a novel resampling method\nfor implementation of robust inference procedure. A key technical innovation\nunderlying our work is a new \\textit{De-Finetti Machine} that facilitates\nconditional i.i.d. Gaussianization, a technique that may be of independent\ninterest in other settings.",
      "pdf_url": "http://arxiv.org/pdf/2502.13238v1",
      "arxiv_url": "http://arxiv.org/abs/2502.13238v1",
      "published": "2025-02-18",
      "categories": [
        "stat.ME",
        "econ.EM"
      ]
    },
    {
      "title": "Robust Disentangled Counterfactual Learning for Physical Audiovisual Commonsense Reasoning",
      "authors": [
        "Mengshi Qi",
        "Changsheng Lv",
        "Huadong Ma"
      ],
      "abstract": "In this paper, we propose a new Robust Disentangled Counterfactual Learning\n(RDCL) approach for physical audiovisual commonsense reasoning. The task aims\nto infer objects' physics commonsense based on both video and audio input, with\nthe main challenge being how to imitate the reasoning ability of humans, even\nunder the scenario of missing modalities. Most of the current methods fail to\ntake full advantage of different characteristics in multi-modal data, and\nlacking causal reasoning ability in models impedes the progress of implicit\nphysical knowledge inferring. To address these issues, our proposed RDCL method\ndecouples videos into static (time-invariant) and dynamic (time-varying)\nfactors in the latent space by the disentangled sequential encoder, which\nadopts a variational autoencoder (VAE) to maximize the mutual information with\na contrastive loss function. Furthermore, we introduce a counterfactual\nlearning module to augment the model's reasoning ability by modeling physical\nknowledge relationships among different objects under counterfactual\nintervention. To alleviate the incomplete modality data issue, we introduce a\nrobust multimodal learning method to recover the missing data by decomposing\nthe shared features and model-specific features. Our proposed method is a\nplug-and-play module that can be incorporated into any baseline including VLMs.\nIn experiments, we show that our proposed method improves the reasoning\naccuracy and robustness of baseline methods and achieves the state-of-the-art\nperformance.",
      "pdf_url": "http://arxiv.org/pdf/2502.12425v1",
      "arxiv_url": "http://arxiv.org/abs/2502.12425v1",
      "published": "2025-02-18",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "Time Series Treatment Effects Analysis with Always-Missing Controls",
      "authors": [
        "Juan Shu",
        "Qiyu Han",
        "George Chen",
        "Xihao Cao",
        "Kangming Luo",
        "Dan Pallotta",
        "Shivam Agrawal",
        "Yuping Lu",
        "Xiaoyu Zhang",
        "Jawad Mansoor",
        "Jyoti Anand"
      ],
      "abstract": "Estimating treatment effects in time series data presents a significant\nchallenge, especially when the control group is always unobservable. For\nexample, in analyzing the effects of Christmas on retail sales, we lack direct\nobservation of what would have occurred in late December without the Christmas\nimpact. To address this, we try to recover the control group in the event\nperiod while accounting for confounders and temporal dependencies. Experimental\nresults on the M5 Walmart retail sales data demonstrate robust estimation of\nthe potential outcome of the control group as well as accurate predicted\nholiday effect. Furthermore, we provided theoretical guarantees for the\nestimated treatment effect, proving its consistency and asymptotic normality.\nThe proposed methodology is applicable not only to this always-missing control\nscenario but also in other conventional time series causal inference settings.",
      "pdf_url": "http://arxiv.org/pdf/2502.12393v1",
      "arxiv_url": "http://arxiv.org/abs/2502.12393v1",
      "published": "2025-02-18",
      "categories": [
        "stat.ME",
        "cs.AI",
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "The impact of job stability on monetary poverty in Italy: causal small area estimation",
      "authors": [
        "Katarzyna Reluga",
        "Dehan Kong",
        "Setareh Ranjbar",
        "Nicola Salvati",
        "Mark van der Laan"
      ],
      "abstract": "Job stability - encompassing secure contracts, adequate wages, social\nbenefits, and career opportunities - is a critical determinant in reducing\nmonetary poverty, as it provides households with reliable income and enhances\neconomic well-being. This study leverages EU-SILC survey and census data to\nestimate the causal effect of job stability on monetary poverty across Italian\nprovinces, quantifying its influence and analyzing regional disparities. We\nintroduce a novel causal small area estimation (CSAE) framework that integrates\nglobal and local estimation strategies for heterogeneous treatment effect\nestimation, effectively addressing data sparsity at the provincial level.\nFurthermore, we develop a general bootstrap scheme to construct reliable\nconfidence intervals, applicable regardless of the method used for estimating\nnuisance parameters. Extensive simulation studies demonstrate that our proposed\nestimators outperform classical causal inference methods in terms of stability\nwhile maintaining computational scalability for large datasets. Applying this\nmethodology to real-world data, we uncover significant relationships between\njob stability and poverty across six Italian regions, offering critical\ninsights into regional disparities and their implications for evidence-based\npolicy design.",
      "pdf_url": "http://arxiv.org/pdf/2502.12376v1",
      "arxiv_url": "http://arxiv.org/abs/2502.12376v1",
      "published": "2025-02-17",
      "categories": [
        "stat.AP",
        "62P20, 62F40, 62D20, 62D05"
      ]
    },
    {
      "title": "Unifying Explainable Anomaly Detection and Root Cause Analysis in Dynamical Systems",
      "authors": [
        "Yue Sun",
        "Rick S. Blum",
        "Parv Venkitasubramaniam"
      ],
      "abstract": "Dynamical systems, prevalent in various scientific and engineering domains,\nare susceptible to anomalies that can significantly impact their performance\nand reliability. This paper addresses the critical challenges of anomaly\ndetection, root cause localization, and anomaly type classification in\ndynamical systems governed by ordinary differential equations (ODEs). We define\ntwo categories of anomalies: cyber anomalies, which propagate through\ninterconnected variables, and measurement anomalies, which remain localized to\nindividual variables. To address these challenges, we propose the Interpretable\nCausality Ordinary Differential Equation (ICODE) Networks, a model-intrinsic\nexplainable learning framework. ICODE leverages Neural ODEs for anomaly\ndetection while employing causality inference through an explanation channel to\nperform root cause analysis (RCA), elucidating why specific time periods are\nflagged as anomalous. ICODE is designed to simultaneously perform anomaly\ndetection, RCA, and anomaly type classification within a single, interpretable\nframework. Our approach is grounded in the hypothesis that anomalies alter the\nunderlying ODEs of the system, manifesting as changes in causal relationships\nbetween variables. We provide a theoretical analysis of how perturbations in\nlearned model parameters can be utilized to identify anomalies and their root\ncauses in time series data. Comprehensive experimental evaluations demonstrate\nthe efficacy of ICODE across various dynamical systems, showcasing its ability\nto accurately detect anomalies, classify their types, and pinpoint their\norigins.",
      "pdf_url": "http://arxiv.org/pdf/2502.12086v1",
      "arxiv_url": "http://arxiv.org/abs/2502.12086v1",
      "published": "2025-02-17",
      "categories": [
        "cs.LG",
        "stat.ML"
      ]
    }
  ]
}