{
  "last_updated": "2025-04-25T00:52:10.738755",
  "papers": [
    {
      "title": "Using Causal Inference to Test Systems with Hidden and Interacting Variables: An Evaluative Case Study",
      "authors": [
        "Michael Foster",
        "Robert M. Hierons",
        "Donghwan Shin",
        "Neil Walkinshaw",
        "Christopher Wild"
      ],
      "abstract": "Software systems with large parameter spaces, nondeterminism and high\ncomputational cost are challenging to test. Recently, software testing\ntechniques based on causal inference have been successfully applied to systems\nthat exhibit such characteristics, including scientific models and autonomous\ndriving systems. One significant limitation is that these are restricted to\ntest properties where all of the variables involved can be observed and where\nthere are no interactions between variables. In practice, this is rarely\nguaranteed; the logging infrastructure may not be available to record all of\nthe necessary runtime variable values, and it can often be the case that an\noutput of the system can be affected by complex interactions between variables.\nTo address this, we leverage two additional concepts from causal inference,\nnamely effect modification and instrumental variable methods. We build these\nconcepts into an existing causal testing tool and conduct an evaluative case\nstudy which uses the concepts to test three system-level requirements of CARLA,\na high-fidelity driving simulator widely used in autonomous vehicle development\nand testing. The results show that we can obtain reliable test outcomes without\nrequiring large amounts of highly controlled test data or instrumentation of\nthe code, even when variables interact with each other and are not recorded in\nthe test data.",
      "pdf_url": "http://arxiv.org/pdf/2504.16526v1",
      "arxiv_url": "http://arxiv.org/abs/2504.16526v1",
      "published": "2025-04-23",
      "categories": [
        "cs.SE"
      ]
    },
    {
      "title": "Robust Causal Inference for EHR-based Studies of Point Exposures with Missingness in Eligibility Criteria",
      "authors": [
        "Luke Benz",
        "Rajarshi Mukherjee",
        "Rui Wang",
        "David Arterburn",
        "Heidi Fischer",
        "Catherine Lee",
        "Susan M. Shortreed",
        "Sebastien Haneuse",
        "Alexander W. Levis"
      ],
      "abstract": "Missingness in variables that define study eligibility criteria is a seldom\naddressed challenge in electronic health record (EHR)-based settings. It is\ntypically the case that patients with incomplete eligibility information are\nexcluded from analysis without consideration of (implicit) assumptions that are\nbeing made, leaving study conclusions subject to potential selection bias. In\nan effort to ascertain eligibility for more patients, researchers may look back\nfurther in time prior to study baseline, and in using outdated values of\neligibility-defining covariates may inappropriately be including individuals\nwho, unbeknownst to the researcher, fail to meet eligibility at baseline. To\nthe best of our knowledge, however, very little work has been done to mitigate\nthese concerns. We propose a robust and efficient estimator of the causal\naverage treatment effect on the treated, defined in the study eligible\npopulation, in cohort studies where eligibility-defining covariates are missing\nat random. The approach facilitates the use of flexible machine-learning\nstrategies for component nuisance functions while maintaining appropriate\nconvergence rates for valid asymptotic inference. EHR data from Kaiser\nPermanente are used as motivation as well as a basis for extensive simulations\nthat verify robustness properties under various degrees of model\nmisspecification. The data are also used to demonstrate the use of the method\nto analyze differences between two common bariatric surgical interventions for\nlong-term weight and glycemic outcomes among a cohort of severely obese\npatients with type II diabetes mellitus.",
      "pdf_url": "http://arxiv.org/pdf/2504.16230v1",
      "arxiv_url": "http://arxiv.org/abs/2504.16230v1",
      "published": "2025-04-22",
      "categories": [
        "stat.ME",
        "stat.AP"
      ]
    },
    {
      "title": "Consistent Causal Inference of Group Effects in Non-Targeted Trials with Finitely Many Effect Levels",
      "authors": [
        "Georgios Mavroudeas",
        "Malik Magdon-Ismail",
        "Kristin P. Bennett",
        "Jason Kuruzovich"
      ],
      "abstract": "A treatment may be appropriate for some group (the ``sick\" group) on whom it\nhas a positive effect, but it can also have a detrimental effect on subjects\nfrom another group (the ``healthy\" group). In a non-targeted trial both sick\nand healthy subjects may be treated, producing heterogeneous effects within the\ntreated group. Inferring the correct treatment effect on the sick population is\nthen difficult, because the effects on the different groups get tangled. We\npropose an efficient nonparametric approach to estimating the group effects,\ncalled {\\bf PCM} (pre-cluster and merge). We prove its asymptotic consistency\nin a general setting and show, on synthetic data, more than a 10x improvement\nin accuracy over existing state-of-the-art. Our approach applies more generally\nto consistent estimation of functions with a finite range.",
      "pdf_url": "http://arxiv.org/pdf/2504.15854v1",
      "arxiv_url": "http://arxiv.org/abs/2504.15854v1",
      "published": "2025-04-22",
      "categories": [
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "Exploring Cognitive and Aesthetic Causality for Multimodal Aspect-Based Sentiment Analysis",
      "authors": [
        "Luwei Xiao",
        "Rui Mao",
        "Shuai Zhao",
        "Qika Lin",
        "Yanhao Jia",
        "Liang He",
        "Erik Cambria"
      ],
      "abstract": "Multimodal aspect-based sentiment classification (MASC) is an emerging task\ndue to an increase in user-generated multimodal content on social platforms,\naimed at predicting sentiment polarity toward specific aspect targets (i.e.,\nentities or attributes explicitly mentioned in text-image pairs). Despite\nextensive efforts and significant achievements in existing MASC, substantial\ngaps remain in understanding fine-grained visual content and the cognitive\nrationales derived from semantic content and impressions (cognitive\ninterpretations of emotions evoked by image content). In this study, we present\nChimera: a cognitive and aesthetic sentiment causality understanding framework\nto derive fine-grained holistic features of aspects and infer the fundamental\ndrivers of sentiment expression from both semantic perspectives and\naffective-cognitive resonance (the synergistic effect between emotional\nresponses and cognitive interpretations). Specifically, this framework first\nincorporates visual patch features for patch-word alignment. Meanwhile, it\nextracts coarse-grained visual features (e.g., overall image representation)\nand fine-grained visual regions (e.g., aspect-related regions) and translates\nthem into corresponding textual descriptions (e.g., facial, aesthetic).\nFinally, we leverage the sentimental causes and impressions generated by a\nlarge language model (LLM) to enhance the model's awareness of sentimental cues\nevoked by semantic content and affective-cognitive resonance. Experimental\nresults on standard MASC datasets demonstrate the effectiveness of the proposed\nmodel, which also exhibits greater flexibility to MASC compared to LLMs such as\nGPT-4o. We have publicly released the complete implementation and dataset at\nhttps://github.com/Xillv/Chimera",
      "pdf_url": "http://arxiv.org/pdf/2504.15848v1",
      "arxiv_url": "http://arxiv.org/abs/2504.15848v1",
      "published": "2025-04-22",
      "categories": [
        "cs.CL"
      ]
    },
    {
      "title": "Causal DAG Summarization (Full Version)",
      "authors": [
        "Anna Zeng",
        "Michael Cafarella",
        "Batya Kenig",
        "Markos Markakis",
        "Brit Youngmann",
        "Babak Salimi"
      ],
      "abstract": "Causal inference aids researchers in discovering cause-and-effect\nrelationships, leading to scientific insights. Accurate causal estimation\nrequires identifying confounding variables to avoid false discoveries. Pearl's\ncausal model uses causal DAGs to identify confounding variables, but incorrect\nDAGs can lead to unreliable causal conclusions. However, for high dimensional\ndata, the causal DAGs are often complex beyond human verifiability. Graph\nsummarization is a logical next step, but current methods for general-purpose\ngraph summarization are inadequate for causal DAG summarization. This paper\naddresses these challenges by proposing a causal graph summarization objective\nthat balances graph simplification for better understanding while retaining\nessential causal information for reliable inference. We develop an efficient\ngreedy algorithm and show that summary causal DAGs can be directly used for\ninference and are more robust to misspecification of assumptions, enhancing\nrobustness for causal inference. Experimenting with six real-life datasets, we\ncompared our algorithm to three existing solutions, showing its effectiveness\nin handling high-dimensional data and its ability to generate summary DAGs that\nensure both reliable causal inference and robustness against misspecifications.",
      "pdf_url": "http://arxiv.org/pdf/2504.14937v1",
      "arxiv_url": "http://arxiv.org/abs/2504.14937v1",
      "published": "2025-04-21",
      "categories": [
        "cs.LG",
        "cs.DB",
        "stat.ME"
      ]
    },
    {
      "title": "Causality for Natural Language Processing",
      "authors": [
        "Zhijing Jin"
      ],
      "abstract": "Causal reasoning is a cornerstone of human intelligence and a critical\ncapability for artificial systems aiming to achieve advanced understanding and\ndecision-making. This thesis delves into various dimensions of causal reasoning\nand understanding in large language models (LLMs). It encompasses a series of\nstudies that explore the causal inference skills of LLMs, the mechanisms behind\ntheir performance, and the implications of causal and anticausal learning for\nnatural language processing (NLP) tasks. Additionally, it investigates the\napplication of causal reasoning in text-based computational social science,\nspecifically focusing on political decision-making and the evaluation of\nscientific impact through citations. Through novel datasets, benchmark tasks,\nand methodological frameworks, this work identifies key challenges and\nopportunities to improve the causal capabilities of LLMs, providing a\ncomprehensive foundation for future research in this evolving field.",
      "pdf_url": "http://arxiv.org/pdf/2504.14530v1",
      "arxiv_url": "http://arxiv.org/abs/2504.14530v1",
      "published": "2025-04-20",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CY",
        "cs.LG"
      ]
    },
    {
      "title": "Dynamic Regularized CBDT: Variance-Calibrated Causal Boosting for Interpretable Heterogeneous Treatment Effects",
      "authors": [
        "Yichen Liu"
      ],
      "abstract": "Heterogeneous treatment effect estimation in high-stakes applications demands\nmodels that simultaneously optimize precision, interpretability, and\ncalibration. Many existing tree-based causal inference techniques, however,\nexhibit high estimation errors when applied to observational data because they\nstruggle to capture complex interactions among factors and rely on static\nregularization schemes. In this work, we propose Dynamic Regularized Causal\nBoosted Decision Trees (CBDT), a novel framework that integrates variance\nregularization and average treatment effect calibration into the loss function\nof gradient boosted decision trees. Our approach dynamically updates the\nregularization parameters using gradient statistics to better balance the\nbias-variance tradeoff. Extensive experiments on standard benchmark datasets\nand real-world clinical data demonstrate that the proposed method significantly\nimproves estimation accuracy while maintaining reliable coverage of true\ntreatment effects. In an intensive care unit patient triage study, the method\nsuccessfully identified clinically actionable rules and achieved high accuracy\nin treatment effect estimation. The results validate that dynamic\nregularization can effectively tighten error bounds and enhance both predictive\nperformance and model interpretability.",
      "pdf_url": "http://arxiv.org/pdf/2504.13733v1",
      "arxiv_url": "http://arxiv.org/abs/2504.13733v1",
      "published": "2025-04-18",
      "categories": [
        "cs.LG",
        "stat.ML",
        "68T05, 62H12, 90C30",
        "I.2.6; G.3; I.5.1"
      ]
    },
    {
      "title": "Inverse Inference on Cooperative Control of Networked Dynamical Systems",
      "authors": [
        "Yushan Li",
        "Jianping He",
        "Dimos V. Dimarogonas"
      ],
      "abstract": "Recent years have witnessed the rapid advancement of understanding the\ncontrol mechanism of networked dynamical systems (NDSs), which are governed by\ncomponents such as nodal dynamics and topology. This paper reveals that the\ncritical components in continuous-time state feedback cooperative control of\nNDSs can be inferred merely from discrete observations. In particular, we\nadvocate a bi-level inference framework to estimate the global closed-loop\nsystem and extract the components, respectively. The novelty lies in bridging\nthe gap from discrete observations to the continuous-time model and effectively\ndecoupling the concerned components. Specifically, in the first level, we\ndesign a causality-based estimator for the discrete-time closed-loop system\nmatrix, which can achieve asymptotically unbiased performance when the NDS is\nstable. In the second level, we introduce a matrix logarithm based method to\nrecover the continuous-time counterpart matrix, providing new sampling period\nguarantees and establishing the recovery error bound. By utilizing graph\nproperties of the NDS, we develop least square based procedures to decouple the\nconcerned components with up to a scalar ambiguity. Furthermore, we employ\ninverse optimal control techniques to reconstruct the objective function\ndriving the control process, deriving necessary conditions for the solutions.\nNumerical simulations demonstrate the effectiveness of the proposed method.",
      "pdf_url": "http://arxiv.org/pdf/2504.13701v1",
      "arxiv_url": "http://arxiv.org/abs/2504.13701v1",
      "published": "2025-04-18",
      "categories": [
        "eess.SY",
        "cs.MA",
        "cs.SY"
      ]
    },
    {
      "title": "MR-MAGIC: Robust Causal Inference Using Many Weak Genetic Interactions",
      "authors": [
        "Di Zhang",
        "Minhao Yao",
        "Zhonghua Liu",
        "Baoluo Sun"
      ],
      "abstract": "Mendelian randomization (MR) studies commonly use genetic variants as\ninstrumental variables to estimate causal effects of exposures on outcomes.\nHowever, the presence of invalid instruments-even when numerous-can lead to\nbiased causal estimates. We propose a novel identification strategy that\nremains valid even when all candidate instruments are invalid by leveraging\ngenetic interactions that collectively explain substantial exposure variation.\nRecognizing that individual interaction effects may be weak, we develop\nMR-MAGIC (Mendelian Randomization with MAny weak Genetic Interactions for\nCausality), a robust method that simultaneously addresses instrument invalidity\nand improves estimation efficiency. MR-MAGIC provides consistent and\nasymptotically normal estimates under a many-weak-interactions asymptotic\nframework. Comprehensive simulations and applications to UK Biobank data\ndemonstrate that MR-MAGIC outperforms conventional MR methods in practice,\noffering reliable causal inference when standard approaches fail.",
      "pdf_url": "http://arxiv.org/pdf/2504.13565v1",
      "arxiv_url": "http://arxiv.org/abs/2504.13565v1",
      "published": "2025-04-18",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Bayesian Model Averaging in Causal Instrumental Variable Models",
      "authors": [
        "Gregor Steiner",
        "Mark Steel"
      ],
      "abstract": "Instrumental variables are a popular tool to infer causal effects under\nunobserved confounding, but choosing suitable instruments is challenging in\npractice. We propose gIVBMA, a Bayesian model averaging procedure that\naddresses this challenge by averaging across different sets of instrumental\nvariables and covariates in a structural equation model. Our approach extends\nprevious work through a scale-invariant prior structure and accommodates\nnon-Gaussian outcomes and treatments, offering greater flexibility than\nexisting methods. The computational strategy uses conditional Bayes factors to\nupdate models separately for the outcome and treatments. We prove that this\nmodel selection procedure is consistent. By explicitly accounting for model\nuncertainty, gIVBMA allows instruments and covariates to switch roles and\nprovides robustness against invalid instruments. In simulation experiments,\ngIVBMA outperforms current state-of-the-art methods. We demonstrate its\nusefulness in two empirical applications: the effects of malaria and\ninstitutions on income per capita and the returns to schooling. A software\nimplementation of gIVBMA is available in Julia.",
      "pdf_url": "http://arxiv.org/pdf/2504.13520v1",
      "arxiv_url": "http://arxiv.org/abs/2504.13520v1",
      "published": "2025-04-18",
      "categories": [
        "stat.ME",
        "econ.EM",
        "math.ST",
        "stat.TH"
      ]
    }
  ]
}