{
  "last_updated": "2026-01-21T01:00:24.425969",
  "papers": [
    {
      "title": "Context-aware Graph Causality Inference for Few-Shot Molecular Property Prediction",
      "authors": [
        "Van Thuy Hoang",
        "O-Joun Lee"
      ],
      "abstract": "Molecular property prediction is becoming one of the major applications of graph learning in Web-based services, e.g., online protein structure prediction and drug discovery. A key challenge arises in few-shot scenarios, where only a few labeled molecules are available for predicting unseen properties. Recently, several studies have used in-context learning to capture relationships among molecules and properties, but they face two limitations in: (1) exploiting prior knowledge of functional groups that are causally linked to properties and (2) identifying key substructures directly correlated with properties. We propose CaMol, a context-aware graph causality inference framework, to address these challenges by using a causal inference perspective, assuming that each molecule consists of a latent causal structure that determines a specific property. First, we introduce a context graph that encodes chemical knowledge by linking functional groups, molecules, and properties to guide the discovery of causal substructures. Second, we propose a learnable atom masking strategy to disentangle causal substructures from confounding ones. Third, we introduce a distribution intervener that applies backdoor adjustment by combining causal substructures with chemically grounded confounders, disentangling causal effects from real-world chemical variations. Experiments on diverse molecular datasets showed that CaMol achieved superior accuracy and sample efficiency in few-shot tasks, showing its generalizability to unseen properties. Also, the discovered causal substructures were strongly aligned with chemical knowledge about functional groups, supporting the model interpretability.",
      "pdf_url": "https://arxiv.org/pdf/2601.11135v1",
      "arxiv_url": "http://arxiv.org/abs/2601.11135v1",
      "published": "2026-01-16",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "MiCA: A Mobility-Informed Causal Adapter for Lightweight Epidemic Forecasting",
      "authors": [
        "Suhan Guo",
        "Jiahong Deng",
        "Furao Shen"
      ],
      "abstract": "Accurate forecasting of infectious disease dynamics is critical for public health planning and intervention. Human mobility plays a central role in shaping the spatial spread of epidemics, but mobility data are noisy, indirect, and difficult to integrate reliably with disease records. Meanwhile, epidemic case time series are typically short and reported at coarse temporal resolution. These conditions limit the effectiveness of parameter-heavy mobility-aware forecasters that rely on clean and abundant data. In this work, we propose the Mobility-Informed Causal Adapter (MiCA), a lightweight and architecture-agnostic module for epidemic forecasting. MiCA infers mobility relations through causal discovery and integrates them into temporal forecasting models via gated residual mixing. This design allows lightweight forecasters to selectively exploit mobility-derived spatial structure while remaining robust under noisy and data-limited conditions, without introducing heavy relational components such as graph neural networks or full attention. Extensive experiments on four real-world epidemic datasets, including COVID-19 incidence, COVID-19 mortality, influenza, and dengue, show that MiCA consistently improves lightweight temporal backbones, achieving an average relative error reduction of 7.5\\% across forecasting horizons. Moreover, MiCA attains performance competitive with SOTA spatio-temporal models while remaining lightweight.",
      "pdf_url": "https://arxiv.org/pdf/2601.11089v1",
      "arxiv_url": "http://arxiv.org/abs/2601.11089v1",
      "published": "2026-01-16",
      "categories": [
        "cs.AI"
      ]
    },
    {
      "title": "VERHallu: Evaluating and Mitigating Event Relation Hallucination in Video Large Language Models",
      "authors": [
        "Zefan Zhang",
        "Kehua Zhu",
        "Shijie Jiang",
        "Hongyuan Lu",
        "Shengkai Sun",
        "Tian Bai"
      ],
      "abstract": "Video Large Language Models (VideoLLMs) exhibit various types of hallucinations. Existing research has primarily focused on hallucinations involving the presence of events, objects, and scenes in videos, while largely neglecting event relation hallucination. In this paper, we introduce a novel benchmark for evaluating the Video Event Relation Hallucination, named VERHallu. This benchmark focuses on causal, temporal, and subevent relations between events, encompassing three types of tasks: relation classification, question answering, and counterfactual question answering, for a comprehensive evaluation of event relation hallucination. Additionally, it features counterintuitive video scenarios that deviate from typical pretraining distributions, with each sample accompanied by human-annotated candidates covering both vision-language and pure language biases. Our analysis reveals that current state-of-the-art VideoLLMs struggle with dense-event relation reasoning, often relying on prior knowledge due to insufficient use of frame-level cues. Although these models demonstrate strong grounding capabilities for key events, they often overlook the surrounding subevents, leading to an incomplete and inaccurate understanding of event relations. To tackle this, we propose a Key-Frame Propagating (KFP) strategy, which reallocates frame-level attention within intermediate layers to enhance multi-event understanding. Experiments show it effectively mitigates the event relation hallucination without affecting inference speed.",
      "pdf_url": "https://arxiv.org/pdf/2601.10010v1",
      "arxiv_url": "http://arxiv.org/abs/2601.10010v1",
      "published": "2026-01-15",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "Where Knowledge Collides: A Mechanistic Study of Intra-Memory Knowledge Conflict in Language Models",
      "authors": [
        "Minh Vu Pham",
        "Hsuvas Borkakoty",
        "Yufang Hou"
      ],
      "abstract": "In language models (LMs), intra-memory knowledge conflict largely arises when inconsistent information about the same event is encoded within the model's parametric knowledge. While prior work has primarily focused on resolving conflicts between a model's internal knowledge and external resources through approaches such as fine-tuning or knowledge editing, the problem of localizing conflicts that originate during pre-training within the model's internal representations remain unexplored. In this work, we design a framework based on mechanistic interpretability methods to identify where and how conflicting knowledge from the pre-training data is encoded within LMs. Our findings contribute to a growing body of evidence that specific internal components of a language model are responsible for encoding conflicting knowledge from pre-training, and we demonstrate how mechanistic interpretability methods can be leveraged to causally intervene in and control conflicting knowledge at inference time.",
      "pdf_url": "https://arxiv.org/pdf/2601.09445v1",
      "arxiv_url": "http://arxiv.org/abs/2601.09445v1",
      "published": "2026-01-14",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Automatic debiased machine learning and sensitivity analysis for sample selection models",
      "authors": [
        "Jakob Bjelac",
        "Victor Chernozhukov",
        "Phil-Adrian Klotz",
        "Jannis Kueck",
        "Theresa M. A. Schmitz"
      ],
      "abstract": "In this paper, we extend the Riesz representation framework to causal inference under sample selection, where both treatment assignment and outcome observability are non-random. Formulating the problem in terms of a Riesz representer enables stable estimation and a transparent decomposition of omitted variable bias into three interpretable components: a data-identified scale factor, outcome confounding strength, and selection confounding strength. For estimation, we employ the ForestRiesz estimator, which accounts for selective outcome observability while avoiding the instability associated with direct propensity score inversion. We assess finite-sample performance through a simulation study and show that conventional double machine learning approaches can be highly sensitive to tuning parameters due to their reliance on inverse probability weighting, whereas the ForestRiesz estimator delivers more stable performance by leveraging automatic debiased machine learning. In an empirical application to the gender wage gap in the U.S., we find that our ForestRiesz approach yields larger treatment effect estimates than a standard double machine learning approach, suggesting that ignoring sample selection leads to an underestimation of the gender wage gap. Sensitivity analysis indicates that implausibly strong unobserved confounding would be required to overturn our results. Overall, our approach provides a unified, robust, and computationally attractive framework for causal inference under sample selection.",
      "pdf_url": "https://arxiv.org/pdf/2601.08643v1",
      "arxiv_url": "http://arxiv.org/abs/2601.08643v1",
      "published": "2026-01-13",
      "categories": [
        "econ.EM",
        "stat.ML"
      ]
    },
    {
      "title": "Relational Knowledge Distillation Using Fine-tuned Function Vectors",
      "authors": [
        "Andrea Kang",
        "Yingnian Wu",
        "Hongjing Lu"
      ],
      "abstract": "Representing relations between concepts is a core prerequisite for intelligent systems to make sense of the world. Recent work using causal mediation analysis has shown that a small set of attention heads encodes task representation in in-context learning, captured in a compact representation known as the function vector. We show that fine-tuning function vectors with only a small set of examples (about 20 word pairs) yields better performance on relation-based word-completion tasks than using the original vectors derived from causal mediation analysis. These improvements hold for both small and large language models. Moreover, the fine-tuned function vectors yield improved decoding performance for relation words and show stronger alignment with human similarity judgments of semantic relations. Next, we introduce the composite function vector - a weighted combination of fine-tuned function vectors - to extract relational knowledge and support analogical reasoning. At inference time, inserting this composite vector into LLM activations markedly enhances performance on challenging analogy problems drawn from cognitive science and SAT benchmarks. Our results highlight the potential of activation patching as a controllable mechanism for encoding and manipulating relational knowledge, advancing both the interpretability and reasoning capabilities of large language models.",
      "pdf_url": "https://arxiv.org/pdf/2601.08169v1",
      "arxiv_url": "http://arxiv.org/abs/2601.08169v1",
      "published": "2026-01-13",
      "categories": [
        "cs.CL",
        "cs.LG"
      ]
    },
    {
      "title": "Debiasing Large Language Models via Adaptive Causal Prompting with Sketch-of-Thought",
      "authors": [
        "Bowen Li",
        "Ziqi Xu",
        "Jing Ren",
        "Renqiang Luo",
        "Xikun Zhang",
        "Xiuzhen Zhang",
        "Yongli Ren",
        "Feng Xia"
      ],
      "abstract": "Despite notable advancements in prompting methods for Large Language Models (LLMs), such as Chain-of-Thought (CoT), existing strategies still suffer from excessive token usage and limited generalisability across diverse reasoning tasks. To address these limitations, we propose an Adaptive Causal Prompting with Sketch-of-Thought (ACPS) framework, which leverages structural causal models to infer the causal effect of a query on its answer and adaptively select an appropriate intervention (i.e., standard front-door and conditional front-door adjustments). This design enables generalisable causal reasoning across heterogeneous tasks without task-specific retraining. By replacing verbose CoT with concise Sketch-of-Thought, ACPS enables efficient reasoning that significantly reduces token usage and inference cost. Extensive experiments on multiple reasoning benchmarks and LLMs demonstrate that ACPS consistently outperforms existing prompting baselines in terms of accuracy, robustness, and computational efficiency.",
      "pdf_url": "https://arxiv.org/pdf/2601.08108v1",
      "arxiv_url": "http://arxiv.org/abs/2601.08108v1",
      "published": "2026-01-13",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "The Role of Confounders and Linearity in Ecological Inference: A Reassessment",
      "authors": [
        "Shiro Kuriwaki",
        "Cory McCartan"
      ],
      "abstract": "Estimating conditional means using only the marginal means available from aggregate data is commonly known as the ecological inference problem (EI). We provide a reassessment of EI, including a new formalization of identification conditions and a demonstration of how these conditions fail to hold in common cases. The identification conditions reveal that, similar to causal inference, credible ecological inference requires controlling for confounders. The aggregation process itself creates additional structure to assist in estimation by restricting the conditional expectation function to be linear in the predictor variable. A linear model perspective also clarifies the differences between the EI methods commonly used in the literature, and when they lead to ecological fallacies. We provide an overview of new methodology which builds on both the identification and linearity results to flexibly control for confounders and yield improved ecological inferences. Finally, using datasets for common EI problems in which the ground truth is fortuitously observed, we show that, while covariates can help, all methods are prone to overestimating both racial polarization and nationalized partisan voting.",
      "pdf_url": "https://arxiv.org/pdf/2601.07668v1",
      "arxiv_url": "http://arxiv.org/abs/2601.07668v1",
      "published": "2026-01-12",
      "categories": [
        "stat.AP"
      ]
    },
    {
      "title": "Functional Synthetic Control Methods for Metric Space-Valued Outcomes",
      "authors": [
        "Ryo Okano",
        "Daisuke Kurisu"
      ],
      "abstract": "The synthetic control method (SCM) is a widely used tool for evaluating causal effects of policy changes in panel data settings. Recent studies have extended its framework to accommodate complex outcomes that take values in metric spaces, such as distributions, functions, networks, covariance matrices, and compositional data. However, due to the lack of linear structure in general metric spaces, theoretical guarantees for estimation and inference within these extended frameworks remain underdeveloped. In this study, we propose the functional synthetic control (FSC) method as an extension of the SCM for metric space-valued outcomes. To address challenges arising from the nonlinearlity of metric spaces, we leverage isometric embeddings into Hilbert spaces. Building on this approach, we develop the FSC and augmented FSC estimators for counterfactual outcomes, with the latter being a bias-corrected version of the former. We then derive their finite-sample error bounds to establish theoretical guarantees for estimation, and construct prediction sets based on these estimators to conduct inference on causal effects. We demonstrate the usefulness of the proposed framework through simulation studies and three empirical applications.",
      "pdf_url": "https://arxiv.org/pdf/2601.07539v1",
      "arxiv_url": "http://arxiv.org/abs/2601.07539v1",
      "published": "2026-01-12",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Minimum Wasserstein distance estimator under covariate shift: closed-form, super-efficiency and irregularity",
      "authors": [
        "Junjun Lang",
        "Qiong Zhang",
        "Yukun Liu"
      ],
      "abstract": "Covariate shift arises when covariate distributions differ between source and target populations while the conditional distribution of the response remains invariant, and it underlies problems in missing data and causal inference. We propose a minimum Wasserstein distance estimation framework for inference under covariate shift that avoids explicit modeling of outcome regressions or importance weights. The resulting W-estimator admits a closed-form expression and is numerically equivalent to the classical 1-nearest neighbor estimator, yielding a new optimal transport interpretation of nearest neighbor methods. We establish root-$n$ asymptotic normality and show that the estimator is not asymptotically linear, leading to super-efficiency relative to the semiparametric efficient estimator under covariate shift in certain regimes, and uniformly in missing data problems. Numerical simulations, along with an analysis of a rainfall dataset, underscore the exceptional performance of our W-estimator.",
      "pdf_url": "https://arxiv.org/pdf/2601.07282v1",
      "arxiv_url": "http://arxiv.org/abs/2601.07282v1",
      "published": "2026-01-12",
      "categories": [
        "stat.ME",
        "stat.ML"
      ]
    }
  ]
}