{
  "last_updated": "2025-08-23T00:50:23.506199",
  "papers": [
    {
      "title": "Understanding Action Effects through Instrumental Empowerment in Multi-Agent Reinforcement Learning",
      "authors": [
        "Ardian Selmonaj",
        "Miroslav Strupl",
        "Oleg Szehr",
        "Alessandro Antonucci"
      ],
      "abstract": "To reliably deploy Multi-Agent Reinforcement Learning (MARL) systems, it is\ncrucial to understand individual agent behaviors within a team. While prior\nwork typically evaluates overall team performance based on explicit reward\nsignals or learned value functions, it is unclear how to infer agent\ncontributions in the absence of any value feedback. In this work, we\ninvestigate whether meaningful insights into agent behaviors can be extracted\nthat are consistent with the underlying value functions, solely by analyzing\nthe policy distribution. Inspired by the phenomenon that intelligent agents\ntend to pursue convergent instrumental values, which generally increase the\nlikelihood of task success, we introduce Intended Cooperation Values (ICVs), a\nmethod based on information-theoretic Shapley values for quantifying each\nagent's causal influence on their co-players' instrumental empowerment.\nSpecifically, ICVs measure an agent's action effect on its teammates' policies\nby assessing their decision uncertainty and preference alignment. The analysis\nacross cooperative and competitive MARL environments reveals the extent to\nwhich agents adopt similar or diverse strategies. By comparing action effects\nbetween policies and value functions, our method identifies which agent\nbehaviors are beneficial to team success, either by fostering deterministic\ndecisions or by preserving flexibility for future action choices. Our proposed\nmethod offers novel insights into cooperation dynamics and enhances\nexplainability in MARL systems.",
      "pdf_url": "http://arxiv.org/pdf/2508.15652v1",
      "arxiv_url": "http://arxiv.org/abs/2508.15652v1",
      "published": "2025-08-21",
      "categories": [
        "cs.AI",
        "cs.IT",
        "cs.LG",
        "cs.MA",
        "math.IT"
      ]
    },
    {
      "title": "CSTEapp: An interactive R-Shiny application of the covariate-specific treatment effect curve for visualizing individualized treatment rule",
      "authors": [
        "Yi Zhou",
        "Yuhao Deng",
        "Yu-Shi Tian",
        "Peng Wu",
        "Wenjie Hu",
        "Haoxiang Wang",
        "Ewout Steyerberg",
        "Xiao-Hua Zhou"
      ],
      "abstract": "In precision medicine, deriving the individualized treatment rule (ITR) is\ncrucial for recommending the optimal treatment based on patients' baseline\ncovariates. The covariate-specific treatment effect (CSTE) curve presents a\ngraphical method to visualize an ITR within a causal inference framework.\nRecent advancements have enhanced the causal interpretation of the CSTE curves\nand provided methods for deriving simultaneous confidence bands for various\nstudy types. To facilitate the implementation of these methods and make ITR\nestimation more accessible, we developed CSTEapp, a web-based application built\non the R Shiny framework. CSTEapp allows users to upload data and create CSTE\ncurves through simple point and click operations, making it the first\napplication for estimating the ITRs. CSTEapp simplifies the analytical process\nby providing interactive graphical user interfaces with dynamic results,\nenabling users to easily report optimal treatments for individual patients\nbased on their covariates information. Currently, CSTEapp is applicable to\nstudies with binary and time-to-event outcomes, and we continually expand its\ncapabilities to accommodate other outcome types as new methods emerge. We\ndemonstrate the utility of CSTEapp using real-world examples and simulation\ndatasets. By making advanced statistical methods more accessible, CSTEapp\nempowers researchers and practitioners across various fields to advance\nprecision medicine and improve patient outcomes.",
      "pdf_url": "http://arxiv.org/pdf/2508.15265v1",
      "arxiv_url": "http://arxiv.org/abs/2508.15265v1",
      "published": "2025-08-21",
      "categories": [
        "stat.CO",
        "stat.AP"
      ]
    },
    {
      "title": "Untangling Sample and Population Level Estimands in Bayesian Causal Inference",
      "authors": [
        "Arman Oganisian"
      ],
      "abstract": "Bayesian inference for causal estimands has been growing in popularity,\nhowever many misconceptions and implementation errors arise from conflating\nsample and population-level estimands. We have anecdotally witnessed these at\nconference talks, in the course of peer review service, and even in published\nand arXiv-ed papers. Our goal here is to elucidate the crucial differences\nbetween sample and population-level quantities when it comes to identification,\nmodeling, Bayesian computation, and interpretation. For example, common\nsample-level estimands require cross-world assumptions for identification,\nwhereas common population-level estimands do not. Similarly, the former\nrequires explicit imputation of counterfactuals from their joint posterior,\nwhereas the latter typically only requires a posterior distribution over\nparameters. We start by defining some examples of both types of estimands, then\ndiscuss the full joint posterior over all unknowns (both missing\ncounterfactuals and population distribution parameters). We continue to outline\nhow inference for different estimands are derived from different marginals of\nthis joint posterior. Because the differences are conceptually subtle but can\nbe practically substantial, we provide an illustration of using synthetic data\nin Stan. We also provide a detailed appendix with derivations and computational\ntips along with a discussion of common implementation errors. The overarching\nmessage here is to always engage in first-principles thinking about which\nmarginal of the joint posterior is of interest in a particular application,\nthen follow the strict logic of Bayes' theorem and probability to avoid common\nimplementation errors.",
      "pdf_url": "http://arxiv.org/pdf/2508.15016v1",
      "arxiv_url": "http://arxiv.org/abs/2508.15016v1",
      "published": "2025-08-20",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "Bounding Causal Effects and Counterfactuals",
      "authors": [
        "Tobias Maringgele"
      ],
      "abstract": "Causal inference often hinges on strong assumptions - such as no unmeasured\nconfounding or perfect compliance - that are rarely satisfied in practice.\nPartial identification offers a principled alternative: instead of relying on\nunverifiable assumptions to estimate causal effects precisely, it derives\nbounds that reflect the uncertainty inherent in the data. Despite its\ntheoretical appeal, partial identification remains underutilized in applied\nwork, in part due to the fragmented nature of existing methods and the lack of\npractical guidance. This thesis addresses these challenges by systematically\ncomparing a diverse set of bounding algorithms across multiple causal\nscenarios. We implement, extend, and unify state-of-the-art methods - including\nsymbolic, optimization-based, and information-theoretic approaches - within a\ncommon evaluation framework. In particular, we propose an extension of a\nrecently introduced entropy-bounded method, making it applicable to\ncounterfactual queries such as the Probability of Necessity and Sufficiency\n(PNS). Our empirical study spans thousands of randomized simulations involving\nboth discrete and continuous data-generating processes. We assess each method\nin terms of bound tightness, computational efficiency, and robustness to\nassumption violations. To support practitioners, we distill our findings into a\npractical decision tree for algorithm selection and train a machine learning\nmodel to predict the best-performing method based on observable data\ncharacteristics.\n  All implementations are released as part of an open-source Python package,\nCausalBoundingEngine, which enables users to apply and compare bounding methods\nthrough a unified interface.",
      "pdf_url": "http://arxiv.org/pdf/2508.13607v1",
      "arxiv_url": "http://arxiv.org/abs/2508.13607v1",
      "published": "2025-08-19",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ME",
        "62A01 (Foundations of statistics), 68T01 (Artificial intelligence,\n  general)",
        "G.3; I.2.6"
      ]
    },
    {
      "title": "Counterfactual Probabilistic Diffusion with Expert Models",
      "authors": [
        "Wenhao Mu",
        "Zhi Cao",
        "Mehmed Uludag",
        "Alexander Rodríguez"
      ],
      "abstract": "Predicting counterfactual distributions in complex dynamical systems is\nessential for scientific modeling and decision-making in domains such as public\nhealth and medicine. However, existing methods often rely on point estimates or\npurely data-driven models, which tend to falter under data scarcity. We propose\na time series diffusion-based framework that incorporates guidance from\nimperfect expert models by extracting high-level signals to serve as structured\npriors for generative modeling. Our method, ODE-Diff, bridges mechanistic and\ndata-driven approaches, enabling more reliable and interpretable causal\ninference. We evaluate ODE-Diff across semi-synthetic COVID-19 simulations,\nsynthetic pharmacological dynamics, and real-world case studies, demonstrating\nthat it consistently outperforms strong baselines in both point prediction and\ndistributional accuracy.",
      "pdf_url": "http://arxiv.org/pdf/2508.13355v1",
      "arxiv_url": "http://arxiv.org/abs/2508.13355v1",
      "published": "2025-08-18",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ME"
      ]
    },
    {
      "title": "Reinforced Context Order Recovery for Adaptive Reasoning and Planning",
      "authors": [
        "Long Ma",
        "Fangwei Zhong",
        "Yizhou Wang"
      ],
      "abstract": "Modern causal language models, followed by rapid developments in discrete\ndiffusion models, can now produce a wide variety of interesting and useful\ncontent. However, these families of models are predominantly trained to output\ntokens with a fixed (left-to-right) or random order, which may deviate from the\nlogical order in which tokens are generated originally. In this paper, we\nobserve that current causal and diffusion models encounter difficulties in\nproblems that require adaptive token generation orders to solve tractably,\nwhich we characterize with the $\\mathcal{V}$-information framework. Motivated\nby this, we propose Reinforced Context Order Recovery (ReCOR), a\nreinforcement-learning-based framework to extract adaptive, data-dependent\ntoken generation orders from text data without annotations. Self-supervised by\ntoken prediction statistics, ReCOR estimates the hardness of predicting every\nunfilled token and adaptively selects the next token during both training and\ninference. Experiments on challenging reasoning and planning datasets\ndemonstrate the superior performance of ReCOR compared with baselines,\nsometimes outperforming oracle models supervised with the ground-truth order.",
      "pdf_url": "http://arxiv.org/pdf/2508.13070v1",
      "arxiv_url": "http://arxiv.org/abs/2508.13070v1",
      "published": "2025-08-18",
      "categories": [
        "cs.CL",
        "cs.AI"
      ]
    },
    {
      "title": "Bayesian Double Machine Learning for Causal Inference",
      "authors": [
        "Francis J. DiTraglia",
        "Laura Liu"
      ],
      "abstract": "This paper proposes a simple, novel, and fully-Bayesian approach for causal\ninference in partially linear models with high-dimensional control variables.\nOff-the-shelf machine learning methods can introduce biases in the causal\nparameter known as regularization-induced confounding. To address this, we\npropose a Bayesian Double Machine Learning (BDML) method, which modifies a\nstandard Bayesian multivariate regression model and recovers the causal effect\nof interest from the reduced-form covariance matrix. Our BDML is related to the\nburgeoning frequentist literature on DML while addressing its limitations in\nfinite-sample inference. Moreover, the BDML is based on a fully generative\nprobability model in the DML context, adhering to the likelihood principle. We\nshow that in high dimensional setups the naive estimator implicitly assumes no\nselection on observables--unlike our BDML. The BDML exhibits lower asymptotic\nbias and achieves asymptotic normality and semiparametric efficiency as\nestablished by a Bernstein-von Mises theorem, thereby ensuring robustness to\nmisspecification. In simulations, our BDML achieves lower RMSE, better\nfrequentist coverage, and shorter confidence interval width than alternatives\nfrom the literature, both Bayesian and frequentist.",
      "pdf_url": "http://arxiv.org/pdf/2508.12688v1",
      "arxiv_url": "http://arxiv.org/abs/2508.12688v1",
      "published": "2025-08-18",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "The Role of AI in Facilitating Interdisciplinary Collaboration: Evidence from AlphaFold",
      "authors": [
        "Naixuan Zhao",
        "Chunli Wei",
        "Xinyan Zhang",
        "Jiang Li"
      ],
      "abstract": "The acceleration of artificial intelligence (AI) in science is recognized and\nmany scholars have begun to explore its role in interdisciplinary\ncollaboration. However, the mechanisms and extent of this impact are still\nunclear. This study, using AlphaFold's impact on structural biologists,\nexamines how AI technologies influence interdisciplinary collaborative\npatterns. By analyzing 1,247 AlphaFold-related papers and 7,700 authors from\nScopus, we employ bibliometric analysis and causal inference to compare\ninterdisciplinary collaboration between AlphaFold adopters and non-adopters.\nContrary to the widespread belief that AI facilitates interdisciplinary\ncollaboration, our findings show that AlphaFold increased structural\nbiology-computer science collaborations by just 0.48%, with no measurable\neffect on other disciplines. Specifically, AI creates interdisciplinary\ncollaboration demands with specific disciplines due to its technical\ncharacteristics, but this demand is weakened by technological democratization\nand other factors. These findings demonstrate that artificial intelligence (AI)\nalone has limited efficacy in bridging disciplinary divides or fostering\nmeaningful interdisciplinary collaboration.",
      "pdf_url": "http://arxiv.org/pdf/2508.13234v1",
      "arxiv_url": "http://arxiv.org/abs/2508.13234v1",
      "published": "2025-08-18",
      "categories": [
        "cs.DL",
        "cs.AI",
        "cs.CY"
      ]
    },
    {
      "title": "Root Cause Analysis of Hydrogen Bond Separation in Spatio-Temporal Molecular Dynamics using Causal Models",
      "authors": [
        "Rahmat K. Adesunkanmi",
        "Ashfaq Khokhar",
        "Goce Trajcevski",
        "Sohail Murad"
      ],
      "abstract": "Molecular dynamics simulations (MDS) face challenges, including\nresource-heavy computations and the need to manually scan outputs to detect\n\"interesting events,\" such as the formation and persistence of hydrogen bonds\nbetween atoms of different molecules. A critical research gap lies in\nidentifying the underlying causes of hydrogen bond formation and separation\n-understanding which interactions or prior events contribute to their emergence\nover time. With this challenge in mind, we propose leveraging spatio-temporal\ndata analytics and machine learning models to enhance the detection of these\nphenomena. In this paper, our approach is inspired by causal modeling and aims\nto identify the root cause variables of hydrogen bond formation and separation\nevents. Specifically, we treat the separation of hydrogen bonds as an\n\"intervention\" occurring and represent the causal structure of the bonding and\nseparation events in the MDS as graphical causal models. These causal models\nare built using a variational autoencoder-inspired architecture that enables us\nto infer causal relationships across samples with diverse underlying causal\ngraphs while leveraging shared dynamic information. We further include a step\nto infer the root causes of changes in the joint distribution of the causal\nmodels. By constructing causal models that capture shifts in the conditional\ndistributions of molecular interactions during bond formation or separation,\nthis framework provides a novel perspective on root cause analysis in molecular\ndynamic systems. We validate the efficacy of our model empirically on the\natomic trajectories that used MDS for chiral separation, demonstrating that we\ncan predict many steps in the future and also find the variables driving the\nobserved changes in the system.",
      "pdf_url": "http://arxiv.org/pdf/2508.12500v1",
      "arxiv_url": "http://arxiv.org/abs/2508.12500v1",
      "published": "2025-08-17",
      "categories": [
        "cs.AI",
        "cs.LG",
        "q-bio.QM"
      ]
    },
    {
      "title": "GALA: Can Graph-Augmented Large Language Model Agentic Workflows Elevate Root Cause Analysis?",
      "authors": [
        "Yifang Tian",
        "Yaming Liu",
        "Zichun Chong",
        "Zihang Huang",
        "Hans-Arno Jacobsen"
      ],
      "abstract": "Root cause analysis (RCA) in microservice systems is challenging, requiring\non-call engineers to rapidly diagnose failures across heterogeneous telemetry\nsuch as metrics, logs, and traces. Traditional RCA methods often focus on\nsingle modalities or merely rank suspect services, falling short of providing\nactionable diagnostic insights with remediation guidance. This paper introduces\nGALA, a novel multi-modal framework that combines statistical causal inference\nwith LLM-driven iterative reasoning for enhanced RCA. Evaluated on an\nopen-source benchmark, GALA achieves substantial improvements over\nstate-of-the-art methods of up to 42.22% accuracy. Our novel human-guided LLM\nevaluation score shows GALA generates significantly more causally sound and\nactionable diagnostic outputs than existing methods. Through comprehensive\nexperiments and a case study, we show that GALA bridges the gap between\nautomated failure diagnosis and practical incident resolution by providing both\naccurate root cause identification and human-interpretable remediation\nguidance.",
      "pdf_url": "http://arxiv.org/pdf/2508.12472v1",
      "arxiv_url": "http://arxiv.org/abs/2508.12472v1",
      "published": "2025-08-17",
      "categories": [
        "cs.AI"
      ]
    }
  ]
}