{
  "last_updated": "2025-04-03T00:50:00.349693",
  "papers": [
    {
      "title": "Partial Transportability for Domain Generalization",
      "authors": [
        "Kasra Jalaldoust",
        "Alexis Bellot",
        "Elias Bareinboim"
      ],
      "abstract": "A fundamental task in AI is providing performance guarantees for predictions\nmade in unseen domains. In practice, there can be substantial uncertainty about\nthe distribution of new data, and corresponding variability in the performance\nof existing predictors. Building on the theory of partial identification and\ntransportability, this paper introduces new results for bounding the value of a\nfunctional of the target distribution, such as the generalization error of a\nclassifier, given data from source domains and assumptions about the data\ngenerating mechanisms, encoded in causal diagrams. Our contribution is to\nprovide the first general estimation technique for transportability problems,\nadapting existing parameterization schemes such Neural Causal Models to encode\nthe structural constraints necessary for cross-population inference. We\ndemonstrate the expressiveness and consistency of this procedure and further\npropose a gradient-based optimization scheme for making scalable inferences in\npractice. Our results are corroborated with experiments.",
      "pdf_url": "http://arxiv.org/pdf/2503.23605v1",
      "arxiv_url": "http://arxiv.org/abs/2503.23605v1",
      "published": "2025-03-30",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ]
    },
    {
      "title": "Bayesian Inference for High-dimensional Time Series with a Directed Acyclic Graphical Structure",
      "authors": [
        "Arkaprava Roy",
        "Anindya Roy",
        "Subhashis Ghosal"
      ],
      "abstract": "In multivariate time series analysis, understanding the underlying causal\nrelationships among variables is often of interest for various applications.\nDirected acyclic graphs (DAGs) provide a powerful framework for representing\ncausal dependencies. This paper proposes a novel Bayesian approach for modeling\nmultivariate time series where conditional independencies and causal structure\nare encoded by a DAG. The proposed model allows structural properties such as\nstationarity to be easily accommodated. Given the application, we further\nextend the model for matrix-variate time series. We take a Bayesian approach to\ninference, and a ``projection-posterior'' based efficient computational\nalgorithm is developed. The posterior convergence properties of the proposed\nmethod are established along with two identifiability results for the\nunrestricted structural equation models. The utility of the proposed method is\ndemonstrated through simulation studies and real data analysis.",
      "pdf_url": "http://arxiv.org/pdf/2503.23563v1",
      "arxiv_url": "http://arxiv.org/abs/2503.23563v1",
      "published": "2025-03-30",
      "categories": [
        "stat.ME",
        "math.ST",
        "stat.TH"
      ]
    },
    {
      "title": "Rethinking Structural Equation Modeling in Political Science: Challenges, Best Practices, and Future Directions",
      "authors": [
        "Bang Quan Zheng"
      ],
      "abstract": "Structural Equation Modeling (SEM) or Covariance Structure Analysis (CSA) is\na versatile and powerful method in the social and behavioral sciences,\nproviding a framework for modeling complex relationships, testing mediation,\naccounting for measurement error, and analyzing latent constructs. However, SEM\nremains underutilized in in political science; its application is often marred\nby misunderstandings, misinterpretations, and methodological pitfalls that can\ncompromise the validity and interpretability of findings. This article examines\nkey challenges in SEM applications within political science, including test\nstatistics and fit indices, model specification, estimator selection, and\ncausal inference. It offers practical recommendations for enhancing\nmethodological rigor and introduces recent advancements in causal inference.",
      "pdf_url": "http://arxiv.org/pdf/2503.23551v1",
      "arxiv_url": "http://arxiv.org/abs/2503.23551v1",
      "published": "2025-03-30",
      "categories": [
        "stat.AP"
      ]
    },
    {
      "title": "Reinterpreting demand estimation",
      "authors": [
        "Jiafeng Chen"
      ],
      "abstract": "This paper connects the literature on demand estimation to the literature on\ncausal inference by interpreting nonparametric structural assumptions as\nrestrictions on counterfactual outcomes. It offers nontrivial and equivalent\nrestatements of key demand estimation assumptions in the Neyman-Rubin potential\noutcomes model, for both settings with market-level data (Berry and Haile,\n2014) and settings with demographic-specific market shares (Berry and Haile,\n2024). This exercise helps bridge the literatures on structural estimation and\non causal inference by separating notational and linguistic differences from\nsubstantive ones.",
      "pdf_url": "http://arxiv.org/pdf/2503.23524v1",
      "arxiv_url": "http://arxiv.org/abs/2503.23524v1",
      "published": "2025-03-30",
      "categories": [
        "econ.EM",
        "stat.ME"
      ]
    },
    {
      "title": "Bridging General Relativity and Quantum Dynamics Through Finite-Resource Logical Models",
      "authors": [
        "Arturo Tozzi",
        "Michel Planat"
      ],
      "abstract": "A theoretical framework bridging General Relativity (GR) and Quantum Dynamics\n(QD) is introduced through the application of Kripke semantics and linear\nlogic. While conventional unification efforts often rely on structural or\ngeometrical formulations, we instead treat causality, energy and information as\nfinite, non-replicable resources constraining physical transitions and\ninference. Our framework, termed Energy Constrained Linear Causality (ECLC),\nmodels quantum transitions and spacetime evolution as logically constrained\nprocesses in which each implication spends limited resources and cannot be\narbitrarily duplicated or reversed. We construct a causal inference model where\nphysical operations like quantum measurement, entanglement propagation and\nspacetime curvature are expressed as energy-weighted, one-time transformations.\nKripke semantics formalizes the logical accessibility of physical states,\ncapturing context-sensitive transitions and the irreversibility of information\nflow under finite conditions. We derive a structured method for modelling\nobserver-dependent outcomes without invoking background-independence or\nhigh-dimensional embeddings. We formulate a series of testable predictions with\ncontrolled deviations from standard GR and QD expectations. The\nconsumption-based irreversibility introduces an intrinsic mechanism of symmetry\nbreaking. In GR, it restricts mutual causal accessibility by bounding inference\ndepth with curvature-weighted energy costs. In QD, it disrupts the reciprocity\nof conditional probabilities and undermines time symmetry in measurement\nsequences. Therefore, ECLC provides a unified, resource-aware logic for\ndescribing causality, computation and emergence within a finite physical\nuniverse.",
      "pdf_url": "http://arxiv.org/pdf/2503.23136v1",
      "arxiv_url": "http://arxiv.org/abs/2503.23136v1",
      "published": "2025-03-29",
      "categories": [
        "quant-ph"
      ]
    },
    {
      "title": "A Unified Approach for Estimating Various Treatment Effects in Causal Inference",
      "authors": [
        "Kuan-Hsun Wu",
        "Li-Pang Chen"
      ],
      "abstract": "In this paper, we introduce a unified estimator to analyze various treatment\neffects in causal inference, including but not limited to the average treatment\neffect (ATE) and the quantile treatment effect (QTE). The proposed estimator is\ndeveloped under the statistical functional and cumulative distribution function\nstructure, which leads to a flexible and robust estimator and covers some\nfrequent treatment effects. In addition, our approach also takes variable\nselection into account, so that informative and network structure in\nconfounders can be identified and be implemented in our estimation procedure.\nThe theoretical properties, including variable selection consistency and\nasymptotic normality of the statistical functional estimator, are established.\nVarious treatment effects estimations are also conducted in numerical studies,\nand the results reveal that the proposed estimator generally outperforms the\nexisting methods and is more efficient than its competitors.",
      "pdf_url": "http://arxiv.org/pdf/2503.22616v1",
      "arxiv_url": "http://arxiv.org/abs/2503.22616v1",
      "published": "2025-03-28",
      "categories": [
        "stat.ME"
      ]
    },
    {
      "title": "EgoToM: Benchmarking Theory of Mind Reasoning from Egocentric Videos",
      "authors": [
        "Yuxuan Li",
        "Vijay Veerabadran",
        "Michael L. Iuzzolino",
        "Brett D. Roads",
        "Asli Celikyilmaz",
        "Karl Ridgeway"
      ],
      "abstract": "We introduce EgoToM, a new video question-answering benchmark that extends\nTheory-of-Mind (ToM) evaluation to egocentric domains. Using a causal ToM\nmodel, we generate multi-choice video QA instances for the Ego4D dataset to\nbenchmark the ability to predict a camera wearer's goals, beliefs, and next\nactions. We study the performance of both humans and state of the art\nmultimodal large language models (MLLMs) on these three interconnected\ninference problems. Our evaluation shows that MLLMs achieve close to\nhuman-level accuracy on inferring goals from egocentric videos. However, MLLMs\n(including the largest ones we tested with over 100B parameters) fall short of\nhuman performance when inferring the camera wearers' in-the-moment belief\nstates and future actions that are most consistent with the unseen video\nfuture. We believe that our results will shape the future design of an\nimportant class of egocentric digital assistants which are equipped with a\nreasonable model of the user's internal mental states.",
      "pdf_url": "http://arxiv.org/pdf/2503.22152v1",
      "arxiv_url": "http://arxiv.org/abs/2503.22152v1",
      "published": "2025-03-28",
      "categories": [
        "cs.CV",
        "cs.AI"
      ]
    },
    {
      "title": "ClusterSC: Advancing Synthetic Control with Donor Selection",
      "authors": [
        "Saeyoung Rho",
        "Andrew Tang",
        "Noah Bergam",
        "Rachel Cummings",
        "Vishal Misra"
      ],
      "abstract": "In causal inference with observational studies, synthetic control (SC) has\nemerged as a prominent tool. SC has traditionally been applied to\naggregate-level datasets, but more recent work has extended its use to\nindividual-level data. As they contain a greater number of observed units, this\nshift introduces the curse of dimensionality to SC. To address this, we propose\nCluster Synthetic Control (ClusterSC), based on the idea that groups of\nindividuals may exist where behavior aligns internally but diverges between\ngroups. ClusterSC incorporates a clustering step to select only the relevant\ndonors for the target. We provide theoretical guarantees on the improvements\ninduced by ClusterSC, supported by empirical demonstrations on synthetic and\nreal-world datasets. The results indicate that ClusterSC consistently\noutperforms classical SC approaches.",
      "pdf_url": "http://arxiv.org/pdf/2503.21629v1",
      "arxiv_url": "http://arxiv.org/abs/2503.21629v1",
      "published": "2025-03-27",
      "categories": [
        "cs.LG",
        "stat.ML"
      ]
    },
    {
      "title": "Inferring Treatment Effects in Large Panels by Uncovering Latent Similarities",
      "authors": [
        "Ben Deaner",
        "Chen-Wei Hsiang",
        "Andrei Zeleneev"
      ],
      "abstract": "The presence of unobserved confounders is one of the main challenges in\nidentifying treatment effects. In this paper, we propose a new approach to\ncausal inference using panel data with large large $N$ and $T$. Our approach\nimputes the untreated potential outcomes for treated units using the outcomes\nfor untreated individuals with similar values of the latent confounders. In\norder to find units with similar latent characteristics, we utilize long\npre-treatment histories of the outcomes. Our analysis is based on a\nnonparametric, nonlinear, and nonseparable factor model for untreated potential\noutcomes and treatments. The model satisfies minimal smoothness requirements.\nWe impute both missing counterfactual outcomes and propensity scores using\nkernel smoothing based on the constructed measure of latent similarity between\nunits, and demonstrate that our estimates can achieve the optimal nonparametric\nrate of convergence up to log terms. Using these estimates, we construct a\ndoubly robust estimator of the period-specifc average treatment effect on the\ntreated (ATT), and provide conditions, under which this estimator is\n$\\sqrt{N}$-consistent, and asymptotically normal and unbiased. Our simulation\nstudy demonstrates that our method provides accurate inference for a wide range\nof data generating processes.",
      "pdf_url": "http://arxiv.org/pdf/2503.20769v2",
      "arxiv_url": "http://arxiv.org/abs/2503.20769v2",
      "published": "2025-03-26",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "Treatment Effects Inference with High-Dimensional Instruments and Control Variables",
      "authors": [
        "Xiduo Chen",
        "Xingdong Feng",
        "Antonio F. Galvao",
        "Yeheng Ge"
      ],
      "abstract": "Obtaining valid treatment effect inferences remains a challenging problem\nwhen dealing with numerous instruments and non-sparse control variables. In\nthis paper, we propose a novel ridge regularization-based instrumental\nvariables method for estimation and inference in the presence of both\nhigh-dimensional instrumental variables and high-dimensional control variables.\nThese methods are applicable both with and without sparsity assumptions. To\naddress the bias caused by high-dimensional instruments, we introduce a\ntwo-step procedure incorporating a data-splitting strategy. We establish\nstatistical properties of the estimator, including consistency and asymptotic\nnormality. Furthermore, we develop statistical inference procedures by\nproviding a consistent estimator for the asymptotic variance of the estimator.\nThe finite sample performance of the proposed method is evaluated through\nnumerical simulations. Results indicate that the new estimator consistently\noutperforms existing sparsity-based approaches across various settings,\noffering valuable insights for more complex scenarios. Finally, we provide an\nempirical application estimating the causal effect of schooling on earnings by\naddressing potential endogeneity through the use of high-dimensional\ninstrumental variables and high-dimensional covariates.",
      "pdf_url": "http://arxiv.org/pdf/2503.20149v1",
      "arxiv_url": "http://arxiv.org/abs/2503.20149v1",
      "published": "2025-03-26",
      "categories": [
        "econ.EM"
      ]
    }
  ]
}