{
  "last_updated": "2025-11-06T00:53:44.127971",
  "papers": [
    {
      "title": "Peer effect analysis with latent processes",
      "authors": [
        "Vincent Starck"
      ],
      "abstract": "I study peer effects that arise from irreversible decisions in the absence of\na standard social equilibrium. I model a latent sequence of decisions in\ncontinuous time and obtain a closed-form expression for the likelihood, which\nallows to estimate proposed causal estimands. The method avoids regression on\nconditional expectations or linear-in-means regression -- and thus\nreflection-type problems (Manski, 1993) or simultaneity issues -- by modeling\nthe (unobserved) realized direction of causality, whose probability is\nidentified. Under a parsimonious parametric specification, I introduce a peer\neffect parameter meant to capture the causal influence of first-movers on their\npeers. Various forms of peer effect heterogeneity can be accommodated.\nParameters are shown to be consistently estimated by maximum likelihood methods\nand lend themselves to standard inference.",
      "pdf_url": "http://arxiv.org/pdf/2511.02764v1",
      "arxiv_url": "http://arxiv.org/abs/2511.02764v1",
      "published": "2025-11-04",
      "categories": [
        "econ.EM"
      ]
    },
    {
      "title": "Agentic World Modeling for 6G: Near-Real-Time Generative State-Space Reasoning",
      "authors": [
        "Farhad Rezazadeh",
        "Hatim Chergui",
        "Merouane Debbah",
        "Houbing Song",
        "Dusit Niyato",
        "Lingjia Liu"
      ],
      "abstract": "We argue that sixth-generation (6G) intelligence is not fluent token\nprediction but the capacity to imagine and choose -- to simulate future\nscenarios, weigh trade-offs, and act with calibrated uncertainty. We reframe\nopen radio access network (O-RAN) near-real-time (Near-RT) control via\ncounterfactual dynamics and a world modeling (WM) paradigm that learns an\naction-conditioned generative state space. This enables quantitative \"what-if\"\nforecasting beyond large language models (LLMs) as the primary modeling\nprimitive. Actions such as physical resource blocks (PRBs) are treated as\nfirst-class control inputs in a causal world model, and both aleatoric and\nepistemic uncertainty are modeled for prediction and what-if analysis. An\nagentic, model predictive control (MPC)-based cross-entropy method (CEM)\nplanner operates over short horizons, using prior-mean rollouts within\ndata-driven PRB bounds to maximize a deterministic reward. The model couples\nmulti-scale structured state-space mixtures (MS3M) with a compact stochastic\nlatent to form WM-MS3M, summarizing key performance indicators (KPIs) histories\nand predicting next-step KPIs under hypothetical PRB sequences. On realistic\nO-RAN traces, WM-MS3M cuts mean absolute error (MAE) by 1.69% versus MS3M with\n32% fewer parameters and similar latency, and achieves 35-80% lower root mean\nsquared error (RMSE) than attention/hybrid baselines with 2.3-4.1x faster\ninference, enabling rare-event simulation and offline policy screening.",
      "pdf_url": "http://arxiv.org/pdf/2511.02748v1",
      "arxiv_url": "http://arxiv.org/abs/2511.02748v1",
      "published": "2025-11-04",
      "categories": [
        "cs.NI",
        "cs.LG"
      ]
    },
    {
      "title": "A Bayesian Inference of Hybrid Stars with Large Quark Cores",
      "authors": [
        "Milena Albino",
        "Tuhin Malik",
        "Márcio Ferreira",
        "Constança Providência"
      ],
      "abstract": "Neutron stars (NSs) are interesting objects capable of reaching densities\nunattainable on Earth. The properties of matter under these conditions remain a\nmystery. Exotic matter, including quark matter, may be present in the NS core.\nIn this work, we explore the possible compositions of NS cores, in particular,\nthe possible existence of large quark cores. We use the Relativistic Mean Field\n(RMF) model with nonlinear terms for the hadron phase and the\nNambu-Jona-Lasinio (NJL) model and Mean Field Theory of Quantum Chromodynamics\n(MFTQCD) for the quark phase. Through Bayesian inference, we obtain different\nsets of equations: four sets with hybrid equations (three using the NJL model\nand the other using the MFTQCD model), and one set with only the hadron phase.\nWe impose constraints regarding the properties of nuclear matter, X-ray\nobservational data from NICER, perturbative QCD (pQCD) calculations, and\ncausality on all sets. One set of hybrid NJL equations of state was also\nconstrained by adding the GW170817 detection. All sets can describe\nobservational data and theoretical restrictions. The MFTQCD allows for a phase\ntransition to quark matter at lower densities compared to the NJL models. The\nMFTQCD model indicates that NSs with 1.4 solar mass have quark matter in their\ninner core. However, NJL models suggest that it is more probable that 1.4 solar\nmass NSs do not contain quark matter. Both the MFTQCD and NJL models agree that\nthere is quark matter in 2 solar mass NSs. It is discussed that hybrid stars\nwith a stiff quark equation of state could explain a larger radius of more\nmassive stars, such as two solar mass stars, with respect to the canonical NS.",
      "pdf_url": "http://arxiv.org/pdf/2511.02653v1",
      "arxiv_url": "http://arxiv.org/abs/2511.02653v1",
      "published": "2025-11-04",
      "categories": [
        "nucl-th",
        "astro-ph.HE",
        "gr-qc",
        "hep-ph"
      ]
    },
    {
      "title": "Causal Graph Neural Networks for Healthcare",
      "authors": [
        "Munib Mesinovic",
        "Max Buhlan",
        "Tingting Zhu"
      ],
      "abstract": "Healthcare artificial intelligence systems routinely fail when deployed\nacross institutions, with documented performance drops and perpetuation of\ndiscriminatory patterns embedded in historical data. This brittleness stems, in\npart, from learning statistical associations rather than causal mechanisms.\nCausal graph neural networks address this triple crisis of distribution shift,\ndiscrimination, and inscrutability by combining graph-based representations of\nbiomedical data with causal inference principles to learn invariant mechanisms\nrather than spurious correlations. This Review examines methodological\nfoundations spanning structural causal models, disentangled causal\nrepresentation learning, and techniques for interventional prediction and\ncounterfactual reasoning on graphs. We analyse applications demonstrating\nclinical value across psychiatric diagnosis through brain network analysis,\ncancer subtyping via multi-omics causal integration, continuous physiological\nmonitoring with mechanistic interpretation, and drug recommendation correcting\nprescription bias. These advances establish foundations for patient-specific\nCausal Digital Twins, enabling in silico clinical experimentation, with\nintegration of large language models for hypothesis generation and causal graph\nneural networks for mechanistic validation. Substantial barriers remain,\nincluding computational requirements precluding real-time deployment,\nvalidation challenges demanding multi-modal evidence triangulation beyond\ncross-validation, and risks of causal-washing where methods employ causal\nterminology without rigorous evidentiary support. We propose tiered frameworks\ndistinguishing causally-inspired architectures from causally-validated\ndiscoveries and identify critical research priorities making causal rather than\npurely associational claims.",
      "pdf_url": "http://arxiv.org/pdf/2511.02531v1",
      "arxiv_url": "http://arxiv.org/abs/2511.02531v1",
      "published": "2025-11-04",
      "categories": [
        "cs.LG",
        "cs.AI"
      ]
    },
    {
      "title": "Evolving Graph Learning for Out-of-Distribution Generalization in Non-stationary Environments",
      "authors": [
        "Qingyun Sun",
        "Jiayi Luo",
        "Haonan Yuan",
        "Xingcheng Fu",
        "Hao Peng",
        "Jianxin Li",
        "Philip S. Yu"
      ],
      "abstract": "Graph neural networks have shown remarkable success in exploiting the spatial\nand temporal patterns on dynamic graphs. However, existing GNNs exhibit poor\ngeneralization ability under distribution shifts, which is inevitable in\ndynamic scenarios. As dynamic graph generation progresses amid evolving latent\nnon-stationary environments, it is imperative to explore their effects on\nout-of-distribution (OOD) generalization. This paper proposes a novel Evolving\nGraph Learning framework for OOD generalization (EvoOOD) by environment-aware\ninvariant pattern recognition. Specifically, we first design an environment\nsequential variational auto-encoder to model environment evolution and infer\nthe underlying environment distribution. Then, we introduce a mechanism for\nenvironment-aware invariant pattern recognition, tailored to address\nenvironmental diversification through inferred distributions. Finally, we\nconduct fine-grained causal interventions on individual nodes using a mixture\nof instantiated environment samples. This approach helps to distinguish\nspatio-temporal invariant patterns for OOD prediction, especially in\nnon-stationary environments. Experimental results demonstrate the superiority\nof EvoGOOD on both real-world and synthetic dynamic datasets under distribution\nshifts. To the best of our knowledge, it is the first attempt to study the\ndynamic graph OOD generalization problem from the environment evolution\nperspective.",
      "pdf_url": "http://arxiv.org/pdf/2511.02354v1",
      "arxiv_url": "http://arxiv.org/abs/2511.02354v1",
      "published": "2025-11-04",
      "categories": [
        "cs.LG"
      ]
    },
    {
      "title": "Biological Regulatory Network Inference through Circular Causal Structure Learning",
      "authors": [
        "Hongyang Jiang",
        "Yuezhu Wang",
        "Ke Feng",
        "Chaoyi Yin",
        "Yi Chang",
        "Huiyan Sun"
      ],
      "abstract": "Biological networks are pivotal in deciphering the complexity and\nfunctionality of biological systems. Causal inference, which focuses on\ndetermining the directionality and strength of interactions between variables\nrather than merely relying on correlations, is considered a logical approach\nfor inferring biological networks. Existing methods for causal structure\ninference typically assume that causal relationships between variables can be\nrepresented by directed acyclic graphs (DAGs). However, this assumption is at\nodds with the reality of widespread feedback loops in biological systems,\nmaking these methods unsuitable for direct use in biological network inference.\nIn this study, we propose a new framework named SCALD (Structural CAusal model\nfor Loop Diagram), which employs a nonlinear structure equation model and a\nstable feedback loop conditional constraint through continuous optimization to\ninfer causal regulatory relationships under feedback loops. We observe that\nSCALD outperforms state-of-the-art methods in inferring both transcriptional\nregulatory networks and signaling transduction networks. SCALD has\nirreplaceable advantages in identifying feedback regulation. Through\ntranscription factor (TF) perturbation data analysis, we further validate the\naccuracy and sensitivity of SCALD. Additionally, SCALD facilitates the\ndiscovery of previously unknown regulatory relationships, which we have\nsubsequently confirmed through ChIP-seq data analysis. Furthermore, by\nutilizing SCALD, we infer the key driver genes that facilitate the\ntransformation from colon inflammation to cancer by examining the dynamic\nchanges within regulatory networks during the process.",
      "pdf_url": "http://arxiv.org/pdf/2511.02332v1",
      "arxiv_url": "http://arxiv.org/abs/2511.02332v1",
      "published": "2025-11-04",
      "categories": [
        "q-bio.MN",
        "cs.AI"
      ]
    },
    {
      "title": "Towards a Unified Framework for Statistical and Mathematical Modeling",
      "authors": [
        "Paul N Zivich"
      ],
      "abstract": "Within the biological, physical, and social sciences, there are two broad\nquantitative traditions: statistical and mathematical modeling. Both traditions\nhave the common pursuit of advancing our scientific knowledge, but these\ntraditions have developed largely independently using distinct languages and\ninferential frameworks. This paper uses the notion of identification from\ncausal inference, a field originating from the statistical modeling tradition,\nto develop a shared language. I first review foundational identification\nresults for statistical models and then extend these ideas to mathematical\nmodels. Central to this framework is the use of bounds, ranges of plausible\nnumerical values, to analyze both statistical and mathematical models. I\ndiscuss the implications of this perspective for the interpretation,\ncomparison, and integration of different modeling approaches, and illustrate\nthe framework with a simple pharmacodynamic model for hypertension. To\nconclude, I describe areas where the approach taken here should be extended in\nthe future. By formalizing connections between statistical and mathematical\nmodeling, this work contributes to a shared framework for quantitative science.\nMy hope is that this work will advance interactions between these two\ntraditions.",
      "pdf_url": "http://arxiv.org/pdf/2511.01960v1",
      "arxiv_url": "http://arxiv.org/abs/2511.01960v1",
      "published": "2025-11-03",
      "categories": [
        "stat.OT",
        "q-bio.OT"
      ]
    },
    {
      "title": "Making Interpretable Discoveries from Unstructured Data: A High-Dimensional Multiple Hypothesis Testing Approach",
      "authors": [
        "Jacob Carlson"
      ],
      "abstract": "Social scientists are increasingly turning to unstructured datasets to unlock\nnew empirical insights, e.g., estimating causal effects on text outcomes,\nmeasuring beliefs from open-ended survey responses. In such settings,\nunsupervised analysis is often of interest, in that the researcher does not\nwant to pre-specify the objects of measurement or otherwise artificially\ndelimit the space of measurable concepts; they are interested in discovery.\nThis paper proposes a general and flexible framework for pursuing discovery\nfrom unstructured data in a statistically principled way. The framework\nleverages recent methods from the literature on machine learning\ninterpretability to map unstructured data points to high-dimensional, sparse,\nand interpretable dictionaries of concepts; computes (test) statistics of these\ndictionary entries; and then performs selective inference on them using newly\ndeveloped statistical procedures for high-dimensional exceedance control of the\n$k$-FWER under arbitrary dependence. The proposed framework has few researcher\ndegrees of freedom, is fully replicable, and is cheap to implement -- both in\nterms of financial cost and researcher time. Applications to recent descriptive\nand causal analyses of unstructured data in empirical economics are explored.\nAn open source Jupyter notebook is provided for researchers to implement the\nframework in their own projects.",
      "pdf_url": "http://arxiv.org/pdf/2511.01680v1",
      "arxiv_url": "http://arxiv.org/abs/2511.01680v1",
      "published": "2025-11-03",
      "categories": [
        "econ.EM",
        "cs.LG"
      ]
    },
    {
      "title": "Selecting valid adjustment sets with uncertain causal graphs",
      "authors": [
        "Zhongyi Hu",
        "Stéphanie van der Pas"
      ],
      "abstract": "Precise knowledge of causal directed acyclic graphs (DAGs) is assumed for\nstandard approaches towards valid adjustment set selection for unbiased\nestimation, but in practice, the DAG is often inferred from data or expert\nknowledge, introducing uncertainty. We present techniques to identify valid\nadjustment sets despite potential errors in the estimated causal graph.\nSpecifically, we assume that only the skeleton of the DAG is known. Under a\nBayesian framework, we place a prior on graphs and wish to sample graphs and\ncompute the posterior probability of each set being valid; however, directly\ndoing so is inefficient as the number of sets grows exponentially with the\nnumber of nodes in the DAG. We develop theory and techniques so that a limited\nnumber of sets are tested while the probability of finding valid adjustment\nsets remains high. Empirical results demonstrate the effectiveness of the\nmethod.",
      "pdf_url": "http://arxiv.org/pdf/2511.01662v1",
      "arxiv_url": "http://arxiv.org/abs/2511.01662v1",
      "published": "2025-11-03",
      "categories": [
        "math.ST",
        "stat.TH"
      ]
    },
    {
      "title": "Cross-Treatment Effect Estimation for Multi-Category, Multi-Valued Causal Inference via Dynamic Neural Masking",
      "authors": [
        "Xiaopeng Ke",
        "Yihan Yu",
        "Ruyue Zhang",
        "Zhishuo Zhou",
        "Fangzhou Shi",
        "Chang Men",
        "Zhengdan Zhu"
      ],
      "abstract": "Counterfactual causal inference faces significant challenges when extended to\nmulti-category, multi-valued treatments, where complex cross-effects between\nheterogeneous interventions are difficult to model. Existing methodologies\nremain constrained to binary or single-type treatments and suffer from\nrestrictive assumptions, limited scalability, and inadequate evaluation\nframeworks for complex intervention scenarios.\n  We present XTNet, a novel network architecture for multi-category,\nmulti-valued treatment effect estimation. Our approach introduces a\ncross-effect estimation module with dynamic masking mechanisms to capture\ntreatment interactions without restrictive structural assumptions. The\narchitecture employs a decomposition strategy separating basic effects from\ncross-treatment interactions, enabling efficient modeling of combinatorial\ntreatment spaces. We also propose MCMV-AUCC, a suitable evaluation metric that\naccounts for treatment costs and interaction effects. Extensive experiments on\nsynthetic and real-world datasets demonstrate that XTNet consistently\noutperforms state-of-the-art baselines in both ranking accuracy and effect\nestimation quality. The results of the real-world A/B test further confirm its\neffectiveness.",
      "pdf_url": "http://arxiv.org/pdf/2511.01641v1",
      "arxiv_url": "http://arxiv.org/abs/2511.01641v1",
      "published": "2025-11-03",
      "categories": [
        "cs.LG",
        "stat.ML"
      ]
    }
  ]
}