{
  "last_updated": "2025-03-14T00:47:35.802879",
  "papers": [
    {
      "title": "Addressing pitfalls in implicit unobserved confounding synthesis using explicit block hierarchical ancestral sampling",
      "authors": [
        "Xudong Sun",
        "Alex Markham",
        "Pratik Misra",
        "Carsten Marr"
      ],
      "abstract": "Unbiased data synthesis is crucial for evaluating causal discovery algorithms\nin the presence of unobserved confounding, given the scarcity of real-world\ndatasets. A common approach, implicit parameterization, encodes unobserved\nconfounding by modifying the off-diagonal entries of the idiosyncratic\ncovariance matrix while preserving positive definiteness. Within this approach,\nstate-of-the-art protocols have two distinct issues that hinder unbiased\nsampling from the complete space of causal models: first, the use of diagonally\ndominant constructions, which restrict the spectrum of partial correlation\nmatrices; and second, the restriction of possible graphical structures when\nsampling bidirected edges, unnecessarily ruling out valid causal models. To\naddress these limitations, we propose an improved explicit modeling approach\nfor unobserved confounding, leveraging block-hierarchical ancestral generation\nof ground truth causal graphs. Algorithms for converting the ground truth DAG\ninto ancestral graph is provided so that the output of causal discovery\nalgorithms could be compared with. We prove that our approach fully covers the\nspace of causal models, including those generated by the implicit\nparameterization, thus enabling more robust evaluation of methods for causal\ndiscovery and inference.",
      "pdf_url": "http://arxiv.org/pdf/2503.09194v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09194v1",
      "published": "2025-03-12",
      "categories": [
        "stat.ML",
        "cs.LG",
        "math.ST",
        "stat.TH"
      ]
    },
    {
      "title": "Drift-Aware Federated Learning: A Causal Perspective",
      "authors": [
        "Yunjie Fang",
        "Sheng Wu",
        "Tao Yang",
        "Xiaofeng Wu",
        "Bo Hu"
      ],
      "abstract": "Federated learning (FL) facilitates collaborative model training among\nmultiple clients while preserving data privacy, often resulting in enhanced\nperformance compared to models trained by individual clients. However, factors\nsuch as communication frequency and data distribution can contribute to feature\ndrift, hindering the attainment of optimal training performance. This paper\nexamine the relationship between model update drift and global as well as local\noptimizer from causal perspective. The influence of the global optimizer on\nfeature drift primarily arises from the participation frequency of certain\nclients in server updates, whereas the effect of the local optimizer is\ntypically associated with imbalanced data distributions.To mitigate this drift,\nwe propose a novel framework termed Causal drift-Aware Federated lEarning\n(CAFE). CAFE exploits the causal relationship between feature-invariant\ncomponents and classification outcomes to independently calibrate local client\nsample features and classifiers during the training phase. In the inference\nphase, it eliminated the drifts in the global model that favor frequently\ncommunicating clients.Experimental results demonstrate that CAFE's integration\nof feature calibration, parameter calibration, and historical information\neffectively reduces both drift towards majority classes and tendencies toward\nfrequently communicating nodes.",
      "pdf_url": "http://arxiv.org/pdf/2503.09116v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09116v1",
      "published": "2025-03-12",
      "categories": [
        "cs.LG",
        "cs.DC"
      ]
    },
    {
      "title": "Causal-Ex: Causal Graph-based Micro and Macro Expression Spotting",
      "authors": [
        "Pei-Sze Tan",
        "Sailaja Rajanala",
        "Arghya Pal",
        "Raphaël C. -W. Phan",
        "Huey-Fang Ong"
      ],
      "abstract": "Detecting concealed emotions within apparently normal expressions is crucial\nfor identifying potential mental health issues and facilitating timely support\nand intervention. The task of spotting macro and micro-expressions involves\npredicting the emotional timeline within a video, accomplished by identifying\nthe onset, apex, and offset frames of the displayed emotions. Utilizing\nfoundational facial muscle movement cues, known as facial action units, boosts\nthe accuracy. However, an overlooked challenge from previous research lies in\nthe inadvertent integration of biases into the training model. These biases\narising from datasets can spuriously link certain action unit movements to\nparticular emotion classes. We tackle this issue by novel replacement of action\nunit adjacency information with the action unit causal graphs. This approach\naims to identify and eliminate undesired spurious connections, retaining only\nunbiased information for classification. Our model, named Causal-Ex\n(Causal-based Expression spotting), employs a rapid causal inference algorithm\nto construct a causal graph of facial action units. This enables us to select\ncausally relevant facial action units. Our work demonstrates improvement in\noverall F1-scores compared to state-of-the-art approaches with 0.388 on\nCAS(ME)^2 and 0.3701 on SAMM-Long Video datasets.",
      "pdf_url": "http://arxiv.org/pdf/2503.09098v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09098v1",
      "published": "2025-03-12",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "StratIncon Detector: Analyzing Strategy Inconsistencies Between Real-Time Strategy and Preferred Professional Strategy in MOBA Esports",
      "authors": [
        "Ruofei Ma",
        "Yu Zhao",
        "Yuheng Shao",
        "Yunjie Yao",
        "Quan Li"
      ],
      "abstract": "MOBA (Multiplayer Online Battle Arena) games require a delicate interplay of\nstrategic planning and real-time decision-making, particularly in professional\nesports, where players exhibit varying levels of skill and strategic insight.\nWhile team strategies have been widely studied, analyzing inconsistencies in\nprofessional matches remains a significant challenge. The complexity lies in\ndefining and quantifying the difference between real-time and preferred\nprofessional strategies, as well as understanding the disparities between them.\nEstablishing direct causal links between specific strategic decisions and game\noutcomes also demands a comprehensive analysis of the entire match progression.\nTo tackle these challenges, we present the StratIncon Detector, a visual\nanalytics system designed to assist professional players and coaches in\nefficiently identifying strategic inconsistencies. The system detects real-time\nstrategies, predicts preferred professional strategies, extracts relevant human\nfactors, and uncovers their impact on subsequent game phases. Findings from a\ncase study, a user study with 24 participants, and expert interviews suggest\nthat, compared to traditional methods, the StratIncon Detector enables users to\nmore comprehensively and efficiently identify inconsistencies, infer their\ncauses, evaluate their effects on subsequent game outcomes, and gain deeper\ninsights into team collaboration-ultimately enhancing future teamwork.",
      "pdf_url": "http://arxiv.org/pdf/2503.09060v1",
      "arxiv_url": "http://arxiv.org/abs/2503.09060v1",
      "published": "2025-03-12",
      "categories": [
        "cs.HC"
      ]
    },
    {
      "title": "ESNLIR: A Spanish Multi-Genre Dataset with Causal Relationships",
      "authors": [
        "Johan R. Portela",
        "Nicolás Perez",
        "Rubén Manrique"
      ],
      "abstract": "Natural Language Inference (NLI), also known as Recognizing Textual\nEntailment (RTE), serves as a crucial area within the domain of Natural\nLanguage Processing (NLP). This area fundamentally empowers machines to discern\nsemantic relationships between assorted sections of text. Even though\nconsiderable work has been executed for the English language, it has been\nobserved that efforts for the Spanish language are relatively sparse. Keeping\nthis in view, this paper focuses on generating a multi-genre Spanish dataset\nfor NLI, ESNLIR, particularly accounting for causal Relationships. A\npreliminary baseline has been conceptualized and subjected to an evaluation,\nleveraging models drawn from the BERT family. The findings signify that the\nenrichment of genres essentially contributes to the enrichment of the model's\ncapability to generalize.\n  The code, notebooks and whole datasets for this experiments is available at:\nhttps://zenodo.org/records/15002575. If you are interested only in the dataset\nyou can find it here: https://zenodo.org/records/15002371.",
      "pdf_url": "http://arxiv.org/pdf/2503.08803v1",
      "arxiv_url": "http://arxiv.org/abs/2503.08803v1",
      "published": "2025-03-11",
      "categories": [
        "cs.CL"
      ]
    },
    {
      "title": "\"Principal Components\" Enable A New Language of Images",
      "authors": [
        "Xin Wen",
        "Bingchen Zhao",
        "Ismail Elezi",
        "Jiankang Deng",
        "Xiaojuan Qi"
      ],
      "abstract": "We introduce a novel visual tokenization framework that embeds a provable\nPCA-like structure into the latent token space. While existing visual\ntokenizers primarily optimize for reconstruction fidelity, they often neglect\nthe structural properties of the latent space -- a critical factor for both\ninterpretability and downstream tasks. Our method generates a 1D causal token\nsequence for images, where each successive token contributes non-overlapping\ninformation with mathematically guaranteed decreasing explained variance,\nanalogous to principal component analysis. This structural constraint ensures\nthe tokenizer extracts the most salient visual features first, with each\nsubsequent token adding diminishing yet complementary information.\nAdditionally, we identified and resolved a semantic-spectrum coupling effect\nthat causes the unwanted entanglement of high-level semantic content and\nlow-level spectral details in the tokens by leveraging a diffusion decoder.\nExperiments demonstrate that our approach achieves state-of-the-art\nreconstruction performance and enables better interpretability to align with\nthe human vision system. Moreover, auto-regressive models trained on our token\nsequences achieve performance comparable to current state-of-the-art methods\nwhile requiring fewer tokens for training and inference.",
      "pdf_url": "http://arxiv.org/pdf/2503.08685v1",
      "arxiv_url": "http://arxiv.org/abs/2503.08685v1",
      "published": "2025-03-11",
      "categories": [
        "cs.CV"
      ]
    },
    {
      "title": "Perplexity Trap: PLM-Based Retrievers Overrate Low Perplexity Documents",
      "authors": [
        "Haoyu Wang",
        "Sunhao Dai",
        "Haiyuan Zhao",
        "Liang Pang",
        "Xiao Zhang",
        "Gang Wang",
        "Zhenhua Dong",
        "Jun Xu",
        "Ji-Rong Wen"
      ],
      "abstract": "Previous studies have found that PLM-based retrieval models exhibit a\npreference for LLM-generated content, assigning higher relevance scores to\nthese documents even when their semantic quality is comparable to human-written\nones. This phenomenon, known as source bias, threatens the sustainable\ndevelopment of the information access ecosystem. However, the underlying causes\nof source bias remain unexplored. In this paper, we explain the process of\ninformation retrieval with a causal graph and discover that PLM-based\nretrievers learn perplexity features for relevance estimation, causing source\nbias by ranking the documents with low perplexity higher. Theoretical analysis\nfurther reveals that the phenomenon stems from the positive correlation between\nthe gradients of the loss functions in language modeling task and retrieval\ntask. Based on the analysis, a causal-inspired inference-time debiasing method\nis proposed, called Causal Diagnosis and Correction (CDC). CDC first diagnoses\nthe bias effect of the perplexity and then separates the bias effect from the\noverall estimated relevance score. Experimental results across three domains\ndemonstrate the superior debiasing effectiveness of CDC, emphasizing the\nvalidity of our proposed explanatory framework. Source codes are available at\nhttps://github.com/WhyDwelledOnAi/Perplexity-Trap.",
      "pdf_url": "http://arxiv.org/pdf/2503.08684v1",
      "arxiv_url": "http://arxiv.org/abs/2503.08684v1",
      "published": "2025-03-11",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.IR"
      ]
    },
    {
      "title": "Causal Networks of Infodemiological Data: Modelling Dermatitis",
      "authors": [
        "Marco Scutari",
        "Samir Salah",
        "Delphine Kerob",
        "Jean Krutmann"
      ],
      "abstract": "Environmental and mental conditions are known risk factors for dermatitis and\nsymptoms of skin inflammation, but their interplay is difficult to quantify;\nepidemiological studies rarely include both, along with possible confounding\nfactors. Infodemiology leverages large online data sets to address this issue,\nbut fusing them produces strong patterns of spatial and temporal correlation,\nmissingness, and heterogeneity.\n  In this paper, we design a causal network that correctly models these complex\nstructures in large-scale infodemiological data from Google, EPA, NOAA and US\nCensus (434 US counties, 134 weeks). Our model successfully captures known\ncausal relationships between weather patterns, pollutants, mental conditions,\nand dermatitis. Key findings reveal that anxiety accounts for 57.4% of\nexplained variance in dermatitis, followed by NO2 (33.9%), while environmental\nfactors show significant mediation effects through mental conditions. The model\npredicts that reducing PM2.5 emissions by 25% could decrease dermatitis\nprevalence by 18%. Through statistical validation and causal inference, we\nprovide unprecedented insights into the complex interplay between environmental\nand mental health factors affecting dermatitis, offering valuable guidance for\npublic health policies and environmental regulations.",
      "pdf_url": "http://arxiv.org/pdf/2503.08252v1",
      "arxiv_url": "http://arxiv.org/abs/2503.08252v1",
      "published": "2025-03-11",
      "categories": [
        "stat.ME",
        "stat.AP"
      ]
    },
    {
      "title": "A primer on optimal transport for causal inference with observational data",
      "authors": [
        "Florian F Gunsilius"
      ],
      "abstract": "The theory of optimal transportation has developed into a powerful and\nelegant framework for comparing probability distributions, with wide-ranging\napplications in all areas of science. The fundamental idea of analyzing\nprobabilities by comparing their underlying state space naturally aligns with\nthe core idea of causal inference, where understanding and quantifying\ncounterfactual states is paramount. Despite this intuitive connection, explicit\nresearch at the intersection of optimal transport and causal inference is only\nbeginning to develop. Yet, many foundational models in causal inference have\nimplicitly relied on optimal transport principles for decades, without\nrecognizing the underlying connection. Therefore, the goal of this review is to\noffer an introduction to the surprisingly deep existing connections between\noptimal transport and the identification of causal effects with observational\ndata -- where optimal transport is not just a set of potential tools, but\nactually builds the foundation of model assumptions. As a result, this review\nis intended to unify the language and notation between different areas of\nstatistics, mathematics, and econometrics, by pointing out these existing\nconnections, and to explore novel problems and directions for future work in\nboth areas derived from this realization.",
      "pdf_url": "http://arxiv.org/pdf/2503.07811v2",
      "arxiv_url": "http://arxiv.org/abs/2503.07811v2",
      "published": "2025-03-10",
      "categories": [
        "stat.ME",
        "cs.AI",
        "econ.EM"
      ]
    },
    {
      "title": "AR-Diffusion: Asynchronous Video Generation with Auto-Regressive Diffusion",
      "authors": [
        "Mingzhen Sun",
        "Weining Wang",
        "Gen Li",
        "Jiawei Liu",
        "Jiahui Sun",
        "Wanquan Feng",
        "Shanshan Lao",
        "SiYu Zhou",
        "Qian He",
        "Jing Liu"
      ],
      "abstract": "The task of video generation requires synthesizing visually realistic and\ntemporally coherent video frames. Existing methods primarily use asynchronous\nauto-regressive models or synchronous diffusion models to address this\nchallenge. However, asynchronous auto-regressive models often suffer from\ninconsistencies between training and inference, leading to issues such as error\naccumulation, while synchronous diffusion models are limited by their reliance\non rigid sequence length. To address these issues, we introduce Auto-Regressive\nDiffusion (AR-Diffusion), a novel model that combines the strengths of\nauto-regressive and diffusion models for flexible, asynchronous video\ngeneration. Specifically, our approach leverages diffusion to gradually corrupt\nvideo frames in both training and inference, reducing the discrepancy between\nthese phases. Inspired by auto-regressive generation, we incorporate a\nnon-decreasing constraint on the corruption timesteps of individual frames,\nensuring that earlier frames remain clearer than subsequent ones. This setup,\ntogether with temporal causal attention, enables flexible generation of videos\nwith varying lengths while preserving temporal coherence. In addition, we\ndesign two specialized timestep schedulers: the FoPP scheduler for balanced\ntimestep sampling during training, and the AD scheduler for flexible timestep\ndifferences during inference, supporting both synchronous and asynchronous\ngeneration. Extensive experiments demonstrate the superiority of our proposed\nmethod, which achieves competitive and state-of-the-art results across four\nchallenging benchmarks.",
      "pdf_url": "http://arxiv.org/pdf/2503.07418v1",
      "arxiv_url": "http://arxiv.org/abs/2503.07418v1",
      "published": "2025-03-10",
      "categories": [
        "cs.CV"
      ]
    }
  ]
}